{
  "transcript_parts": [
    {
      "text": "going.",
      "timestamp": "2025-09-11T10:07:49.879610"
    },
    {
      "text": "Ladies and gentlemen Indigo Airlines is about to play the",
      "timestamp": "2025-09-11T10:07:54.181145"
    },
    {
      "text": "Gentlemen Indigo Airlines is about to play the greatest gamble in its history. A GAMBELLS!",
      "timestamp": "2025-09-11T10:07:58.942123"
    },
    {
      "text": "latest gamble in its history. A gamble so dangerous so unpredictable that it could either...",
      "timestamp": "2025-09-11T10:08:03.298058"
    },
    {
      "text": "so dangerous so unpredictable that it could either make integral the emeralds of India or",
      "timestamp": "2025-09-11T10:08:08.070831"
    },
    {
      "text": "make indigo the Emirates of India or landam and trouble like kingfisher and jet.",
      "timestamp": "2025-09-11T10:08:12.771300"
    },
    {
      "text": "Landerman trouble like Kingfisher and Jet Airways",
      "timestamp": "2025-09-11T10:08:17.272445"
    },
    {
      "text": "Airways. Okay. Ladies and gentlemen, also your speed bus. Or we are ready for take.",
      "timestamp": "2025-09-11T10:08:22.538909"
    },
    {
      "text": "Don't not fasten your seatbelt, or we're ready for take-off.",
      "timestamp": "2025-09-11T10:08:27.378975"
    },
    {
      "text": "Polski Michael",
      "timestamp": "2025-09-11T10:08:52.089645"
    },
    {
      "text": "Indigo in their largest airline is in cream.",
      "timestamp": "2025-09-11T10:08:56.333903"
    },
    {
      "text": "Indigo in their largest airline is increasing its international growth and will be adding six.",
      "timestamp": "2025-09-11T10:09:01.314330"
    },
    {
      "text": "using its international rules and will be adding fixed new international destinations by August.",
      "timestamp": "2025-09-11T10:09:05.658465"
    },
    {
      "text": "new International Definitions by August.",
      "timestamp": "2025-09-11T10:09:09.566417"
    },
    {
      "text": "The largest airline in the go is Tetris.",
      "timestamp": "2025-09-11T10:09:13.656393"
    },
    {
      "text": "The largest airline in the go is set to sword Newhine, launching direct flight to Manj",
      "timestamp": "2025-09-11T10:09:18.501731"
    },
    {
      "text": "so new heights launching direct lights to Manchester and Amsterdam from July 2025.",
      "timestamp": "2025-09-11T10:09:22.894361"
    },
    {
      "text": "to stir an Amsterdam from July 2025. This is Indigo's grade.",
      "timestamp": "2025-09-11T10:09:27.521019"
    },
    {
      "text": "This is Indigo's great gamble of going international.",
      "timestamp": "2025-09-11T10:09:31.636285"
    },
    {
      "text": "Amber of Going international",
      "timestamp": "2025-09-11T10:09:43.584542"
    },
    {
      "text": "In the rowing",
      "timestamp": "2025-09-11T10:09:47.291526"
    },
    {
      "text": "In the growing economy and the growing ambitious of India.",
      "timestamp": "2025-09-11T10:09:51.539608"
    },
    {
      "text": "economy and the growing ambitious of India. We see a lot of opportunities in Partner growth inkm",
      "timestamp": "2025-09-11T10:10:06.350808"
    },
    {
      "text": "We see a lot of opportunities in further grow international.",
      "timestamp": "2025-09-11T10:10:10.709952"
    },
    {
      "text": "The nationals Damn Gobierno",
      "timestamp": "2025-09-11T10:10:25.457661"
    },
    {
      "text": "sounds for how you make a?\" send a warning for practise",
      "timestamp": "2025-09-11T10:10:44.137759"
    },
    {
      "text": "Come on come on",
      "timestamp": "2025-09-11T10:10:59.088633"
    },
    {
      "text": "Affordable or sick gone So you might think bro, what is the big deal with this?",
      "timestamp": "2025-09-11T10:11:03.898614"
    },
    {
      "text": "So you might think bro what is a big deal with this? What is the special about going international? Special?",
      "timestamp": "2025-09-11T10:11:09.048919"
    },
    {
      "text": "What is the special about going international especially for an airline like Indigo? Indigo makes a",
      "timestamp": "2025-09-11T10:11:13.910651"
    },
    {
      "text": "for an airline like Indigo. Indigo makes a revenue of 84,000 crores and",
      "timestamp": "2025-09-11T10:11:18.598025"
    },
    {
      "text": "of 84,000 crores and last year alone they made 7,000 crores.",
      "timestamp": "2025-09-11T10:11:23.104634"
    },
    {
      "text": "last year alone they made 7200 crores in profits so why?",
      "timestamp": "2025-09-11T10:11:27.306488"
    },
    {
      "text": "200 crores in profits. So why are we calling it a gamble? Well that is...",
      "timestamp": "2025-09-11T10:11:32.041479"
    },
    {
      "text": "Why are we calling it a gamble? Well that is because ladies and gentlemen, while in India...",
      "timestamp": "2025-09-11T10:11:36.687258"
    },
    {
      "text": "because ladies and gentlemen while in India 7000 crores seems like a lot in India.",
      "timestamp": "2025-09-11T10:11:41.214907"
    },
    {
      "text": "7,000 crores seems like a lot in the international aviation market that is practical.",
      "timestamp": "2025-09-11T10:11:45.703477"
    },
    {
      "text": "international aviation market that is practically pocket change because if you look at",
      "timestamp": "2025-09-11T10:11:50.043353"
    },
    {
      "text": "a glee pocket change because if you look at Indigo's computers in the international space",
      "timestamp": "2025-09-11T10:11:54.883922"
    },
    {
      "text": "Indigos, competitors in the international space, Emirates stands at a profit of $5,330.",
      "timestamp": "2025-09-11T10:11:59.879687"
    },
    {
      "text": "Emirates stands at a profit of 53,000 crores and Qatar Airways made 8",
      "timestamp": "2025-09-11T10:12:04.580509"
    },
    {
      "text": "thousand crores and Qatar Airways made 18,700 crores in profits.",
      "timestamp": "2025-09-11T10:12:09.168625"
    },
    {
      "text": "$13,700 crores in profits. And sure, the scary part is that Emirates...",
      "timestamp": "2025-09-11T10:12:13.836144"
    },
    {
      "text": "And here the scary part is that Emirates, Etihad and Qatar are in just airlines",
      "timestamp": "2025-09-11T10:12:18.432680"
    },
    {
      "text": "and cutters, arranges airlines, they are priced possessions of the riches.",
      "timestamp": "2025-09-11T10:12:23.067533"
    },
    {
      "text": "There are placed possessions of the richest governments in the world of Emirates. The one.",
      "timestamp": "2025-09-11T10:12:27.827981"
    },
    {
      "text": "government in the wood Emirates, the Longhawk carrier. No shortage luxury services.",
      "timestamp": "2025-09-11T10:12:32.367554"
    },
    {
      "text": "All carrier, known for its luxury services, is set in new standards for the waving travel.",
      "timestamp": "2025-09-11T10:12:36.989506"
    },
    {
      "text": "We set new standards for the wave travel. Arab world's biggest airline Emirates said...",
      "timestamp": "2025-09-11T10:12:41.949960"
    },
    {
      "text": "world's biggest airline Emirates says that profits for the 12 months ending in March to 9.",
      "timestamp": "2025-09-11T10:12:46.734550"
    },
    {
      "text": "that profits for the 12 months ending in March to $964 million. Cut, sorry.",
      "timestamp": "2025-09-11T10:12:51.434166"
    },
    {
      "text": "$964 million. Because our race has won the worst best car line of the-",
      "timestamp": "2025-09-11T10:12:55.963842"
    },
    {
      "text": "has won the worst best airline of the year for the line side.",
      "timestamp": "2025-09-11T10:13:00.352464"
    },
    {
      "text": "for the line side. Our vision and the emissions statement.",
      "timestamp": "2025-09-11T10:13:05.137702"
    },
    {
      "text": "Our vision and our mission statement is just in one sentence to be",
      "timestamp": "2025-09-11T10:13:09.731983"
    },
    {
      "text": "and just in one sentence to be the best airline in the world. So, we are backed by oil man.",
      "timestamp": "2025-09-11T10:13:14.862071"
    },
    {
      "text": "the best Iranian world. So they are backed by oil money and they are protected by state power.",
      "timestamp": "2025-09-11T10:13:19.575272"
    },
    {
      "text": "and they are protected by state power. And these airlines are built to out",
      "timestamp": "2025-09-11T10:13:24.389503"
    },
    {
      "text": "And these airlines are built to outspend, outfly and outlast anyone.",
      "timestamp": "2025-09-11T10:13:29.148411"
    },
    {
      "text": "spend, outflying and outlast anyone who dares to challenge people. And now...",
      "timestamp": "2025-09-11T10:13:34.083352"
    },
    {
      "text": "who dares to challenge them and now Indigo is stepping onto this battlefield.",
      "timestamp": "2025-09-11T10:13:38.811891"
    },
    {
      "text": "Indigo is stepping onto this battlefield, but the problem is that they have no oil power.",
      "timestamp": "2025-09-11T10:13:43.647690"
    },
    {
      "text": "But the problem is that they have no oil power, no government funding and barely",
      "timestamp": "2025-09-11T10:13:48.172594"
    },
    {
      "text": "no government funding in barely any global presence and if that wasn't a",
      "timestamp": "2025-09-11T10:13:52.531449"
    },
    {
      "text": "any global presence and if that wasn't a terrifying enough, history tells us that",
      "timestamp": "2025-09-11T10:13:57.449712"
    },
    {
      "text": "if I can't enough, history tells us that two low cost airlines have already tried",
      "timestamp": "2025-09-11T10:14:01.891741"
    },
    {
      "text": "to low cost airline have already tried this gamble before and they failed miserably.",
      "timestamp": "2025-09-11T10:14:06.463184"
    },
    {
      "text": "as gamble before, and they feel misery bleHave臂 that the European Discount's carrier noь wages...",
      "timestamp": "2025-09-11T10:14:26.027426"
    },
    {
      "text": "the European discount carrier Norwegian Air has announced it will end in transit",
      "timestamp": "2025-09-11T10:14:30.377234"
    },
    {
      "text": "air has announced it will end in the transit landing flight. The business model doesn't work.",
      "timestamp": "2025-09-11T10:14:35.091503"
    },
    {
      "text": "The business model doesn't work and they're saddened now with enormous debt.",
      "timestamp": "2025-09-11T10:14:39.814293"
    },
    {
      "text": "and they're saddened not with enormous diss. Ice lands cash drop carrier Wow Airlines has seen",
      "timestamp": "2025-09-11T10:14:44.747121"
    },
    {
      "text": "and the Castro-Carrier Wow Airlines has ceased operations leaving passengers stranded across",
      "timestamp": "2025-09-11T10:14:49.230432"
    },
    {
      "text": "operations leaving passengers stranded across two continents. The customers looking for refunds.",
      "timestamp": "2025-09-11T10:14:53.853317"
    },
    {
      "text": "Two continents. The customers looking for refunds are being told to take it up with their credit card company.",
      "timestamp": "2025-09-11T10:14:58.967303"
    },
    {
      "text": "are being told to take it up with their credit card companies or their travel agents. So the question is...",
      "timestamp": "2025-09-11T10:15:03.994494"
    },
    {
      "text": "or their travel agency.",
      "timestamp": "2025-09-11T10:15:07.941109"
    },
    {
      "text": "When so many giants have failed, why is Indigo crazy enough to gamble their profits? What exactly...",
      "timestamp": "2025-09-11T10:15:13.267591"
    },
    {
      "text": "go crazy enough to gamble their profits, what exactly is your business strategy to",
      "timestamp": "2025-09-11T10:15:19.838406"
    },
    {
      "text": "is a business strategy to collect the toughest market in aviation, how will this stand against?",
      "timestamp": "2025-09-11T10:15:24.730503"
    },
    {
      "text": "in aviation, how will this stand against Emirates Qatar and the oil-backed titans of the",
      "timestamp": "2025-09-11T10:15:29.749402"
    },
    {
      "text": "Emirates, Qatar and the oil-backed items of the sky and most importantly how do they plan",
      "timestamp": "2025-09-11T10:15:34.803632"
    },
    {
      "text": "and most importantly how do they plan to win this gamble? Watch this episode with...",
      "timestamp": "2025-09-11T10:15:39.359830"
    },
    {
      "text": "to win this gamble. Watch this episode very very carefully because if you are a student of business or a...",
      "timestamp": "2025-09-11T10:15:44.273661"
    },
    {
      "text": "very carefully because if you are a student of business or a professor of business, this case study is going to be...",
      "timestamp": "2025-09-11T10:15:49.408649"
    },
    {
      "text": "Professor of Business, this case study is going to be music to your ears.",
      "timestamp": "2025-09-11T10:15:53.870713"
    },
    {
      "text": "to be in music to your ears.",
      "timestamp": "2025-09-11T10:15:57.953429"
    },
    {
      "text": "We'll be back...",
      "timestamp": "2025-09-11T10:16:34.858950"
    },
    {
      "text": "It hanged a hard PSPD contenti Hey we'll see..",
      "timestamp": "2025-09-11T10:16:51.371665"
    },
    {
      "text": "outskilled for supporting our content. People I have a special announcement for everyone who are tech professionals.",
      "timestamp": "2025-09-11T10:16:56.366657"
    },
    {
      "text": "For everyone who are tech professionals, coders or works in a technical field, if you",
      "timestamp": "2025-09-11T10:17:00.971662"
    },
    {
      "text": "code is our works in a technical field. If you can dedicate just one week into this",
      "timestamp": "2025-09-11T10:17:05.524820"
    },
    {
      "text": "can dedicate just one week into this.",
      "timestamp": "2025-09-11T10:17:09.677451"
    },
    {
      "text": "after Patrol pumps Turkey",
      "timestamp": "2025-09-11T10:17:25.108486"
    },
    {
      "text": "1000 rupees for a single audience. This program is being made free.",
      "timestamp": "2025-09-11T10:17:29.386298"
    },
    {
      "text": "This program is being made free. In this program, you will gain in depth knowledge.",
      "timestamp": "2025-09-11T10:17:34.294779"
    },
    {
      "text": "In this program you will gain in-depth knowledge on a wide range of topics including",
      "timestamp": "2025-09-11T10:17:38.804862"
    },
    {
      "text": "on a wide range of topics including understanding how AM models and LLMs like G.",
      "timestamp": "2025-09-11T10:17:43.606719"
    },
    {
      "text": "Understanding how AI models in LLMs like GPD and Claude work build and deploy first at AI",
      "timestamp": "2025-09-11T10:17:48.481856"
    },
    {
      "text": "in cloud work, build and deploy first at AI agents, design",
      "timestamp": "2025-09-11T10:17:54.839131"
    },
    {
      "text": "by agents, design Agents AI Framework and Systems,",
      "timestamp": "2025-09-11T10:18:00.990521"
    },
    {
      "text": "systems, Deploy production ready by-planes, build multi-level agents that can replace a team of code.",
      "timestamp": "2025-09-11T10:18:06.440542"
    },
    {
      "text": "Build multi-level agents that can replace a team of 4 to 5 engineers and a lot more and",
      "timestamp": "2025-09-11T10:18:11.409839"
    },
    {
      "text": "5 engineers and a lot more and that is just the beginning of this program especially",
      "timestamp": "2025-09-11T10:18:15.820825"
    },
    {
      "text": "that is just the beginning of this program, especially designed for engineers, coders, data analysis.",
      "timestamp": "2025-09-11T10:18:20.819858"
    },
    {
      "text": "design for engineers, coders, data analysis, data scientists and all those who understand",
      "timestamp": "2025-09-11T10:18:25.768988"
    },
    {
      "text": "and all those who understand coding well and you know over one lakh people from",
      "timestamp": "2025-09-11T10:18:30.272969"
    },
    {
      "text": "and you know over one lakh people from 40 countries have already participated in this",
      "timestamp": "2025-09-11T10:18:34.891925"
    },
    {
      "text": "40 countries have already participated in this program and the slots are filling up faster than",
      "timestamp": "2025-09-11T10:18:39.542686"
    },
    {
      "text": "and the slots are filling us faster than ever. So click the link in the description. Book your...",
      "timestamp": "2025-09-11T10:18:44.689673"
    },
    {
      "text": "So click the link in the description, book your slot and make sure to join their WhatsApp groups.",
      "timestamp": "2025-09-11T10:18:49.842136"
    },
    {
      "text": "slot and make sure to join their WhatsApp groups to receive all updates. And now on",
      "timestamp": "2025-09-11T10:18:54.657098"
    },
    {
      "text": "receive all updates and now on to the episode",
      "timestamp": "2025-09-11T10:18:59.044873"
    },
    {
      "text": "Idea-video episode",
      "timestamp": "2025-09-11T10:19:11.884399"
    },
    {
      "text": "You understand the danger that-",
      "timestamp": "2025-09-11T10:19:15.905676"
    },
    {
      "text": "To understand the danger that Indigo is getting into, you first need to understand...",
      "timestamp": "2025-09-11T10:19:20.491042"
    },
    {
      "text": "Indigo is getting into you first need to understand Indigo's playbook and the three deadly",
      "timestamp": "2025-09-11T10:19:25.235051"
    },
    {
      "text": "and the three deadly traps in the Indian Aviation market.",
      "timestamp": "2025-09-11T10:19:29.631364"
    },
    {
      "text": "in the Indian Aviation market. You know, from the outset, on a pitch deck...",
      "timestamp": "2025-09-11T10:19:34.902249"
    },
    {
      "text": "You know from the outset on a pitch deck Indigo seems to be in a rosy market.",
      "timestamp": "2025-09-11T10:19:39.824892"
    },
    {
      "text": "Indigo seems to be in a rosy market. Why? Because in just 2024.",
      "timestamp": "2025-09-11T10:19:44.781748"
    },
    {
      "text": "Why? Because in just 2024, 174 million...",
      "timestamp": "2025-09-11T10:19:49.215227"
    },
    {
      "text": "174 million Indians took a flight in India. And India is the...",
      "timestamp": "2025-09-11T10:19:54.011059"
    },
    {
      "text": "Indians took a flight and India is the third largest aviation market in the world.",
      "timestamp": "2025-09-11T10:19:58.720461"
    },
    {
      "text": "The third largest aviation market in the world, only behind the US and China.",
      "timestamp": "2025-09-11T10:20:03.152555"
    },
    {
      "text": "Only behind the US and China. So most people would assume that if the demand is exploding.",
      "timestamp": "2025-09-11T10:20:07.953808"
    },
    {
      "text": "people would assume that if the demand is exploding if the planes are full and the Indians are flying like this.",
      "timestamp": "2025-09-11T10:20:12.889686"
    },
    {
      "text": "if the planes are full and the Indians are flying like never before, the airlines in India must be...",
      "timestamp": "2025-09-11T10:20:17.855109"
    },
    {
      "text": "Before the airlines in India must be winning money right wrong",
      "timestamp": "2025-09-11T10:20:22.378221"
    },
    {
      "text": "winning money right wrong the shocking fact is that between 20",
      "timestamp": "2025-09-11T10:20:26.520477"
    },
    {
      "text": "The shocking fact is that between 20, 14 and 2023 the entire",
      "timestamp": "2025-09-11T10:20:30.835839"
    },
    {
      "text": "the entire industry was just profitable for",
      "timestamp": "2025-09-11T10:20:34.965740"
    },
    {
      "text": "industry was just profitable for one year why because Indian",
      "timestamp": "2025-09-11T10:20:39.204964"
    },
    {
      "text": "one, your why? Because Indian Airlines fall into three deadly taps.",
      "timestamp": "2025-09-11T10:20:43.711422"
    },
    {
      "text": "airlines fall into three deadly taps of aviation. The first trap is the",
      "timestamp": "2025-09-11T10:20:48.407833"
    },
    {
      "text": "of aviation. The first trap is the fuel tax and you will be shocked and old.",
      "timestamp": "2025-09-11T10:20:53.032664"
    },
    {
      "text": "and you will be shocked to know that while London and Dubai charge zero",
      "timestamp": "2025-09-11T10:20:57.501000"
    },
    {
      "text": "That while London and Dubai charge 0% tax on aviation turbine fuel.",
      "timestamp": "2025-09-11T10:21:02.092348"
    },
    {
      "text": "in India, where in Tamil Nadu, Delhi, India, India, India, India, India, India, India,",
      "timestamp": "2025-09-11T10:21:07.280700"
    },
    {
      "text": "In India, Vat in Tamil Nadu, Delhi and Maharashtra is about 29%.",
      "timestamp": "2025-09-11T10:21:12.253400"
    },
    {
      "text": "and Mara Stras is about 29% 25% and 18%",
      "timestamp": "2025-09-11T10:21:16.849397"
    },
    {
      "text": "25% and 18% respectively. Now if you think about",
      "timestamp": "2025-09-11T10:21:21.410625"
    },
    {
      "text": "respectively. Now if you think about this the fuel that costs 17 rupees a litre",
      "timestamp": "2025-09-11T10:21:25.954967"
    },
    {
      "text": "this the fuel that costs 17 rupees a litre will cost at 90 rupees in Tamil Nadu.",
      "timestamp": "2025-09-11T10:21:30.848408"
    },
    {
      "text": "will cost 90 rupees in Tamil Nadu. Now if you apply this to a two hour flight",
      "timestamp": "2025-09-11T10:21:35.727961"
    },
    {
      "text": "Now if you apply this to a 2 hour flight that will need 6200 liters of",
      "timestamp": "2025-09-11T10:21:40.124718"
    },
    {
      "text": "that will need 6200 liters of fuel. It is 1.244",
      "timestamp": "2025-09-11T10:21:44.677676"
    },
    {
      "text": "fuel, it is 1.24 LAC rupees extra per flight.",
      "timestamp": "2025-09-11T10:21:49.140760"
    },
    {
      "text": "for the LAC rupees extra per flight. And if you do the math, you will see that if I come...",
      "timestamp": "2025-09-11T10:21:54.360287"
    },
    {
      "text": "And if you do the math, you will see that if a company operates 260 to our flights for",
      "timestamp": "2025-09-11T10:21:59.164819"
    },
    {
      "text": "the company operates 262 hour flights for a day. They are paying 1000",
      "timestamp": "2025-09-11T10:22:03.846841"
    },
    {
      "text": "they are paying 1,170 crores in just",
      "timestamp": "2025-09-11T10:22:08.172073"
    },
    {
      "text": "170 crores in just wet every single year.",
      "timestamp": "2025-09-11T10:22:12.493856"
    },
    {
      "text": "just to wait every single year. So value at attacks could be the difference between...",
      "timestamp": "2025-09-11T10:22:17.290384"
    },
    {
      "text": "So, value-added tax could be the difference between an airline making 1000 crores in profits.",
      "timestamp": "2025-09-11T10:22:22.284084"
    },
    {
      "text": "and an airline making 1000 crores in profits and an airline suffering with 100 crores in",
      "timestamp": "2025-09-11T10:22:26.908631"
    },
    {
      "text": "and an airline suffering with 100 crores in losses. The second trap is the Rupi Tamp.",
      "timestamp": "2025-09-11T10:22:31.824464"
    },
    {
      "text": "The second trap is the Rupi Temple. In simple words Indigo has to bite evasion.",
      "timestamp": "2025-09-11T10:22:36.346450"
    },
    {
      "text": "In simple words Indigo has to buy a vision fuel in dollars because we import a view",
      "timestamp": "2025-09-11T10:22:41.025160"
    },
    {
      "text": "fuel in dollars because we import aviation fuel. So if the cost of fuel is",
      "timestamp": "2025-09-11T10:22:45.702170"
    },
    {
      "text": "So if the cost of fuel is $100 million dollars and the ruby depreciates from...",
      "timestamp": "2025-09-11T10:22:50.567519"
    },
    {
      "text": "$800M and the rupee depreciates from 18 rupees to 85 rupees a dollar.",
      "timestamp": "2025-09-11T10:22:54.919567"
    },
    {
      "text": "18 rupees to 85 rupees a dollar. The cost of fuel for Indigo will go up.",
      "timestamp": "2025-09-11T10:22:59.907569"
    },
    {
      "text": "The cost of fuel for Indigo will go up from 800 crores to 850 crores.",
      "timestamp": "2025-09-11T10:23:04.851900"
    },
    {
      "text": "from 800 crores to 850 crores. So that's 50 crores in I",
      "timestamp": "2025-09-11T10:23:09.438562"
    },
    {
      "text": "So that's 50 crores in extra expense without a single",
      "timestamp": "2025-09-11T10:23:13.728876"
    },
    {
      "text": "extra expense without a single kilometer extra travel and lastly",
      "timestamp": "2025-09-11T10:23:18.159035"
    },
    {
      "text": "kilometer extra travel and lastly there is the price sensitivity truck",
      "timestamp": "2025-09-11T10:23:22.477343"
    },
    {
      "text": "there is the price sensitivity truck in simple words if your airfare goes up by",
      "timestamp": "2025-09-11T10:23:27.185070"
    },
    {
      "text": "In simple words, if your airfare goes up by just 1000 rupees, your revenues will",
      "timestamp": "2025-09-11T10:23:32.048238"
    },
    {
      "text": "just 1000 rupees your revenues will start tanking why because",
      "timestamp": "2025-09-11T10:23:36.524534"
    },
    {
      "text": "start at tanking why because Indian customers will switch back to buses and",
      "timestamp": "2025-09-11T10:23:41.246349"
    },
    {
      "text": "Indian customers will switch back to buses and trains. This is why as soon as",
      "timestamp": "2025-09-11T10:23:45.918331"
    },
    {
      "text": "And trains. This is why as soon as a recession hits India or an oil shock hits India.",
      "timestamp": "2025-09-11T10:23:50.906951"
    },
    {
      "text": "as a recession hits India or an oil shock hits India, airlines start bleeding losses.",
      "timestamp": "2025-09-11T10:23:55.669673"
    },
    {
      "text": "Airlines start bleeding losses and eventually they go bankrupt.",
      "timestamp": "2025-09-11T10:23:59.921037"
    },
    {
      "text": "and eventually they go bankrupt. This is what happened to King Fisher and ZM.",
      "timestamp": "2025-09-11T10:24:04.877916"
    },
    {
      "text": "This is what happened to King Fisher and Z Elvis.",
      "timestamp": "2025-09-11T10:24:09.332353"
    },
    {
      "text": "Despite being the third largest and one of the fastest",
      "timestamp": "2025-09-11T10:24:13.638168"
    },
    {
      "text": "Despite being the third largest and one of the fastest growing markets in the world, many private airlines.",
      "timestamp": "2025-09-11T10:24:20.433525"
    },
    {
      "text": "markets in the world. Many private airlines keep failing in India.",
      "timestamp": "2025-09-11T10:24:25.135741"
    },
    {
      "text": "Keep failing in India. JTW has shut down the operations after flying for 25 years. That's right.",
      "timestamp": "2025-09-11T10:24:30.569409"
    },
    {
      "text": "The correctness in King Fritcher has been a bewildering story to",
      "timestamp": "2025-09-11T10:24:35.107397"
    },
    {
      "text": "this sinking feature has been a bewildering story to report. The King of Good Times and No Motorchairs.",
      "timestamp": "2025-09-11T10:24:40.579082"
    },
    {
      "text": "to report.",
      "timestamp": "2025-09-11T10:24:44.352626"
    },
    {
      "text": "country's second largest driver's airline, the council strives for the forte running which is in the fa-",
      "timestamp": "2025-09-11T10:24:49.417056"
    },
    {
      "text": "The stripes for the 40th running in the face of a staggering dead of 7000 crore.",
      "timestamp": "2025-09-11T10:24:54.402568"
    },
    {
      "text": "of a staggering debt of 7000 crore free. So the question is, am I stole this problem?",
      "timestamp": "2025-09-11T10:24:59.461744"
    },
    {
      "text": "So the question is amidst all this trouble, how did Indigo survive?",
      "timestamp": "2025-09-11T10:25:04.035705"
    },
    {
      "text": "How did Indigo survive? Well, instead of chasing premium flyers with long-",
      "timestamp": "2025-09-11T10:25:08.883548"
    },
    {
      "text": "Well, instead of chasing premium flyers with lounges and champagne, Indigo simply",
      "timestamp": "2025-09-11T10:25:13.602308"
    },
    {
      "text": "and champion Indigo simply mastered the low cost carrier model.",
      "timestamp": "2025-09-11T10:25:18.107387"
    },
    {
      "text": "master the low cost carrier model. This model can be explained in 5cent.",
      "timestamp": "2025-09-11T10:25:22.880239"
    },
    {
      "text": "This model can be explained in 5 sentences and most of you know this already but I'm still",
      "timestamp": "2025-09-11T10:25:27.790562"
    },
    {
      "text": "And most of you know this already but I'm still putting it out there so that when we speak about the internet",
      "timestamp": "2025-09-11T10:25:32.938601"
    },
    {
      "text": "putting it out there so that when we speak about the international market you will know why Indigo is getting",
      "timestamp": "2025-09-11T10:25:37.827701"
    },
    {
      "text": "market you will know why Indigo is getting into a danger so let's have a quick look at it",
      "timestamp": "2025-09-11T10:25:42.956987"
    },
    {
      "text": "into a danger. So let's have a quick look at it. Here are the three pillars that made indigo the great",
      "timestamp": "2025-09-11T10:25:48.811791"
    },
    {
      "text": "Share the three pillars that made indigo the greatest airline in Indian aviation. Firstly...",
      "timestamp": "2025-09-11T10:25:53.740235"
    },
    {
      "text": "airline in Indian aviation. Firstly, they targeted students, families and budget travelers.",
      "timestamp": "2025-09-11T10:25:58.527268"
    },
    {
      "text": "they targeted students, families and budget travelers with no freeze flights.",
      "timestamp": "2025-09-11T10:26:03.028462"
    },
    {
      "text": "with no frills, life. So they had no fancy meals, no",
      "timestamp": "2025-09-11T10:26:07.753689"
    },
    {
      "text": "So they had no fancy meals, no screens and every kilo saved amount low.",
      "timestamp": "2025-09-11T10:26:12.355057"
    },
    {
      "text": "screens and every kilo saved mint lower cost. These small choices saved them",
      "timestamp": "2025-09-11T10:26:17.092260"
    },
    {
      "text": "cost. These small choices saved them 218 crores annually. Similarly,",
      "timestamp": "2025-09-11T10:26:21.831223"
    },
    {
      "text": "280 crores annually. Similarly, Indigo only flew one fleet type.",
      "timestamp": "2025-09-11T10:26:26.542052"
    },
    {
      "text": "Indigo only few one fleet type so pilots were trained on one aircraft mechanics",
      "timestamp": "2025-09-11T10:26:31.316301"
    },
    {
      "text": "So Alex was trained on one aircraft, mechanics stopped only one set of parts and maintenance.",
      "timestamp": "2025-09-11T10:26:36.156391"
    },
    {
      "text": "top only one set of parts and maintenance was uniform and the result?",
      "timestamp": "2025-09-11T10:26:40.521530"
    },
    {
      "text": "was a uniform and the result while JTRV spent 0.74 rupees",
      "timestamp": "2025-09-11T10:26:45.545485"
    },
    {
      "text": "While JRP spent 0.74 rupees per seat in maintenance Indigo only spent",
      "timestamp": "2025-09-11T10:26:50.074510"
    },
    {
      "text": "per seat maintenance Indigo only spent 0.1 to piece per seat",
      "timestamp": "2025-09-11T10:26:54.276513"
    },
    {
      "text": "0.1V piece per seat due to uniform fleet. Third lean.",
      "timestamp": "2025-09-11T10:26:58.795348"
    },
    {
      "text": "you do uniform fleet. Thirdly, Indigo cracked the art of selling the basics as",
      "timestamp": "2025-09-11T10:27:03.851596"
    },
    {
      "text": "Indigo cracked the art of selling the basics as luxury from food to blankets to seats",
      "timestamp": "2025-09-11T10:27:08.553208"
    },
    {
      "text": "actually from food to blankets to seed selection these small add-ons added",
      "timestamp": "2025-09-11T10:27:13.055103"
    },
    {
      "text": "These small add-ons added up to a massive 6,000",
      "timestamp": "2025-09-11T10:27:17.963721"
    },
    {
      "text": "up to a massive 6,517 in crores in 2024.",
      "timestamp": "2025-09-11T10:27:22.644312"
    },
    {
      "text": "179 crores in 2024 alone. So all of this put together",
      "timestamp": "2025-09-11T10:27:27.362221"
    },
    {
      "text": "So all of this put together look cause brought in more passengers more",
      "timestamp": "2025-09-11T10:27:31.764007"
    },
    {
      "text": "Look cause brought in more passengers More passengers meant more revenue and profits Anyway",
      "timestamp": "2025-09-11T10:27:36.333513"
    },
    {
      "text": "more passengers meant more revenue and profits. And eventually when Indigo invested their revenue and profits.",
      "timestamp": "2025-09-11T10:27:41.381511"
    },
    {
      "text": "eventually when Indigo invested their revenue and profits into scaling Indigo broke the aviation",
      "timestamp": "2025-09-11T10:27:46.287321"
    },
    {
      "text": "into scaling, integral broke the aviation course in the Indian market and became an",
      "timestamp": "2025-09-11T10:27:52.862241"
    },
    {
      "text": "in the Indian market and became an 84,000 crore company.",
      "timestamp": "2025-09-11T10:27:57.629265"
    },
    {
      "text": "This is how Indigo became a super profitable company.",
      "timestamp": "2025-09-11T10:28:02.125760"
    },
    {
      "text": "Now Indigo became a super profitable company in a market that was otherwise deemed as",
      "timestamp": "2025-09-11T10:28:06.907765"
    },
    {
      "text": "in a market that was otherwise deemed as the graveyard of airlines. So this brings",
      "timestamp": "2025-09-11T10:28:11.689174"
    },
    {
      "text": "the graveyard of airlines. So this brings us to the next question. If Indigo could crack",
      "timestamp": "2025-09-11T10:28:16.558962"
    },
    {
      "text": "the next question. If Indigo could crack the price sensitive Indian market.",
      "timestamp": "2025-09-11T10:28:22.329936"
    },
    {
      "text": "The price sensitive Indian market no market must be tough for them isn't it because",
      "timestamp": "2025-09-11T10:28:28.512397"
    },
    {
      "text": "market must be tough for them, isn't it? Because international market must be tough for them, it must be tough for them, isn't it?",
      "timestamp": "2025-09-11T10:28:37.141274"
    },
    {
      "text": "Russian passengers pay more, they value services, they travel a lot and the target address will",
      "timestamp": "2025-09-11T10:28:42.366371"
    },
    {
      "text": "They travel a lot and the target address will market actually goes beyond India",
      "timestamp": "2025-09-11T10:28:46.297691"
    },
    {
      "text": "market actually goes beyond India to Dubai Singapore Abu Dhabi and India.",
      "timestamp": "2025-09-11T10:28:50.942731"
    },
    {
      "text": "Dubai Singapore Abu Dhabi and even China and look at this matter",
      "timestamp": "2025-09-11T10:28:55.562207"
    },
    {
      "text": "and look at this matter, 60% of the entire world's population.",
      "timestamp": "2025-09-11T10:29:00.411404"
    },
    {
      "text": "55% of the entire world's population lives within 5 to 6 hours of flying time.",
      "timestamp": "2025-09-11T10:29:05.146773"
    },
    {
      "text": "lives within 5 to 6 hours of flying time from India. That means India is not...",
      "timestamp": "2025-09-11T10:29:10.076278"
    },
    {
      "text": "from India. That means India is not just a destination, it is a potential hub.",
      "timestamp": "2025-09-11T10:29:14.769692"
    },
    {
      "text": "just a destination it's a potential hub connecting flights between Dubai and Singapore.",
      "timestamp": "2025-09-11T10:29:19.778280"
    },
    {
      "text": "connecting flights between Dubai, Singapore and London. So Indigo can be...",
      "timestamp": "2025-09-11T10:29:24.855270"
    },
    {
      "text": "poor and London so indigo can become a low cost global airline isn't it?",
      "timestamp": "2025-09-11T10:29:29.718682"
    },
    {
      "text": "become a low cost global airline isn't it? So why are we calling it a gamble and",
      "timestamp": "2025-09-11T10:29:34.712089"
    },
    {
      "text": "So why are we calling it a gamble and not a masterstroke? Well, let's end this...",
      "timestamp": "2025-09-11T10:29:39.978930"
    },
    {
      "text": "not a masterstroke. Well let's understand this in simple words. If you look at it.",
      "timestamp": "2025-09-11T10:29:44.869388"
    },
    {
      "text": "and this in simple words. If you look at Indigo's International Roots, there are two types of",
      "timestamp": "2025-09-11T10:29:50.115120"
    },
    {
      "text": "Indigo's International Roots. There are two types of light roots. Short, Hall, Flights and Long",
      "timestamp": "2025-09-11T10:29:55.546293"
    },
    {
      "text": "short haul flights and long haul flights short haul flights are",
      "timestamp": "2025-09-11T10:30:00.019226"
    },
    {
      "text": "All flights short all flights are flight that last less than 3 to 6 hours and",
      "timestamp": "2025-09-11T10:30:04.866503"
    },
    {
      "text": "that last less than 3 to 6 hours and they often cover domestic or nearby international",
      "timestamp": "2025-09-11T10:30:09.386869"
    },
    {
      "text": "the often covered domestic or nearby international routes using narrow body aircraft.",
      "timestamp": "2025-09-11T10:30:13.783122"
    },
    {
      "text": "using narrow body aircraft. So a short-haul flight might go from Mumbai to Delhi.",
      "timestamp": "2025-09-11T10:30:18.516013"
    },
    {
      "text": "So a short haul flight might go from Mumbai to Delhi and the same flight could go from Delhi.",
      "timestamp": "2025-09-11T10:30:23.688124"
    },
    {
      "text": "and the same flight could go from Delhi to Dubai. This is where Indigo can...",
      "timestamp": "2025-09-11T10:30:28.776641"
    },
    {
      "text": "to Dubai. This is where indigo can easily build its presence and it already has...",
      "timestamp": "2025-09-11T10:30:33.684699"
    },
    {
      "text": "easily build this presence and it already has to a large extent. Indu currently connects",
      "timestamp": "2025-09-11T10:30:38.282361"
    },
    {
      "text": "to a large extent. Indio currently connects over 130 destinations with more than",
      "timestamp": "2025-09-11T10:30:43.044569"
    },
    {
      "text": "over 130 destinations with more than 90 domestic and 40 international city",
      "timestamp": "2025-09-11T10:30:47.578603"
    },
    {
      "text": "90 domestic and 40 international cities in its network, whereas if you look at long-haul flight",
      "timestamp": "2025-09-11T10:30:52.552359"
    },
    {
      "text": "in its network whereas if you look at long haul flights they are completely different and this is where",
      "timestamp": "2025-09-11T10:30:57.491944"
    },
    {
      "text": "they are completely different and this is where indigo has a danger to face",
      "timestamp": "2025-09-11T10:31:02.524627"
    },
    {
      "text": "Indigo has a danger to face long haul refers to longer distance",
      "timestamp": "2025-09-11T10:31:07.216499"
    },
    {
      "text": "Long haul refers to longer distance routes between 6 to 16 hours.",
      "timestamp": "2025-09-11T10:31:11.826198"
    },
    {
      "text": "routes between 6 to 16 hours. These are international intercontinental flights.",
      "timestamp": "2025-09-11T10:31:16.649617"
    },
    {
      "text": "These are international intercontinental flights that use wide body aircraft.",
      "timestamp": "2025-09-11T10:31:21.339097"
    },
    {
      "text": "that use wide body aircraft and serve premium markets right now.",
      "timestamp": "2025-09-11T10:31:25.979805"
    },
    {
      "text": "and serve premium markets. Right now Indigo has aircrafts only for short-haul flights.",
      "timestamp": "2025-09-11T10:31:31.157887"
    },
    {
      "text": "Indigo has aircraft only for short flight and they don't have a lot of flights for long haul",
      "timestamp": "2025-09-11T10:31:36.468332"
    },
    {
      "text": "and they don't have a lot of lights for long haul dudes if you look at the market, they barely have",
      "timestamp": "2025-09-11T10:31:41.783770"
    },
    {
      "text": "If you look at the market, they barely have 8% market share in the India Euro fruit.",
      "timestamp": "2025-09-11T10:31:47.094589"
    },
    {
      "text": "8% market share in the India Eurofruit and 0% in the India North America.",
      "timestamp": "2025-09-11T10:31:52.043891"
    },
    {
      "text": "0% in the Indian North America route. So when India goes from shot",
      "timestamp": "2025-09-11T10:31:56.919615"
    },
    {
      "text": "So when Indigo goes from short haul to long haul there are three big things",
      "timestamp": "2025-09-11T10:32:01.500795"
    },
    {
      "text": "to long haul there are three big dangers that we come to want to do and these are the same",
      "timestamp": "2025-09-11T10:32:06.285445"
    },
    {
      "text": "that will come to front in two and these are the same dangers that have failed all your cost",
      "timestamp": "2025-09-11T10:32:10.939492"
    },
    {
      "text": "dangerous that have failed all look-offs carriers that have tried to go long haul international",
      "timestamp": "2025-09-11T10:32:15.562407"
    },
    {
      "text": "Let us try to go long haul international before. So let us have a look at these dangers.",
      "timestamp": "2025-09-11T10:32:20.310530"
    },
    {
      "text": "So let's have a look at these dangers. The first danger is that none of the...",
      "timestamp": "2025-09-11T10:32:25.226149"
    },
    {
      "text": "The first danger is that none of the three pillars of Indigo's success will be applicable.",
      "timestamp": "2025-09-11T10:32:30.097053"
    },
    {
      "text": "The three pillars of Indigo success will be applicable to long hauled flights.",
      "timestamp": "2025-09-11T10:32:34.551263"
    },
    {
      "text": "do long haul flights. So if you look at the pillars, pillar number one was Indigos.",
      "timestamp": "2025-09-11T10:32:39.142121"
    },
    {
      "text": "look at the pillars, pillar number one was Indigos No Filth Service. So on a short",
      "timestamp": "2025-09-11T10:32:44.053987"
    },
    {
      "text": "no field service. So on a short flight to Bengaluru, the passengers will tolerate it.",
      "timestamp": "2025-09-11T10:32:48.883423"
    },
    {
      "text": "to Bengaluru, the passengers will tolerate a cramped seat, no screen and they won't mind paying",
      "timestamp": "2025-09-11T10:32:54.127545"
    },
    {
      "text": "crammed seat no screen and the one mind being for a sandwich but if you stretch that",
      "timestamp": "2025-09-11T10:32:58.898992"
    },
    {
      "text": "for a sandwich. But if you stretch that to 10 hours to London, the very same path.",
      "timestamp": "2025-09-11T10:33:03.941291"
    },
    {
      "text": "10 hours to London, the very same passenger will feel cheated. Pillar number 2",
      "timestamp": "2025-09-11T10:33:08.388193"
    },
    {
      "text": "The messenger will feel cheated. Builder number 2 was Ancillary in Heaven used where Indigo makes 1000",
      "timestamp": "2025-09-11T10:33:15.352847"
    },
    {
      "text": "was ancillary in heaven use where indigo makes thousands of crores by selling meals, blankets, and seats.",
      "timestamp": "2025-09-11T10:33:20.384054"
    },
    {
      "text": "crores by selling meals, blankets and seat selections. But on long haul passenger",
      "timestamp": "2025-09-11T10:33:25.024090"
    },
    {
      "text": "But on long haul passengers expect meals, they expect entertainment.",
      "timestamp": "2025-09-11T10:33:29.319828"
    },
    {
      "text": "expect meals, they expect entertainment and even a blanket included in the scene.",
      "timestamp": "2025-09-11T10:33:34.210599"
    },
    {
      "text": "and even a blanket included in the same ticket charge that you are charging the customer.",
      "timestamp": "2025-09-11T10:33:39.208845"
    },
    {
      "text": "and ticket charge that you are charging the customers and the third pillar is fleet standardization",
      "timestamp": "2025-09-11T10:33:44.225037"
    },
    {
      "text": "And the third pillar is fleet standardization. As we all saw, Indigo's single fleet...",
      "timestamp": "2025-09-11T10:33:49.320118"
    },
    {
      "text": "As we also, Indico's single fleet model was its crown jewel. Pilex, ma-",
      "timestamp": "2025-09-11T10:33:54.618823"
    },
    {
      "text": "model was its crown 12. Pilex, Mechanics, scheduling, everything was optimized around",
      "timestamp": "2025-09-11T10:33:59.774147"
    },
    {
      "text": "canx scheduling everything was optimized around the a320 family now if you add the",
      "timestamp": "2025-09-11T10:34:04.767869"
    },
    {
      "text": "830-20 family. Now if you add the giant A350 to this fleet",
      "timestamp": "2025-09-11T10:34:09.978932"
    },
    {
      "text": "A giant A350 to this fleet suddenly you will realize that the company",
      "timestamp": "2025-09-11T10:34:14.819773"
    },
    {
      "text": "Suddenly you will realize that the company will lead separate training pipelines in new",
      "timestamp": "2025-09-11T10:34:19.709410"
    },
    {
      "text": "will lead separate training pipelines, new maintenance crews and new spare part inventory",
      "timestamp": "2025-09-11T10:34:24.492530"
    },
    {
      "text": "and news spare part inventory so the complexity explodes.",
      "timestamp": "2025-09-11T10:34:28.985164"
    },
    {
      "text": "So the complexity explodes, costs rise and the inefficiencies that made in",
      "timestamp": "2025-09-11T10:34:33.860415"
    },
    {
      "text": "and the inefficiencies that made Indigo unbeatable at home completely",
      "timestamp": "2025-09-11T10:34:38.671345"
    },
    {
      "text": "You go unbeatable at home completely evaporate. This is the first challenge.",
      "timestamp": "2025-09-11T10:34:43.791408"
    },
    {
      "text": "evaporate. This is the first challenge where Indigo's billion dollar playbook will become irre.",
      "timestamp": "2025-09-11T10:34:48.855552"
    },
    {
      "text": "Indigo's billion dollar playbook will become irrelevant. So the question is how",
      "timestamp": "2025-09-11T10:34:54.015496"
    },
    {
      "text": "So the question is how are they tackling it? Well, to tackle this...",
      "timestamp": "2025-09-11T10:34:59.105085"
    },
    {
      "text": "Are they tackling it? Well, to tackle the challenge, Indiegoc is the huge order of it.",
      "timestamp": "2025-09-11T10:35:04.524130"
    },
    {
      "text": "Challenge Indigo just plays the huge order of aircrafts in 2024 Indigo ordered 13",
      "timestamp": "2025-09-11T10:35:09.345493"
    },
    {
      "text": "In 2024, Indigo ordered 30 Airbus A35900 jets.",
      "timestamp": "2025-09-11T10:35:14.188241"
    },
    {
      "text": "Airbus A35900Jet, with deliveries beginning in 2027.",
      "timestamp": "2025-09-11T10:35:18.995568"
    },
    {
      "text": "television beginning in 2027. For those who don't know, the 855900 is an",
      "timestamp": "2025-09-11T10:35:23.984919"
    },
    {
      "text": "Also don't know, the 8500 is an aircraft which is capable of flying 15 hours non-s.",
      "timestamp": "2025-09-11T10:35:29.166633"
    },
    {
      "text": "aircraft which is capable of flying 15 hours non-stop easily covering India to US and",
      "timestamp": "2025-09-11T10:35:35.988958"
    },
    {
      "text": "So, he is really covering India to US and India to Australia. But that's not all that. Indigo has...",
      "timestamp": "2025-09-11T10:35:41.628562"
    },
    {
      "text": "there too Australia but that's not all that. Intigo has also ordered 69 A321 XL",
      "timestamp": "2025-09-11T10:35:46.812747"
    },
    {
      "text": "also ordered 69 A321 XLRs that will let them fly into Europe.",
      "timestamp": "2025-09-11T10:35:51.807296"
    },
    {
      "text": "that will let them fly into Europe, East Africa and Northeast Asia.",
      "timestamp": "2025-09-11T10:35:56.687656"
    },
    {
      "text": "East Africa and Northeast Asia. So, instead of playing by their old playbook, there is",
      "timestamp": "2025-09-11T10:36:01.812812"
    },
    {
      "text": "So instead of playing by their old playbook, they are inventing a new playbook for a new market.",
      "timestamp": "2025-09-11T10:36:07.433473"
    },
    {
      "text": "inventing a new playbook for a new market. So while domestic will pump in cash.",
      "timestamp": "2025-09-11T10:36:12.417956"
    },
    {
      "text": "So while domestic will pump in cash, internationally a different unit altogether.",
      "timestamp": "2025-09-11T10:36:17.341269"
    },
    {
      "text": "Internationally a different unit altogether will be deployed for interview, but this is where",
      "timestamp": "2025-09-11T10:36:22.324494"
    },
    {
      "text": "will be deployed for interview. But this is where they have the second challenge which is none of the",
      "timestamp": "2025-09-11T10:36:27.391331"
    },
    {
      "text": "they have the second challenge which is none other than the might of the greatest airline in",
      "timestamp": "2025-09-11T10:36:32.369884"
    },
    {
      "text": "the might of the greatest airline in history which we all know as Emirates",
      "timestamp": "2025-09-11T10:36:37.236387"
    },
    {
      "text": "history which we all know as Emirates. Let me explain. Do you see if Indigo",
      "timestamp": "2025-09-11T10:36:42.318442"
    },
    {
      "text": "Let me explain. You see if Indigo flies Mumbai to Dubai, it's a fair game.",
      "timestamp": "2025-09-11T10:36:47.739881"
    },
    {
      "text": "eyes Mumbai to Dubai it's a fair game passengers who want to go from Mumbai to Dubai can choose",
      "timestamp": "2025-09-11T10:36:55.050422"
    },
    {
      "text": "who want to go from Mumbai to Dubai can choose Indigo or Emirates. So it's a level playing",
      "timestamp": "2025-09-11T10:37:00.569479"
    },
    {
      "text": "So it's a level playing field. But the moment Indigo tries to move...",
      "timestamp": "2025-09-11T10:37:05.476930"
    },
    {
      "text": "But the moment Indigo tries Mumbai, Dubai, London, the match team.",
      "timestamp": "2025-09-11T10:37:10.433104"
    },
    {
      "text": "Mumbai Dubai London the match changes completely why because in the",
      "timestamp": "2025-09-11T10:37:15.258285"
    },
    {
      "text": "is completely why because indigo's problem is that their claims can only carry",
      "timestamp": "2025-09-11T10:37:19.975674"
    },
    {
      "text": "the problem is that their claims can only carry passengers from Mumbai Delhi, Chennai to",
      "timestamp": "2025-09-11T10:37:24.931163"
    },
    {
      "text": "just from Mumbai Delhi Chennai to Dubai and then from Dubai to London.",
      "timestamp": "2025-09-11T10:37:29.899619"
    },
    {
      "text": "Dubai and then from Dubai to London. So that's three or four corridors of",
      "timestamp": "2025-09-11T10:37:34.719250"
    },
    {
      "text": "So that's 3 or 4 corridors of demand. But Emirates advantage from Dubai is...",
      "timestamp": "2025-09-11T10:37:39.868003"
    },
    {
      "text": "But Emirates advantage from Dubai is that it has 5-10 even 20",
      "timestamp": "2025-09-11T10:37:44.710245"
    },
    {
      "text": "that it has 5, 10 even 20 corridors feeding into the same London",
      "timestamp": "2025-09-11T10:37:49.529459"
    },
    {
      "text": "corridors feeding into the same London flight. So, passengers from Delhi.",
      "timestamp": "2025-09-11T10:37:54.127874"
    },
    {
      "text": "So, badminton is from Delhi, Karachi, Dhaka, Kolombo.",
      "timestamp": "2025-09-11T10:37:59.168973"
    },
    {
      "text": "Karachi, Dhaka, Colombo, Dango, Nairobi, and even East.",
      "timestamp": "2025-09-11T10:38:10.403465"
    },
    {
      "text": "Bangkok, Nairobi and Islamabad can be carried to Dubai.",
      "timestamp": "2025-09-11T10:38:13.415509"
    },
    {
      "text": "Some of us can be carried to Dubai and then from Dubai they can be taken to London.",
      "timestamp": "2025-09-11T10:38:16.688987"
    },
    {
      "text": "and then from Dubai they can be taken to London. So while Indigo can feel one London flight.",
      "timestamp": "2025-09-11T10:38:20.048740"
    },
    {
      "text": "So while Indigo can fill one London flight, which is Indian passengers, Emirates can fill",
      "timestamp": "2025-09-11T10:38:23.102323"
    },
    {
      "text": "Just Indian passengers, Emirates can fill the same London flight with passengers from half of Asia.",
      "timestamp": "2025-09-11T10:38:26.228326"
    },
    {
      "text": "same London flight with passengers from Hama of Asia and Africa. Now here's the scary part.",
      "timestamp": "2025-09-11T10:38:29.351062"
    },
    {
      "text": "and Africa. Now here's the scary part. If Indigo only has a Dubai to London flight.",
      "timestamp": "2025-09-11T10:38:32.401103"
    },
    {
      "text": "if Indico only has a Dubai to London flight then the only people who can use it are those",
      "timestamp": "2025-09-11T10:38:35.597103"
    },
    {
      "text": "Then the only people who can use it are those who came on Indico flights from India to Dubai",
      "timestamp": "2025-09-11T10:38:38.705587"
    },
    {
      "text": "came on Indigo flights from India to Dubai. But Emirates has a whole network from...",
      "timestamp": "2025-09-11T10:38:41.729594"
    },
    {
      "text": "But Emirates has a whole network from Dubai to London, Dubai to Paris, Dubai to..",
      "timestamp": "2025-09-11T10:38:44.837393"
    },
    {
      "text": "Dubai to London, Dubai to Paris, Dubai to New York and so on. So if Indigo...",
      "timestamp": "2025-09-11T10:38:47.950750"
    },
    {
      "text": "New York and so on. So if Indigo doesn't offer onward flights from Dubai to many",
      "timestamp": "2025-09-11T10:38:50.906938"
    },
    {
      "text": "doesn't offer onward flights from Dubai to many destinations like Paris, New York and Finley.",
      "timestamp": "2025-09-11T10:38:54.411433"
    },
    {
      "text": "destinations like Paris, New York and Sydney, there are daily passenger who would have no",
      "timestamp": "2025-09-11T10:38:57.280738"
    },
    {
      "text": "Then a Delhi passenger would have no reason to choose Indigo. So they would still go with ML...",
      "timestamp": "2025-09-11T10:39:03.256648"
    },
    {
      "text": "to choose indigo so they will still go with Emirates this means for indigo to really come",
      "timestamp": "2025-09-11T10:39:08.339744"
    },
    {
      "text": "This means for Indigo to really compete at the global level, it cannot just top",
      "timestamp": "2025-09-11T10:39:13.189133"
    },
    {
      "text": "repeat at the global level. It cannot just stop at just Mumbai landed. They would need to",
      "timestamp": "2025-09-11T10:39:18.344708"
    },
    {
      "text": "just Mumbai London they would need to add Dubai Paris Dubai New York",
      "timestamp": "2025-09-11T10:39:22.946196"
    },
    {
      "text": "Dubai Paris, Dubai New York, Dubai Singapore, Dubai Johannesburg.",
      "timestamp": "2025-09-11T10:39:27.548915"
    },
    {
      "text": "Dubai Singapore Dubai Johannesburg and Dubai to Sydney. Basically they will...",
      "timestamp": "2025-09-11T10:39:32.367013"
    },
    {
      "text": "and Dubai to Sydney. Basically they will have to run a hub. That means fine.",
      "timestamp": "2025-09-11T10:39:37.388355"
    },
    {
      "text": "to learn a hub. That means 5, 10, 20 extra flights with man.",
      "timestamp": "2025-09-11T10:39:42.441447"
    },
    {
      "text": "10-20 extra flights with massive aircraft auditors billions in cost and",
      "timestamp": "2025-09-11T10:39:47.390475"
    },
    {
      "text": "massive aircraft auditions, billions in cost and years of risks. That is why...",
      "timestamp": "2025-09-11T10:39:52.590898"
    },
    {
      "text": "use of risk. That is why this trap is brutal.",
      "timestamp": "2025-09-11T10:39:57.334606"
    },
    {
      "text": "This ramp is brutal. So America runs a hub that makes every route",
      "timestamp": "2025-09-11T10:40:02.091925"
    },
    {
      "text": "America is runs a hub that makes every route profitable and Indigo would need to build a mini",
      "timestamp": "2025-09-11T10:40:07.181576"
    },
    {
      "text": "and Indigo would need to build a mini Emirates just to complete it and that...",
      "timestamp": "2025-09-11T10:40:10.178392"
    },
    {
      "text": "Emirates just too competitive and that is very very difficult and yours were a lot of",
      "timestamp": "2025-09-11T10:40:15.135624"
    },
    {
      "text": "is very very difficult and here's where a lot of aviation geeks will ask a question and that's a very",
      "timestamp": "2025-09-11T10:40:20.627559"
    },
    {
      "text": "aviation geeks will ask a question and that's a very interesting question they would say that in",
      "timestamp": "2025-09-11T10:40:25.603227"
    },
    {
      "text": "interesting question they would say that Indigo is already buying aircrafts right so Indigo",
      "timestamp": "2025-09-11T10:40:30.534499"
    },
    {
      "text": "is already buying aircrafts right? So Indigo will turn Dubai into a hub and launch a",
      "timestamp": "2025-09-11T10:40:35.655763"
    },
    {
      "text": "turn Dubai into a hub and launch a flight from Dubai to London, Dubai to Paris and",
      "timestamp": "2025-09-11T10:40:40.680401"
    },
    {
      "text": "from Dubai to London, Dubai to Paris and Dubai to Sydney. So what is a big deal in...",
      "timestamp": "2025-09-11T10:40:45.823120"
    },
    {
      "text": "the way to sit there. So what is a big deal in that? Well this is where Indigo has another disadvantage.",
      "timestamp": "2025-09-11T10:40:51.264619"
    },
    {
      "text": "Well this is where indigo has another disadvantage and this is something that even a billion dollars cannot",
      "timestamp": "2025-09-11T10:40:56.252667"
    },
    {
      "text": "And this is something that even a billion dollars cannot fix. This is the foreign",
      "timestamp": "2025-09-11T10:41:01.266268"
    },
    {
      "text": "This is the foreign carrier trap. You see M...",
      "timestamp": "2025-09-11T10:41:06.203992"
    },
    {
      "text": "carry your truck. You see Emirates is the national airline of Dubai.",
      "timestamp": "2025-09-11T10:41:10.934667"
    },
    {
      "text": "that is the national airline of Dubai. So it's a home carrier in Dubai and",
      "timestamp": "2025-09-11T10:41:16.087137"
    },
    {
      "text": "So it's a home carrier in Dubai and Indigo is a foreign airline in Dubai.",
      "timestamp": "2025-09-11T10:41:21.137143"
    },
    {
      "text": "Indigo is the foreign airline in Dubai. Now Emirates has been operating from Dubai for...",
      "timestamp": "2025-09-11T10:41:26.375419"
    },
    {
      "text": "Now Emirates has been operating from Dubai for so long that they already have the best flight",
      "timestamp": "2025-09-11T10:41:31.465592"
    },
    {
      "text": "long that they already have the best flight slots and statutes and indigo as an outsider.",
      "timestamp": "2025-09-11T10:41:36.366356"
    },
    {
      "text": "and stood in an integral as an outsider can only fly as many flights as the",
      "timestamp": "2025-09-11T10:41:41.643787"
    },
    {
      "text": "can only fly as many flights as the bilateral air services agreement allows.",
      "timestamp": "2025-09-11T10:41:46.245536"
    },
    {
      "text": "by lateral air services agreement allows and Indian airlines are currently entitled to",
      "timestamp": "2025-09-11T10:41:51.049328"
    },
    {
      "text": "and Indian Airlines are currently entitled to operate only 66,000 seats per week.",
      "timestamp": "2025-09-11T10:41:56.002992"
    },
    {
      "text": "operate only 66,000 seats per week from 15 Indian cities to UA destinations.",
      "timestamp": "2025-09-11T10:42:00.861036"
    },
    {
      "text": "from 15 Indians it is two UA destinations but that's not all. Dubai International",
      "timestamp": "2025-09-11T10:42:06.115678"
    },
    {
      "text": "But that's not all. Dubai International is one of the busiest airports in the world.",
      "timestamp": "2025-09-11T10:42:11.447871"
    },
    {
      "text": "is one of the busiest airports in the world with 19 million passengers and you-",
      "timestamp": "2025-09-11T10:42:16.573421"
    },
    {
      "text": "with 19 million passengers and you'll be transiting from the Dubai airport.",
      "timestamp": "2025-09-11T10:42:21.493747"
    },
    {
      "text": "Transiting from the Dubai Airport. So Emirates can get line slots that fit...",
      "timestamp": "2025-09-11T10:42:26.470890"
    },
    {
      "text": "So Emirates can get blind slots that fit perfectly with the onwards lights.",
      "timestamp": "2025-09-11T10:42:31.328060"
    },
    {
      "text": "perfectly with the onward flights. For example, Emirates can schedule Mumbai to Dubai.",
      "timestamp": "2025-09-11T10:42:36.128177"
    },
    {
      "text": "For example, Emerald Skinskid will Mumbai to Dubai to arrive at 5 a.m. just in time to kill.",
      "timestamp": "2025-09-11T10:42:41.957873"
    },
    {
      "text": "to arrive at 5am just in time to connect to London, New York or Paris flight.",
      "timestamp": "2025-09-11T10:42:47.187406"
    },
    {
      "text": "to London, New York or Paris slides which leave from Dubai at 8 a.m.",
      "timestamp": "2025-09-11T10:42:52.197226"
    },
    {
      "text": "which leave from Dubai at 8am. But Indigo, I only get a landing.",
      "timestamp": "2025-09-11T10:42:57.126485"
    }
  ],
  "insights": {
    "insights": [
      "Error generating insights: Error code: 413 - {'error': {'message': 'Request too large for model `llama-3.1-8b-instant` in organization `org_01k29nvjhvegarch87w446r5wk` service tier `on_demand` on tokens per minute (TPM): Limit 6000, Requested 8073, please reduce your message size and try again. Need more tokens? Upgrade to Dev Tier today at https://console.groq.com/settings/billing', 'type': 'tokens', 'code': 'rate_limit_exceeded'}}"
    ]
  },
  "session_ended": "2025-09-11T10:42:58.958542"
}