{
  "transcript_parts": [
    {
      "text": "There It Is! Yeah?",
      "timestamp": "2025-09-08T15:21:58.962738"
    },
    {
      "text": "I am going to pre exciting product with us today because this is the first",
      "timestamp": "2025-09-08T15:22:02.350265"
    },
    {
      "text": "product with us today because this is the first made in India from an Indian man.",
      "timestamp": "2025-09-08T15:22:05.874318"
    },
    {
      "text": "made in India from an Indian manufacturer reasonably priced from",
      "timestamp": "2025-09-08T15:22:10.050439"
    },
    {
      "text": "and fractured reasonably priced, proper Maxi scooter in our market.",
      "timestamp": "2025-09-08T15:22:14.315786"
    },
    {
      "text": "maxi scooter in our market. It's a zoom 160 it's been a long time",
      "timestamp": "2025-09-08T15:22:19.970411"
    },
    {
      "text": "So, in the zoom 160, it's been a long time coming. They first showed it like, but 20, 20, 3, they long.",
      "timestamp": "2025-09-08T15:22:25.634207"
    },
    {
      "text": "coming the first short like for 2023 they launched it in January this year and it's finally",
      "timestamp": "2025-09-08T15:22:30.560317"
    },
    {
      "text": "It's a fun state in January this year and it's finally out for us to write and deliver",
      "timestamp": "2025-09-08T15:22:35.980584"
    },
    {
      "text": "out for us to ride and deliveries will begin soon as well. Now this is a school",
      "timestamp": "2025-09-08T15:22:40.824676"
    },
    {
      "text": "begin soon as well. Now this is a scooter that's been seen before you already know this.",
      "timestamp": "2025-09-08T15:22:45.664910"
    },
    {
      "text": "this has been seen before you already know the specs but we'll get to that in a bit but I think the",
      "timestamp": "2025-09-08T15:22:51.459766"
    },
    {
      "text": "But we'll get to that in a bit but I think the big deal with this scooter is how it looks.",
      "timestamp": "2025-09-08T15:22:56.377867"
    },
    {
      "text": "The big deal with this scooter is how it looks.",
      "timestamp": "2025-09-08T15:23:00.818226"
    },
    {
      "text": "Kill How You Gonna Choke I was an egg Yeah I used to play Haidol",
      "timestamp": "2025-09-08T15:23:21.931533"
    },
    {
      "text": "Hero has done a great job with the overall design, the outline of the scooter.",
      "timestamp": "2025-09-08T15:23:27.385983"
    },
    {
      "text": "the overall design, the outline of the school to the proportions that it carries because this really",
      "timestamp": "2025-09-08T15:23:32.468677"
    },
    {
      "text": "Proposions that it carries because this really does look like a premium expensive",
      "timestamp": "2025-09-08T15:23:37.120440"
    },
    {
      "text": "does look like a premium expensive Maxi scooter.",
      "timestamp": "2025-09-08T15:23:42.244009"
    },
    {
      "text": "Maxi scooter. The theme with this one particularly is more often",
      "timestamp": "2025-09-08T15:23:46.455943"
    },
    {
      "text": "team with this one particularly is more of an ADV maxi scooter and before that",
      "timestamp": "2025-09-08T15:23:51.376028"
    },
    {
      "text": "ADV maxi scooter and before that gets you very excited let me tell you that's not real",
      "timestamp": "2025-09-08T15:23:56.421576"
    },
    {
      "text": "get you by excited let me tell you that's not really the case we'll get down to it later but",
      "timestamp": "2025-09-08T15:24:01.970624"
    },
    {
      "text": "the case we will get down to it later but it hits the right spot when it comes to having",
      "timestamp": "2025-09-08T15:24:06.980549"
    },
    {
      "text": "It hits the right spot when it comes to having a big frontal area. It's all...",
      "timestamp": "2025-09-08T15:24:12.058066"
    },
    {
      "text": "Big frontal area, tall handlebar, 14 inch wheels.",
      "timestamp": "2025-09-08T15:24:16.399871"
    },
    {
      "text": "handlebar 14 inch wheels, side saw button both ends you've got the few",
      "timestamp": "2025-09-08T15:24:20.930729"
    },
    {
      "text": "side floor bottom both ends you've got the fuel tank sitting in the center that is a fail",
      "timestamp": "2025-09-08T15:24:25.903524"
    },
    {
      "text": "sitting in the center that is a fairly large seven litre fuel tank which is...",
      "timestamp": "2025-09-08T15:24:30.865171"
    },
    {
      "text": "large seven litre fuel tank which is bigger than what you get on most scooters in the country.",
      "timestamp": "2025-09-08T15:24:35.639550"
    },
    {
      "text": "bigger than what you get on most scooters in the country. You've got as you can see there's a radiator.",
      "timestamp": "2025-09-08T15:24:41.278582"
    },
    {
      "text": "You've got as you can see there's a radiator out here that means this is a liquid cool engine.",
      "timestamp": "2025-09-08T15:24:46.273596"
    },
    {
      "text": "here that means this is a liquid cool engine 1506 cc and it is",
      "timestamp": "2025-09-08T15:24:51.793383"
    },
    {
      "text": "and it is just a really very nice looking thing.",
      "timestamp": "2025-09-08T15:24:56.053530"
    },
    {
      "text": "just a really very nice looking thing. It also feels good when you sit on it.",
      "timestamp": "2025-09-08T15:25:00.705020"
    },
    {
      "text": "It also feels good when you sit on it. This is...",
      "timestamp": "2025-09-08T15:25:05.228725"
    },
    {
      "text": "This is a fairly low seat height for something that looks like this.",
      "timestamp": "2025-09-08T15:25:09.749673"
    },
    {
      "text": "A fairly low seat height for something that looks like this is below 800 mm, but it's also speed",
      "timestamp": "2025-09-08T15:25:15.284279"
    },
    {
      "text": "is below 800 mm but it's also spacious comfortable nice upright new",
      "timestamp": "2025-09-08T15:25:20.029308"
    },
    {
      "text": "comfortable nice upright neutral riding position if you are the type who likes to put that",
      "timestamp": "2025-09-08T15:25:24.586321"
    },
    {
      "text": "riding position if you are the type who likes to put their feet forward you can do that. They stick out a little bit.",
      "timestamp": "2025-09-08T15:25:29.915659"
    },
    {
      "text": "you can do that this stick out a little bit, they don't really fit fully flush in there but there is the proof",
      "timestamp": "2025-09-08T15:25:35.499795"
    },
    {
      "text": "I don't really fit fully flush in there but there is the provision to move your feet around. It's also got",
      "timestamp": "2025-09-08T15:25:40.839582"
    },
    {
      "text": "vision to move your feet around. It's also got a nice and spacious fill-in seat, the width of the",
      "timestamp": "2025-09-08T15:25:45.981246"
    },
    {
      "text": "nice and spacious fillion seat the width of the seat is really good and for the rider also",
      "timestamp": "2025-09-08T15:25:50.781248"
    },
    {
      "text": "see it is really good and for the rider also the nice scoop in there hold you in place",
      "timestamp": "2025-09-08T15:25:56.407641"
    },
    {
      "text": "nice scoop and hold you in place it feels good it's a good view from the riders",
      "timestamp": "2025-09-08T15:26:01.251112"
    },
    {
      "text": "It feels good. It's a good view from the riders point of view as well. This body color panel out.",
      "timestamp": "2025-09-08T15:26:06.410167"
    },
    {
      "text": "point to be as well. This body color panel out here does wonders for creating a sense",
      "timestamp": "2025-09-08T15:26:11.279491"
    },
    {
      "text": "here does wonders for creating a sense of something that's different. There is no scooter.",
      "timestamp": "2025-09-08T15:26:16.291598"
    },
    {
      "text": "of something that's different. There is no scooter and you need market rights now that gives you this view and",
      "timestamp": "2025-09-08T15:26:22.047049"
    },
    {
      "text": "Indian market right now that gives you this view and that is a nice thing. It also got a large windscreen.",
      "timestamp": "2025-09-08T15:26:27.481476"
    },
    {
      "text": "That is a nice thing, it also got a large windscreen which is again great for aesthetics also helps out.",
      "timestamp": "2025-09-08T15:26:32.707436"
    },
    {
      "text": "which is again great for aesthetics also helps out on the highway. Welcome to Features.",
      "timestamp": "2025-09-08T15:26:37.620746"
    },
    {
      "text": "out on the highway. When it comes to features, a bit of a mix bag on the one end things are really quite simple.",
      "timestamp": "2025-09-08T15:26:43.818040"
    },
    {
      "text": "bit of a mixed bag on the one hand things are really quite simple these indicators don't look very fancy it's a black and white.",
      "timestamp": "2025-09-08T15:26:49.261296"
    },
    {
      "text": "these indicators don't look very fancy. It's a black and white display switch here is really.",
      "timestamp": "2025-09-08T15:26:54.365792"
    },
    {
      "text": "white display switch here is really quite basic I think this is a step back from the",
      "timestamp": "2025-09-08T15:26:59.263681"
    },
    {
      "text": "quite basic I think this is a step back from the zoom 125 in terms of how nice it looks.",
      "timestamp": "2025-09-08T15:27:04.504838"
    },
    {
      "text": "125 in terms of how nice it looks and feels. But then you have elixir function.",
      "timestamp": "2025-09-08T15:27:09.550078"
    },
    {
      "text": "looks and feels but then you have E-lifes function you just got a rotary dial out here which is",
      "timestamp": "2025-09-08T15:27:14.828814"
    },
    {
      "text": "you just got a rotary dial out here which is really very convenient to use and",
      "timestamp": "2025-09-08T15:27:19.629193"
    },
    {
      "text": "really very convenient to use and remote access for",
      "timestamp": "2025-09-08T15:27:24.030096"
    },
    {
      "text": "remote access for opening the boot and hit a button.",
      "timestamp": "2025-09-08T15:27:29.156641"
    },
    {
      "text": "opening the boot, hit a button, that's the boot down there, into...",
      "timestamp": "2025-09-08T15:27:33.984588"
    },
    {
      "text": "That's the moot down there. In terms of numbers it's not a very large moot but it happens to...",
      "timestamp": "2025-09-08T15:27:39.180544"
    },
    {
      "text": "of numbers is not a very large wood but it happens to hold a full phase helmet big",
      "timestamp": "2025-09-08T15:27:43.897938"
    },
    {
      "text": "to hold a full faith helmet, a big helmet and there are very few scooters.",
      "timestamp": "2025-09-08T15:27:49.279612"
    },
    {
      "text": "helmet and there are very few scooters in India that actually do that. You need to position it",
      "timestamp": "2025-09-08T15:27:54.304077"
    },
    {
      "text": "and you need to position it carefully and if it's one of those really long helmets you",
      "timestamp": "2025-09-08T15:27:59.012797"
    },
    {
      "text": "If it's one of those really long helmets, you may not be able to get in there. This also...",
      "timestamp": "2025-09-08T15:28:04.426360"
    },
    {
      "text": "not be able to get in there. This also just makes a little contact with top of the helmet, but",
      "timestamp": "2025-09-08T15:28:09.746615"
    },
    {
      "text": "just make a little contact with top of the helmet but cut out out here is this soft foam out there.",
      "timestamp": "2025-09-08T15:28:15.023260"
    },
    {
      "text": "cut out out here, there's some soft foam out there and you can put your helmet",
      "timestamp": "2025-09-08T15:28:19.763964"
    },
    {
      "text": "and you can put your helmet in here which is again a very important thing with a maxi",
      "timestamp": "2025-09-08T15:28:24.773226"
    },
    {
      "text": "here which is again a very important thing with a maxi scooter someone is buying this for",
      "timestamp": "2025-09-08T15:28:30.251411"
    },
    {
      "text": "Someone is buying this for convenience, practicality as well as addicts.",
      "timestamp": "2025-09-08T15:28:34.911480"
    },
    {
      "text": "practicality as well as big style and comfort. The boot also has a little light.",
      "timestamp": "2025-09-08T15:28:39.711236"
    },
    {
      "text": "island comfort. The boot also has a little light in there which is always nice and then when you come",
      "timestamp": "2025-09-08T15:28:44.783151"
    },
    {
      "text": "which is always nice and then when you come further up front you have a cup",
      "timestamp": "2025-09-08T15:28:49.537218"
    },
    {
      "text": "further up front you have a copy out here with the USP.",
      "timestamp": "2025-09-08T15:28:54.778574"
    },
    {
      "text": "out show with the USB port somewhere in there.",
      "timestamp": "2025-09-08T15:28:58.463878"
    },
    {
      "text": "but somewhere in there, there it is. So that is the...",
      "timestamp": "2025-09-08T15:29:03.248452"
    },
    {
      "text": "so that is the standard USB port.",
      "timestamp": "2025-09-08T15:29:08.178785"
    },
    {
      "text": "standard USB port and if you want to open the fuse filler cap",
      "timestamp": "2025-09-08T15:29:13.504625"
    },
    {
      "text": "And if you want to open the fuel cover, you just twist this, that's your fuel cover.",
      "timestamp": "2025-09-08T15:29:18.537094"
    },
    {
      "text": "you just twist this, that's your beautiful cap down there. So it's all really...",
      "timestamp": "2025-09-08T15:29:24.115065"
    },
    {
      "text": "will fill a cap down there. So it's all really convenient and like I said, ski list. That's what",
      "timestamp": "2025-09-08T15:29:29.303281"
    },
    {
      "text": "That can mean end, like I said, keyless. That's what the key looks like. You can also remotely open.",
      "timestamp": "2025-09-08T15:29:35.102414"
    },
    {
      "text": "the key looks like. You can also remotely open the boot via the key itself which is another",
      "timestamp": "2025-09-08T15:29:41.140717"
    },
    {
      "text": "the boot via the key itself which is another really nice convenience.",
      "timestamp": "2025-09-08T15:29:45.641499"
    },
    {
      "text": "nice convenience. So bigger riders will definitely find a good amount of",
      "timestamp": "2025-09-08T15:29:50.020155"
    },
    {
      "text": "So bigger riders will definitely find a good amount of comfort on this scooter. I did not set through",
      "timestamp": "2025-09-08T15:29:55.011141"
    },
    {
      "text": "comfort on the scooter. I didn't notice that through the ride the seat is slightly sloped",
      "timestamp": "2025-09-08T15:30:02.981115"
    },
    {
      "text": "the ride the seat is slightly sloped so I was moving slightly forward and at a certain point I",
      "timestamp": "2025-09-08T15:30:08.416489"
    },
    {
      "text": "was moving slightly forward and at a certain point I touched this with my knees but it's a rounded surface isn't it?",
      "timestamp": "2025-09-08T15:30:14.548297"
    },
    {
      "text": "touch this with my knees but it's a rounded surface is nothing there that can hurt you or that you can",
      "timestamp": "2025-09-08T15:30:20.910371"
    },
    {
      "text": "nothing there that can hurt you or that you can interfere with a scooter like a T or something that's not a problem.",
      "timestamp": "2025-09-08T15:30:26.576862"
    },
    {
      "text": "if you're with a scooter like a T or something that's not a concern. The nice thing is it's not just good.",
      "timestamp": "2025-09-08T15:30:32.992231"
    },
    {
      "text": "The nice thing is it's not just good for bigger people because of the photographer.",
      "timestamp": "2025-09-08T15:30:38.641355"
    },
    {
      "text": "for bigger people because our photographer Omkarn here is 5.3.",
      "timestamp": "2025-09-08T15:30:44.129718"
    },
    {
      "text": "Omkar here is 5'3 and he says that this is actually quite...",
      "timestamp": "2025-09-08T15:30:48.875979"
    },
    {
      "text": "and he says that this is actually quite accessible as well. It's a 787.",
      "timestamp": "2025-09-08T15:30:54.047575"
    },
    {
      "text": "quite accessible as well. It's a 787mm seat height and the seat does slope down to the bottom.",
      "timestamp": "2025-09-08T15:30:59.249446"
    },
    {
      "text": "and the seat height and the seat does slope down to the bottom. So, he is almost not on his...",
      "timestamp": "2025-09-08T15:31:05.534255"
    },
    {
      "text": "So, he is almost not on his tiptoes at all, almost flat feet on both ends. So, he is pretty good.",
      "timestamp": "2025-09-08T15:31:11.142787"
    },
    {
      "text": "almost flat feet on both ends so pretty good yeah",
      "timestamp": "2025-09-08T15:31:16.287681"
    },
    {
      "text": "Yeah. All right. So I think...",
      "timestamp": "2025-09-08T15:31:20.876888"
    },
    {
      "text": "So I think it's safe to see that hero has done a little...",
      "timestamp": "2025-09-08T15:31:25.967015"
    },
    {
      "text": "It's safe to say that Hero has done a great job with how the zoom 160 looks and a pretty good...",
      "timestamp": "2025-09-08T15:31:31.122104"
    },
    {
      "text": "with how the zoom 160 looks and a pretty good job as well with how comfortable and practical it is and how",
      "timestamp": "2025-09-08T15:31:36.129587"
    },
    {
      "text": "job as well with how comfortable and practical it is and how convenient it is especially with that each I think that",
      "timestamp": "2025-09-08T15:31:41.235566"
    },
    {
      "text": "Convenient to this especially with that feature I think that really improves the overall experience.",
      "timestamp": "2025-09-08T15:31:46.227929"
    },
    {
      "text": "that really improves the overall experience. But what about the engine? Well, it's a",
      "timestamp": "2025-09-08T15:31:51.507629"
    },
    {
      "text": "But what about the engine? Well, it's an interesting story that let me first get it on the main stand.",
      "timestamp": "2025-09-08T15:31:56.974995"
    },
    {
      "text": "interesting story there let me get it on the main stand because I can't start it on the side stand which is a",
      "timestamp": "2025-09-08T15:32:03.058148"
    },
    {
      "text": "because I can't start it on the side stand. This is a 140 odd kilo scooter by scooter stand.",
      "timestamp": "2025-09-08T15:32:08.288709"
    },
    {
      "text": "140 odd kilo scooter by scooter standards as heavy it is about as much as a typical",
      "timestamp": "2025-09-08T15:32:13.152935"
    },
    {
      "text": "and that's heavy, it's about as much as a typical 151.660 CC bike and... Thanks a lot!",
      "timestamp": "2025-09-08T15:32:19.397632"
    },
    {
      "text": "151.660 CC bike and takes a bit of effort to get it on the stand not horrible but",
      "timestamp": "2025-09-08T15:32:24.541695"
    },
    {
      "text": "bit of effort to get it on the stand, not horrible but you'll notice that. Let's start with...",
      "timestamp": "2025-09-08T15:32:30.240835"
    },
    {
      "text": "you'll notice that. Let's start with how this engine sounds. It's called a silent",
      "timestamp": "2025-09-08T15:32:35.395842"
    },
    {
      "text": "how this engine sounds. It's got a silent start.",
      "timestamp": "2025-09-08T15:32:40.663080"
    },
    {
      "text": "and it is otherwise quite",
      "timestamp": "2025-09-08T15:32:44.941554"
    },
    {
      "text": "and it is otherwise quite conventional it's not crappy or",
      "timestamp": "2025-09-08T15:32:49.469495"
    },
    {
      "text": "conventional it's not crappy or sporty sounding not like an n-talk more",
      "timestamp": "2025-09-08T15:32:54.791291"
    },
    {
      "text": "body sounding not like an end talk more along the lines of Yamaha air rocks just sounds",
      "timestamp": "2025-09-08T15:32:58.792811"
    },
    {
      "text": "All along the lines of Yamaha Air OX, it just sounds like a conventional scooter.",
      "timestamp": "2025-09-08T15:33:03.900197"
    },
    {
      "text": "like a conventional scooter.",
      "timestamp": "2025-09-08T15:33:07.822325"
    },
    {
      "text": "So it is a smooth sounding and a",
      "timestamp": "2025-09-08T15:33:16.537724"
    },
    {
      "text": "So it is a smooth sounding and a smooth running engine as well the fueling",
      "timestamp": "2025-09-08T15:33:21.186022"
    }
  ],
  "insights": {
    "insights": [
      "The Zoom 160 is a made-in-India scooter from an Indian manufacturer, reasonably priced, and designed to be a premium maxi scooter.",
      "The scooter has a unique design, with a big frontal area, tall handlebar, 14-inch wheels, and a fairly large 7-liter fuel tank.",
      "The Zoom 160 features a liquid-cooled engine, a rotary dial for convenient use, and remote access for opening the boot.",
      "The scooter has a spacious and comfortable riding position, with a low seat height of below 800 mm, and a provision to move feet around.",
      "The Zoom 160 has a keyless feature, allowing riders to remotely open the boot, and a USB port for convenience.",
      "The scooter is accessible to riders of various heights, with a seat height of 787 mm and a sloping seat that allows for comfortable riding."
    ]
  },
  "session_ended": "2025-09-08T15:33:37.133215"
}