{
  "transcript_parts": [
    {
      "text": "NOOOO",
      "timestamp": "2025-09-11T10:44:52.849140"
    },
    {
      "text": "The hearing Munich at the World Premier",
      "timestamp": "2025-09-11T10:44:56.686863"
    },
    {
      "text": "The hearing Munich at the world premiere of the BMW iX",
      "timestamp": "2025-09-11T10:45:00.961783"
    },
    {
      "text": "of the BMW iX3. Now more than this being an iX3.",
      "timestamp": "2025-09-11T10:45:05.425510"
    },
    {
      "text": "Now more than this being an IACC, this is the first product of the noise...",
      "timestamp": "2025-09-11T10:45:10.124583"
    },
    {
      "text": "This is the first product of the Noia class platform. The Noia class platform.",
      "timestamp": "2025-09-11T10:45:14.898646"
    },
    {
      "text": "a class platform, the new new class platform, because this is a complex...",
      "timestamp": "2025-09-11T10:45:19.377717"
    },
    {
      "text": "because this is a completely new electrical",
      "timestamp": "2025-09-11T10:45:25.274722"
    },
    {
      "text": "Please be new electrical architecture represents the future of the year.",
      "timestamp": "2025-09-11T10:45:29.579678"
    },
    {
      "text": "represents the future of BMW. It is an 800 volt",
      "timestamp": "2025-09-11T10:45:33.897173"
    },
    {
      "text": "W, it's an 800 volt system, they've got from 400 to 800 volts.",
      "timestamp": "2025-09-11T10:45:38.540885"
    },
    {
      "text": "They've gone from 400 to 800 volts. This one has 800 kilometers of",
      "timestamp": "2025-09-11T10:45:43.074580"
    },
    {
      "text": "This one has 800 kilometers of range, the latest impact detection.",
      "timestamp": "2025-09-11T10:45:47.398022"
    },
    {
      "text": "range, the latest impact detects, Linder NMC cells, but there's a lot of...",
      "timestamp": "2025-09-11T10:45:52.185813"
    },
    {
      "text": "NMC cells but there's a lot more to this car so let's have a quick look at",
      "timestamp": "2025-09-11T10:45:56.961640"
    },
    {
      "text": "more to this car so let's have a quick look at what there is under the scale. The noise",
      "timestamp": "2025-09-11T10:46:01.428942"
    },
    {
      "text": "and what there is under the skin. The new class is of pure electric.",
      "timestamp": "2025-09-11T10:46:05.985693"
    },
    {
      "text": "class is of pure electric architecture and on this side.",
      "timestamp": "2025-09-11T10:46:10.071243"
    },
    {
      "text": "architecture and on this like six models of planning the first to be",
      "timestamp": "2025-09-11T10:46:14.336529"
    },
    {
      "text": "models of land. The first thing I expect is to hold my V-I.",
      "timestamp": "2025-09-11T10:46:19.039942"
    },
    {
      "text": "Ix3, followed by the i3 coming next year as well.",
      "timestamp": "2025-09-11T10:46:23.638762"
    },
    {
      "text": "the coming next year as well. What's special for...",
      "timestamp": "2025-09-11T10:46:28.168098"
    },
    {
      "text": "What special code India is that after we succeed?",
      "timestamp": "2025-09-11T10:46:32.144294"
    },
    {
      "text": "India is that after we success along with this version like the iX1",
      "timestamp": "2025-09-11T10:46:36.702386"
    },
    {
      "text": "So long wheeled disversions like the iX1 and iX series in their 2 is right wheeled.",
      "timestamp": "2025-09-11T10:46:41.615781"
    },
    {
      "text": "and 5 series in their 2 is likely to get along will based 5 x 3.",
      "timestamp": "2025-09-11T10:46:46.174546"
    },
    {
      "text": "to get a long wheel based on ix3. The battery.",
      "timestamp": "2025-09-11T10:46:50.654029"
    },
    {
      "text": "The back-keep back is 107.8 kilowatt.",
      "timestamp": "2025-09-11T10:46:55.100321"
    },
    {
      "text": "Okay, back is 107.8 kilowatt hours, they're all cylindrical cells.",
      "timestamp": "2025-09-11T10:46:59.872073"
    },
    {
      "text": "There are also cylindrical cells and BMW cells, this is the most...",
      "timestamp": "2025-09-11T10:47:04.333696"
    },
    {
      "text": "BMW says this is the most efficient electric car we've made today.",
      "timestamp": "2025-09-11T10:47:08.849158"
    },
    {
      "text": "A sufficient electric car we've made today. It's a four wheel drive.",
      "timestamp": "2025-09-11T10:47:13.476271"
    },
    {
      "text": "It's a four wheel drive with rear wheel drive by a",
      "timestamp": "2025-09-11T10:47:17.918407"
    },
    {
      "text": "with real-wheel drive bias and overall power is poor.",
      "timestamp": "2025-09-11T10:47:22.385453"
    },
    {
      "text": "and the overall power is 269 horsepower.",
      "timestamp": "2025-09-11T10:47:26.369555"
    },
    {
      "text": "169 horsepower. What's interesting is that all the Alexi comes with...",
      "timestamp": "2025-09-11T10:47:30.921886"
    },
    {
      "text": "The most interesting is that the Alexi comes with cutting and check the design.",
      "timestamp": "2025-09-11T10:47:35.348762"
    },
    {
      "text": "and check the design. Well, it's not as radical as previous",
      "timestamp": "2025-09-11T10:47:39.762256"
    },
    {
      "text": "Well, it's not as radical as previous BMWs. Take a look at the grille no longer.",
      "timestamp": "2025-09-11T10:47:44.603728"
    },
    {
      "text": "BMW's. Take a look at the grill. No longer do they have that massive grill. They have a",
      "timestamp": "2025-09-11T10:47:49.456025"
    },
    {
      "text": "do they have that massive grill? They have a grill that is much more proportionate.",
      "timestamp": "2025-09-11T10:47:54.050139"
    },
    {
      "text": "that is much more proportionate. It's like BMW's coming back a full",
      "timestamp": "2025-09-11T10:47:58.589985"
    },
    {
      "text": "It's like BMW is coming back a full circle, even the overall design of the car.",
      "timestamp": "2025-09-11T10:48:03.342774"
    },
    {
      "text": "even the overall design of the car, the look of the car is very proportionate.",
      "timestamp": "2025-09-11T10:48:08.015862"
    },
    {
      "text": "the car, the look of the car is very proportionate, not as radical. BMW doesn't want to",
      "timestamp": "2025-09-11T10:48:12.985172"
    },
    {
      "text": "as radical BMW doesn't want to make the same mistake must say these deadwitch was going to",
      "timestamp": "2025-09-11T10:48:17.528820"
    },
    {
      "text": "make the same mistake, must say these did which was going to radical with the EVs and they wanted to give",
      "timestamp": "2025-09-11T10:48:22.513009"
    },
    {
      "text": "radical with the EVs and they wanted to give it a look of an ice car and BMW have said",
      "timestamp": "2025-09-11T10:48:27.353836"
    },
    {
      "text": "the look of an ice car and BMW have said that even the ice versions will look similar.",
      "timestamp": "2025-09-11T10:48:31.946000"
    },
    {
      "text": "that even the ice versions will look similar to the might have completely different architectures.",
      "timestamp": "2025-09-11T10:48:36.524627"
    },
    {
      "text": "The might have completely different architectures. The space under the long one it hasn't been used.",
      "timestamp": "2025-09-11T10:48:41.234657"
    },
    {
      "text": "The space under the long one it hasn't been wasted and you get a small trunk but it can only...",
      "timestamp": "2025-09-11T10:48:46.258618"
    },
    {
      "text": "and you get a small trunk but it can only take loads up to 10 kilos.",
      "timestamp": "2025-09-11T10:48:50.843433"
    },
    {
      "text": "take loads up to 10 kilos. I think what's special about noise class is gonna spawn a range",
      "timestamp": "2025-09-11T10:48:55.339148"
    },
    {
      "text": "I think what's special about Noik class is gonna spawn a range of new all electric products based on this",
      "timestamp": "2025-09-11T10:48:59.981213"
    },
    {
      "text": "of new all electric products based on this platform even got a teaser of the i3.",
      "timestamp": "2025-09-11T10:49:04.862731"
    },
    {
      "text": "platform even got a teaser of the i3 which is the electric version of the 3 series.",
      "timestamp": "2025-09-11T10:49:09.339056"
    },
    {
      "text": "to the electric version of the 3 CDs.",
      "timestamp": "2025-09-11T10:49:13.490292"
    },
    {
      "text": "So as I said the design exterior known as Radical",
      "timestamp": "2025-09-11T10:49:17.390807"
    },
    {
      "text": "said the design exterior known as radical as a tech behind it but let's quickly",
      "timestamp": "2025-09-11T10:49:21.674029"
    },
    {
      "text": "as a take behind it but let's quickly have a look at the rear.",
      "timestamp": "2025-09-11T10:49:26.120683"
    },
    {
      "text": "Look at the rear. Again, very much BMW.",
      "timestamp": "2025-09-11T10:49:30.635345"
    },
    {
      "text": "Again, very much BMW, we've got this new light treatment.",
      "timestamp": "2025-09-11T10:49:34.839426"
    },
    {
      "text": "So we've got this new light streetman to with these strips over here, these kind of gaggle",
      "timestamp": "2025-09-11T10:49:39.744869"
    },
    {
      "text": "with these strips over here, these kind of gagger-like light elements. Again a very clean design.",
      "timestamp": "2025-09-11T10:49:44.742863"
    },
    {
      "text": "like light elements again a very clean design not cluttered and",
      "timestamp": "2025-09-11T10:49:48.957712"
    },
    {
      "text": "time not selected and I think BMW have said they just want to go",
      "timestamp": "2025-09-11T10:49:53.285262"
    },
    {
      "text": "and I think BMW have said they just want to go to design for design sake and be all over the place.",
      "timestamp": "2025-09-11T10:49:58.283772"
    },
    {
      "text": "design for design sake and be all over the place. So really I think what's setting this car apart?",
      "timestamp": "2025-09-11T10:50:03.283396"
    },
    {
      "text": "So really I think what setting the scar apart which is the car for the future is.",
      "timestamp": "2025-09-11T10:50:08.095349"
    },
    {
      "text": "which is a cup of the future is a certain solidity and simplicity of design.",
      "timestamp": "2025-09-11T10:50:12.478788"
    },
    {
      "text": "certain solidarity and simplicity of design.",
      "timestamp": "2025-09-11T10:50:16.407210"
    },
    {
      "text": "Now the interior they definitely are",
      "timestamp": "2025-09-11T10:50:20.542325"
    },
    {
      "text": "Now the interiors they definitely are revolutionary and one thing that stands out of them",
      "timestamp": "2025-09-11T10:50:25.124333"
    },
    {
      "text": "and one thing that stands out and that's going to be the talking point is this.",
      "timestamp": "2025-09-11T10:50:29.643794"
    },
    {
      "text": "And that's going to be the talking point. Is this a panoramic vision to display?",
      "timestamp": "2025-09-11T10:50:34.358116"
    },
    {
      "text": "and really this is quite unique",
      "timestamp": "2025-09-11T10:50:38.382514"
    },
    {
      "text": "And really this is quite unique because it's not so much a heads up display but",
      "timestamp": "2025-09-11T10:50:42.804767"
    },
    {
      "text": "because it's not so much a heads up display but what looks like a whole screen is actually",
      "timestamp": "2025-09-11T10:50:47.509803"
    },
    {
      "text": "what looks like a whole screen is actually projected onto the windscreen it sits at...",
      "timestamp": "2025-09-11T10:50:52.279008"
    },
    {
      "text": "projected onto the windscreen it sits at the base of the windscreen and when your",
      "timestamp": "2025-09-11T10:50:56.863437"
    },
    {
      "text": "the base of the windscreen and when you are driving it falls superbly to your",
      "timestamp": "2025-09-11T10:51:01.766284"
    },
    {
      "text": "it falls superbly to your eye level so really get all the information you need.",
      "timestamp": "2025-09-11T10:51:06.446819"
    },
    {
      "text": "high levels so really get all the information you need and in terms of driver destruction",
      "timestamp": "2025-09-11T10:51:10.856701"
    },
    {
      "text": "need and in terms of driver destruction very very little now that has been",
      "timestamp": "2025-09-11T10:51:15.544459"
    },
    {
      "text": "very very little now that has meant that BMW has managed which",
      "timestamp": "2025-09-11T10:51:19.766129"
    },
    {
      "text": "meant that BMW has managed with just one screen. So really going the opposite",
      "timestamp": "2025-09-11T10:51:24.388315"
    },
    {
      "text": "just one screen. So really going the opposite direction when three screens are the battery time ok?",
      "timestamp": "2025-09-11T10:51:39.301520"
    },
    {
      "text": "direction when three schemes are the rage BMW has gone back to just one",
      "timestamp": "2025-09-11T10:51:43.382221"
    },
    {
      "text": "W has gone back to just one central screen because all the other stuff",
      "timestamp": "2025-09-11T10:51:47.879544"
    },
    {
      "text": "to the screen because all the other stuff, all the information is on that.",
      "timestamp": "2025-09-11T10:51:52.418461"
    },
    {
      "text": "all the other information is on that panoramic display. Of course,",
      "timestamp": "2025-09-11T10:51:57.091781"
    },
    {
      "text": "of the panoramic display. Of course, BMW has removed a lot of buttons.",
      "timestamp": "2025-09-11T10:52:01.967870"
    },
    {
      "text": "BMW has removed a lot of buttons but the certain hard buttons are...",
      "timestamp": "2025-09-11T10:52:06.414530"
    },
    {
      "text": "but the certain hard buttons or let's say fixed buttons are still there on",
      "timestamp": "2025-09-11T10:52:10.992751"
    },
    {
      "text": "Let's see if fixed buttons are still there on the screen. You've got the icon, you've got a...",
      "timestamp": "2025-09-11T10:52:16.139178"
    },
    {
      "text": "screen you've got the icon you've got the home button here and this doesn't change.",
      "timestamp": "2025-09-11T10:52:21.007345"
    },
    {
      "text": "the home button here and this doesn't change so in that sense it is quite",
      "timestamp": "2025-09-11T10:52:25.568343"
    },
    {
      "text": "So in that sense, it is quite convenient and of course you have got some",
      "timestamp": "2025-09-11T10:52:30.015043"
    },
    {
      "text": "convenient and of course you have got some hard buttons here as well including for the volume.",
      "timestamp": "2025-09-11T10:52:34.848433"
    },
    {
      "text": "Hard buttons here as well including for the volume. The steering wheel again very different now this",
      "timestamp": "2025-09-11T10:52:39.604214"
    },
    {
      "text": "The steering wheel again very different now this one has two spokes horizontally.",
      "timestamp": "2025-09-11T10:52:44.201111"
    },
    {
      "text": "one has two spokes horizontally but to make the point.",
      "timestamp": "2025-09-11T10:52:48.603209"
    },
    {
      "text": "but to make the point that there is no front instrument plus",
      "timestamp": "2025-09-11T10:52:53.183940"
    },
    {
      "text": "that there is no front instrument cluster BMW also have a steering design.",
      "timestamp": "2025-09-11T10:52:57.751759"
    },
    {
      "text": "BMW also have a steering design where you have the spoke",
      "timestamp": "2025-09-11T10:53:01.980443"
    },
    {
      "text": "where you have the spoke right in the center which typically otherwise blocked is",
      "timestamp": "2025-09-11T10:53:06.580267"
    },
    {
      "text": "right in the center which would typically otherwise block the instrument panel but since there is no instrument panel.",
      "timestamp": "2025-09-11T10:53:11.719259"
    },
    {
      "text": "panel but since there is no instrument panel they are using that design to that",
      "timestamp": "2025-09-11T10:53:16.168401"
    },
    {
      "text": "they are using that design to that effect. And the good news is that the panoramic",
      "timestamp": "2025-09-11T10:53:21.043239"
    },
    {
      "text": "And the good news is that the panellamic vision display isn't just...",
      "timestamp": "2025-09-11T10:53:25.648982"
    },
    {
      "text": "the vision display isn't just limited to all the future elections.",
      "timestamp": "2025-09-11T10:53:30.110810"
    },
    {
      "text": "limited to all the future electric BMWs. It's going to be rolled out.",
      "timestamp": "2025-09-11T10:53:34.929386"
    },
    {
      "text": "BMWs. It's going to be rolled out across the range including faceless.",
      "timestamp": "2025-09-11T10:53:39.749005"
    },
    {
      "text": "across the range, including faceless. In fact BMW has confirmed.",
      "timestamp": "2025-09-11T10:53:44.402310"
    },
    {
      "text": "In fact BMW has confirmed that 14 new BMW is included.",
      "timestamp": "2025-09-11T10:53:48.838595"
    },
    {
      "text": "that 14 new BMWs including facelifts will get this fantastic.",
      "timestamp": "2025-09-11T10:53:53.348390"
    },
    {
      "text": "facelift will get this fantastic looking display. Of course!",
      "timestamp": "2025-09-11T10:53:57.877370"
    },
    {
      "text": "of course the displays are all customisable.",
      "timestamp": "2025-09-11T10:54:02.177057"
    },
    {
      "text": "the displays are all customizable you can have lots and lots of option and there's some",
      "timestamp": "2025-09-11T10:54:06.927575"
    },
    {
      "text": "you can have lots and lots of options and there are some other cool touches over here.",
      "timestamp": "2025-09-11T10:54:11.573118"
    },
    {
      "text": "other real cool touches over here. You've got this very unique kind of fabric which",
      "timestamp": "2025-09-11T10:54:16.400962"
    },
    {
      "text": "this very unique kind of fabric which it looks of a certain texture and a",
      "timestamp": "2025-09-11T10:54:20.947378"
    },
    {
      "text": "it looks of a certain texture and of course recyclability is a big thing.",
      "timestamp": "2025-09-11T10:54:25.651701"
    },
    {
      "text": "Of course, recyclability is a big thing with BMW and all the new models.",
      "timestamp": "2025-09-11T10:54:30.540837"
    },
    {
      "text": "with BMW and all the new models. So it's all about having materials that are sustainable.",
      "timestamp": "2025-09-11T10:54:35.236052"
    },
    {
      "text": "It's all about having materials that are sustainable as well. Now let's quickly jump.",
      "timestamp": "2025-09-11T10:54:40.170988"
    },
    {
      "text": "Now let's quickly jump into the back seat because that's an important",
      "timestamp": "2025-09-11T10:54:44.521180"
    },
    {
      "text": "into the back seat because that's an important area for a lot of Indian customers.",
      "timestamp": "2025-09-11T10:54:49.359427"
    },
    {
      "text": "area for a lot of Indian customers.",
      "timestamp": "2025-09-11T10:54:53.465159"
    },
    {
      "text": "Now the typical thing in any",
      "timestamp": "2025-09-11T10:55:01.408008"
    },
    {
      "text": "Now the typical thing in any EV is the floor comes out.",
      "timestamp": "2025-09-11T10:55:05.757683"
    },
    {
      "text": "the evils, the floor comes up, but honestly the nether position isn't that",
      "timestamp": "2025-09-11T10:55:10.650753"
    },
    {
      "text": "but honestly the knees up position isn't that bad over here it is quite comfortable the",
      "timestamp": "2025-09-11T10:55:15.384463"
    },
    {
      "text": "bed over here it is quite comfortable the floor is not too high so that's great.",
      "timestamp": "2025-09-11T10:55:20.256622"
    },
    {
      "text": "Lord is not too high so that's great lots of legroom even in the stand.",
      "timestamp": "2025-09-11T10:55:24.679411"
    },
    {
      "text": "Lots of legroom even in the standard wheelbase version we have",
      "timestamp": "2025-09-11T10:55:29.118441"
    },
    {
      "text": "that wheelbase version we have been told that as I said we might get a",
      "timestamp": "2025-09-11T10:55:33.845338"
    },
    {
      "text": "told that as I said we might get a long wheel base version we don't know for sure.",
      "timestamp": "2025-09-11T10:55:38.796041"
    },
    {
      "text": "long wheelbase version we don't know for sure this car is coming only in 2027",
      "timestamp": "2025-09-11T10:55:43.594318"
    },
    {
      "text": "car is coming only in 2027 so still a long way on but really",
      "timestamp": "2025-09-11T10:55:48.282688"
    },
    {
      "text": "so still a long way on. But really, I must say, quite an area cabin you've got.",
      "timestamp": "2025-09-11T10:55:53.680146"
    },
    {
      "text": "I must say, quite an airy cabin, you've got this fixed glass roof over there.",
      "timestamp": "2025-09-11T10:55:58.331918"
    },
    {
      "text": "this fixed glass roof over here and a pretty low window line so overall",
      "timestamp": "2025-09-11T10:56:02.874146"
    },
    {
      "text": "here and a pretty low window line so overall I have to say this is quite comfortable at the back",
      "timestamp": "2025-09-11T10:56:08.059986"
    },
    {
      "text": "I have to say this is quite comfortable at the back. The real aircon.",
      "timestamp": "2025-09-11T10:56:12.823110"
    },
    {
      "text": "The real aircon vents are manually adjustable. I'm saying...",
      "timestamp": "2025-09-11T10:56:17.621925"
    },
    {
      "text": "are manually adjustable. I'm saying this because of the front.",
      "timestamp": "2025-09-11T10:56:22.150762"
    },
    {
      "text": "this because up front the vents can only be adjusted by a",
      "timestamp": "2025-09-11T10:56:26.629215"
    },
    {
      "text": "the vents can only be adjusted via the touch screen. And it's...",
      "timestamp": "2025-09-11T10:56:31.126623"
    },
    {
      "text": "the touchscreen. And it's coming to India but only in early 2020.",
      "timestamp": "2025-09-11T10:56:35.805855"
    },
    {
      "text": "coming to India but only in early 2027.",
      "timestamp": "2025-09-11T10:56:39.915620"
    },
    {
      "text": "27",
      "timestamp": "2025-09-11T10:56:53.946394"
    }
  ],
  "insights": {
    "insights": [
      "The BMW iX3 is the first product of the Noia class platform, a completely new electrical architecture that represents the future of BMW.",
      "The iX3 features an 800-volt system, 800 kilometers of range, and Linder NMC cells, making it one of the most efficient electric cars BMW has made.",
      "The car has a four-wheel drive system with rear-wheel drive bias and produces 269 horsepower.",
      "The iX3's design is more proportionate and less radical than previous BMWs, with a focus on simplicity and solidity.",
      "The car features a panoramic vision display that projects information onto the windscreen, reducing the need for multiple screens and buttons.",
      "The iX3 will be followed by other models based on the Noia class platform, including the i3, which is an electric version of the 3 series.",
      "BMW plans to roll out the panoramic vision display across its range, including faceless models, and has confirmed that 14 new BMWs will feature this display."
    ]
  },
  "session_ended": "2025-09-11T10:57:23.856032"
}