{
  "transcript_parts": [
    {
      "text": "How many of you?",
      "timestamp": "2025-08-11T23:15:52.525124"
    },
    {
      "text": "How many of you can honestly look yourself?",
      "timestamp": "2025-08-11T23:15:55.976558"
    },
    {
      "text": "can honestly look yourself in the mirror and say I am",
      "timestamp": "2025-08-11T23:15:58.905674"
    },
    {
      "text": "in the mirror and say I am doing my best. Because if you can't-",
      "timestamp": "2025-08-11T23:16:02.329447"
    },
    {
      "text": "doing my best. Because if you can, you're fucking lying to yourself.",
      "timestamp": "2025-08-11T23:16:05.626937"
    },
    {
      "text": "and you're fucking lying to yourself. Your job right now.",
      "timestamp": "2025-08-11T23:16:10.550102"
    },
    {
      "text": "Your job right now and how you execute that job",
      "timestamp": "2025-08-11T23:16:14.621903"
    },
    {
      "text": "And how you execute that job is going to create this",
      "timestamp": "2025-08-11T23:16:18.928079"
    },
    {
      "text": "It's going to create the success habits that you're going to...",
      "timestamp": "2025-08-11T23:16:24.183612"
    },
    {
      "text": "success habits that you're going to need down the road. How you",
      "timestamp": "2025-08-11T23:16:28.695835"
    },
    {
      "text": "You need to go down the road. How you do one thing is how you do everything.",
      "timestamp": "2025-08-11T23:16:33.519967"
    },
    {
      "text": "One thing is how you do everything. Just make it fast, if you ain't making the best mother's...",
      "timestamp": "2025-08-11T23:16:39.542977"
    },
    {
      "text": "If this makes it frat, if you ain't making the best mother fucking frat, every fucking time, guess what?",
      "timestamp": "2025-08-11T23:16:44.927230"
    },
    {
      "text": "I can fly every fucking time, guess what? You ain't gonna fucking make it. If you can't sweep the warehouse-",
      "timestamp": "2025-08-11T23:16:50.846552"
    },
    {
      "text": "You ain't gonna fucking make it. If you can't sweep the warehouse floor better than the next guy, you ain't gonna fucking...",
      "timestamp": "2025-08-11T23:16:56.692511"
    },
    {
      "text": "for better than next guy you ain't gonna forget making because here's the truth losers",
      "timestamp": "2025-08-11T23:17:02.400771"
    },
    {
      "text": "Because here's the truth. Losers always talk about how they hate to lose.",
      "timestamp": "2025-08-11T23:17:08.217541"
    },
    {
      "text": "Always talk about how they hate to lose, but they don't do anything about it, but you know",
      "timestamp": "2025-08-11T23:17:14.577304"
    },
    {
      "text": "But they don't do anything about it. But you know what winners do? Winners will do whatever they should do.",
      "timestamp": "2025-08-11T23:17:20.902040"
    },
    {
      "text": "Winners do, winners will do whatever they can take. Winners will show up.",
      "timestamp": "2025-08-11T23:17:26.356137"
    },
    {
      "text": "and takes winners will show up in stalein every single day.",
      "timestamp": "2025-08-11T23:17:31.803155"
    },
    {
      "text": "and stay late every single day until they're winning. Winners will come!",
      "timestamp": "2025-08-11T23:17:37.855912"
    },
    {
      "text": "until they're winning. Winners will talk to anybody they can that can help them.",
      "timestamp": "2025-08-11T23:17:43.962323"
    },
    {
      "text": "that anybody that can, that can help them, and take the lessons to heart, and put them in place.",
      "timestamp": "2025-08-11T23:17:50.125944"
    },
    {
      "text": "I hate the lessons to heart, and put them in play. That's what winners do. Losers, hop!",
      "timestamp": "2025-08-11T23:17:56.502714"
    },
    {
      "text": "That's what winners did. Losers talk about painting moves. Losers say they hate to-",
      "timestamp": "2025-08-11T23:18:01.772579"
    },
    {
      "text": "about hating loose loser said he hate loose loser's to talk about how they want to",
      "timestamp": "2025-08-11T23:18:10.226817"
    },
    {
      "text": "Losers do talk about how they want to win winners do what the fuck it takes",
      "timestamp": "2025-08-11T23:18:15.743749"
    },
    {
      "text": "and where do you think it takes? I think you mean the Nesca. If you are called...",
      "timestamp": "2025-08-11T23:18:21.025359"
    },
    {
      "text": "You are going to work at your job every day and look at all",
      "timestamp": "2025-08-11T23:18:25.547350"
    },
    {
      "text": "work at your job every day and look at all the other mothers and dick and do it I'm gonna beat you.",
      "timestamp": "2025-08-11T23:18:30.917376"
    },
    {
      "text": "All of you other mothers and brothers and they can do it. I'm gonna beat all of you. You don't have what it takes.",
      "timestamp": "2025-08-11T23:18:36.730374"
    },
    {
      "text": "How would you? You'll have what it takes Winners want to be the best",
      "timestamp": "2025-08-11T23:18:41.715526"
    },
    {
      "text": "Where's going to be the best? Where's half the pride in being the best? Where's...",
      "timestamp": "2025-08-11T23:18:47.129456"
    },
    {
      "text": "We're just half pride in being the best. We're just half pride in being the dominant.",
      "timestamp": "2025-08-11T23:18:52.884049"
    },
    {
      "text": "Step right and be dominant amongst their teammates.",
      "timestamp": "2025-08-11T23:18:57.410474"
    },
    {
      "text": "Amongst their teammates",
      "timestamp": "2025-08-11T23:19:02.222336"
    },
    {
      "text": "All men are creating forces, some just work harder.",
      "timestamp": "2025-08-11T23:19:06.733085"
    },
    {
      "text": "So just worth honor, you wanna know what it takes to succeed.",
      "timestamp": "2025-08-11T23:19:13.050605"
    },
    {
      "text": "You want to know what it takes to 16 as bad as you want to free",
      "timestamp": "2025-08-11T23:19:18.599950"
    },
    {
      "text": "As bad as you wanna freeze, when it's what goes on When the cameras go on, it's on work",
      "timestamp": "2025-08-11T23:19:24.583773"
    },
    {
      "text": "When the cameras go off, onward, from termination, and grid, you...",
      "timestamp": "2025-08-11T23:19:29.856779"
    },
    {
      "text": "termination",
      "timestamp": "2025-08-11T23:19:34.184586"
    },
    {
      "text": "I will not outwork me! I will get up earlier than you! I will go to sleep later!",
      "timestamp": "2025-08-11T23:19:40.448177"
    }
  ],
  "insights": {
    "insights": [
      "To succeed, you must be willing to do whatever it takes and put in the effort to achieve your goals.",
      "Your job and how you execute it will create the success habits you need to achieve long-term success.",
      "How you do one thing is how you do everything, so focus on making the best of every situation.",
      "Losers talk about wanting to win but don't take action, while winners take consistent action and make sacrifices to achieve their goals.",
      "To be the best, you must be willing to put in the time and effort to outwork others and stay ahead of the competition.",
      "The key to success is not just about being the best, but also about being dominant and taking pride in your work.",
      "The difference between winners and losers is not talent or ability, but rather the willingness to work hard and make sacrifices to achieve success."
    ]
  },
  "session_ended": "2025-08-11T23:19:42.376081"
}