{
  "transcript_parts": [
    {
      "text": "How many of you can honestly",
      "timestamp": "2025-08-11T22:14:19.973457"
    },
    {
      "text": "how many of you can honestly look yourself in the mirror and say",
      "timestamp": "2025-08-11T22:14:25.517744"
    },
    {
      "text": "Look yourself in the mirror and say, I am doing my best.",
      "timestamp": "2025-08-11T22:14:31.062407"
    },
    {
      "text": "I am doing my best because if you can",
      "timestamp": "2025-08-11T22:14:33.933402"
    },
    {
      "text": "Because if you can, you're fucking lying to yourself. You're just...",
      "timestamp": "2025-08-11T22:14:36.955380"
    },
    {
      "text": "line to yourself. Your job right now and how you...",
      "timestamp": "2025-08-11T22:14:39.872171"
    },
    {
      "text": "right now and how you execute that job is going",
      "timestamp": "2025-08-11T22:14:42.744970"
    },
    {
      "text": "Secure that job is going to create the success habits",
      "timestamp": "2025-08-11T22:14:45.689593"
    },
    {
      "text": "to create the success habits that you're going to need down the road.",
      "timestamp": "2025-08-11T22:14:49.172146"
    },
    {
      "text": "that you're going to need down the road. How you do one thing is how you...",
      "timestamp": "2025-08-11T22:14:54.312236"
    },
    {
      "text": "How you do one thing is how you do everything just making friends",
      "timestamp": "2025-08-11T22:14:58.752914"
    },
    {
      "text": "you do everything. Just making fries, if you ain't making the best mother fucking fries, every fucking time.",
      "timestamp": "2025-08-11T22:15:03.941623"
    },
    {
      "text": "Did you ain't making the best mother to conflives every fucking time? Guess what? You ain't gonna fucking make it.",
      "timestamp": "2025-08-11T22:15:09.554910"
    },
    {
      "text": "Guess what you ain't gonna make if you can't sweep the warehouse floor better than the next guy",
      "timestamp": "2025-08-11T22:15:14.562129"
    },
    {
      "text": "You can't sweep the warehouse floor better than the next guy. You ain't gonna fucking make it. Because here's the truth.",
      "timestamp": "2025-08-11T22:15:20.312945"
    },
    {
      "text": "You ain't gonna fucking make it because here's the truth losers always talk about",
      "timestamp": "2025-08-11T22:15:24.852425"
    },
    {
      "text": "Losers always talk about how they hate the loose but they don't do anything about",
      "timestamp": "2025-08-11T22:15:29.539605"
    },
    {
      "text": "how they hate to lose them, but they don't do anything about it. But you know what Winner's Doom? Winner's...",
      "timestamp": "2025-08-11T22:15:35.144578"
    },
    {
      "text": "But you know what Winner you do? Winners will do whatever the fuck it takes. Winners!",
      "timestamp": "2025-08-11T22:15:39.962492"
    },
    {
      "text": "We'll do whatever the fuck it takes. Winners will show and stay late every-",
      "timestamp": "2025-08-11T22:15:44.828422"
    },
    {
      "text": "We'll show it in stay late every fucking day until they're winning. Where's...",
      "timestamp": "2025-08-11T22:15:49.425316"
    },
    {
      "text": "Until they're winning. Witters will top to anybody they can.",
      "timestamp": "2025-08-11T22:15:54.092048"
    },
    {
      "text": "It will talk to anybody they can that can help them and take the lessons of harm.",
      "timestamp": "2025-08-11T22:15:58.751873"
    },
    {
      "text": "that can help them and take the lessons of harm and put them in place. That's what winners do.",
      "timestamp": "2025-08-11T22:16:03.742223"
    },
    {
      "text": "and put them in place, that's what winners did. Losers talk about painting movies.",
      "timestamp": "2025-08-11T22:16:08.750418"
    },
    {
      "text": "Losers talk about painting those losers say it ain't loose",
      "timestamp": "2025-08-11T22:16:13.193141"
    },
    {
      "text": "Losers say they hate blues. Losers do talk about how they want to win. Where's do it though?",
      "timestamp": "2025-08-11T22:16:18.166228"
    },
    {
      "text": "Talk about how they won a win. Where's the fuck you pay? And that means beating the next guy.",
      "timestamp": "2025-08-11T22:16:23.539423"
    },
    {
      "text": "to pay and that means beating the next guy. If you are going to work at your job",
      "timestamp": "2025-08-11T22:16:28.436954"
    },
    {
      "text": "If you are going to work at your job every day and look at all the other mothers",
      "timestamp": "2025-08-11T22:16:33.215245"
    },
    {
      "text": "And look at all the other mothers and take them. Dude, I'm gonna feed the shit out of you.",
      "timestamp": "2025-08-11T22:16:38.289019"
    },
    {
      "text": "I'm gonna be the sir. How do you know what to take? Winners want to be the",
      "timestamp": "2025-08-11T22:16:43.582570"
    },
    {
      "text": "What it takes? Where's one of these of us? Where's half a slide in being the best?",
      "timestamp": "2025-08-11T22:16:48.795660"
    },
    {
      "text": "but winners have pride in being the best. winners have pride in being...",
      "timestamp": "2025-08-11T22:16:53.441236"
    },
    {
      "text": "Winners have applied for being dominant amongst their team mates.",
      "timestamp": "2025-08-11T22:16:57.936646"
    },
    {
      "text": "the dominant amongst their teammates. Ole",
      "timestamp": "2025-08-11T22:17:17.691096"
    },
    {
      "text": "Take this one! Oh, man! i created his voice. Don't!",
      "timestamp": "2025-08-11T22:17:39.516795"
    },
    {
      "text": "in our creating world. The sun's just for hard. You want to know what it's...",
      "timestamp": "2025-08-11T22:17:45.333086"
    },
    {
      "text": "Just for a part, you want to know what it takes to succeed as bad as you want to preach.",
      "timestamp": "2025-08-11T22:17:50.682168"
    },
    {
      "text": "16 as bad as you want to free it's what goes on when the cameras go",
      "timestamp": "2025-08-11T22:17:55.481615"
    },
    {
      "text": "It's what goes on when the cameras go on. Onward, termination.",
      "timestamp": "2025-08-11T22:18:00.385848"
    },
    {
      "text": "It is pandleton The",
      "timestamp": "2025-08-11T22:18:22.827897"
    },
    {
      "text": "You will not outwork me. I will get up earlier than you.",
      "timestamp": "2025-08-11T22:18:27.560673"
    },
    {
      "text": "I will get up all yearning. I will go to sleep late in the morning. I will put him more...",
      "timestamp": "2025-08-11T22:18:31.906988"
    },
    {
      "text": "I'm gonna sleep later in you. I will put in more hours again. I will read more in you.",
      "timestamp": "2025-08-11T22:18:36.044529"
    },
    {
      "text": "I will read more to you. I will pass. I will do whatever it takes.",
      "timestamp": "2025-08-11T22:18:39.801710"
    },
    {
      "text": "I will do whatever it takes. I do things that separate myself from it by...",
      "timestamp": "2025-08-11T22:18:43.673210"
    },
    {
      "text": "I do things that separate myself from them like the passion that I have when I speak. The grind that I-",
      "timestamp": "2025-08-11T22:18:48.443608"
    },
    {
      "text": "I have one I speak the one that I have when I do what I do what are you going to do the stuff?",
      "timestamp": "2025-08-11T22:18:52.625651"
    },
    {
      "text": "I have what I do what I do. What are you going to do to separate yourself? If you ain't got no mark to me.",
      "timestamp": "2025-08-11T22:18:58.288832"
    },
    {
      "text": "for it yourself. If you ain't got no mark to me. If you ain't been looking more to me. If you ain't, it's time.",
      "timestamp": "2025-08-11T22:19:04.061975"
    }
  ],
  "insights": {
    "insights": [
      "You must be willing to do whatever it takes to succeed, including putting in extra hours and effort.",
      "The way you perform one task is a reflection of how you will perform all tasks, so focus on excellence in everything you do.",
      "Losers talk about wanting to win but don't take action, while winners take action and do whatever it takes to achieve success.",
      "Having pride in being the best and being dominant amongst your teammates is key to success.",
      "You must be willing to separate yourself from others through hard work, dedication, and a strong work ethic.",
      "The key to success is not just about working hard, but also about being willing to learn from others and take constructive criticism.",
      "You must be willing to put in the time and effort to develop a strong work ethic and a growth mindset in order to achieve success."
    ]
  },
  "session_ended": "2025-08-11T22:19:24.867725"
}