{
  "transcript_parts": [
    {
      "text": "I'm not going to be able to do it. I'm not going to be able to do it. I'm not going to be able to do it.",
      "timestamp": "2025-09-27T09:18:39.060159"
    },
    {
      "text": "If you're wondering what is this while you're looking back for build this.",
      "timestamp": "2025-09-27T09:18:48.057754"
    },
    {
      "text": "If you're wondering what is this while looking back for me, this is the Lotus MMR, Lotus is second in life.",
      "timestamp": "2025-09-27T09:18:50.901399"
    },
    {
      "text": "is the Lotus MMR, Lotus is second electric in India and it is yours to take on them.",
      "timestamp": "2025-09-27T09:18:53.681688"
    },
    {
      "text": "in India and it is yours to take on the Porsche Dicons and the Mercedes Benz EQM.",
      "timestamp": "2025-09-27T09:18:56.523936"
    },
    {
      "text": "I can't handle the Mercedes Benz EQS but it will offer the",
      "timestamp": "2025-09-27T09:18:59.231092"
    },
    {
      "text": "But it will offer the best of both those cars, the driver and",
      "timestamp": "2025-09-27T09:19:01.944597"
    },
    {
      "text": "the best of both those cars, the driving and handling for hours of loaders, but with a lot of",
      "timestamp": "2025-09-27T09:19:04.783929"
    },
    {
      "text": "prowess of a lotus but with a lot of luxury. How it fives out on the road?",
      "timestamp": "2025-09-27T09:19:07.686290"
    },
    {
      "text": "of luxury. How it pays out on the roads? That's what we have to find out.",
      "timestamp": "2025-09-27T09:19:10.460785"
    },
    {
      "text": "That's what we are to find out. Finished in this paint shade of style.",
      "timestamp": "2025-09-27T09:19:13.241964"
    },
    {
      "text": "Finished in this paint shade of stellar black, the MMR looks like it belongs in a bright",
      "timestamp": "2025-09-27T09:19:16.107338"
    },
    {
      "text": "Blacks the M.A.R. looks like it belongs in a Black Man movie. It hides it.",
      "timestamp": "2025-09-27T09:19:19.045233"
    },
    {
      "text": "man movie. It hides its muscular lines in the shade for up close",
      "timestamp": "2025-09-27T09:19:21.743420"
    },
    {
      "text": "muscular lines in the shade but upclose every surface piece like it's concealing a weapon.",
      "timestamp": "2025-09-27T09:19:24.546193"
    },
    {
      "text": "every surface feels like it's concealing a weapon. Far from Lotus is over.",
      "timestamp": "2025-09-27T09:19:27.398537"
    },
    {
      "text": "Far from Lotus is all lightweight and compact mantra.",
      "timestamp": "2025-09-27T09:19:30.038689"
    },
    {
      "text": "lightweight and compact mantra. The MIRR stretch is about 5 meters long and more than",
      "timestamp": "2025-09-27T09:19:32.815736"
    },
    {
      "text": "are steps over 5 meters long and more than 2 meters wide. The front features",
      "timestamp": "2025-09-27T09:19:35.548675"
    },
    {
      "text": "2 meters wide. The front features katana shaped LED diarils active arrow flaps.",
      "timestamp": "2025-09-27T09:19:38.388367"
    },
    {
      "text": "Tata ship, LED diaries, active arrow flaps and low slung headlamps.",
      "timestamp": "2025-09-27T09:19:41.252354"
    },
    {
      "text": "and those long headlamps. From the side...",
      "timestamp": "2025-09-27T09:19:43.970449"
    },
    {
      "text": "From the side 22 inch, I've got my wheels and the smooth",
      "timestamp": "2025-09-27T09:19:46.659389"
    },
    {
      "text": "to inch and optimize wheels, add flare and the smooth flowing silhouette continues. A strong",
      "timestamp": "2025-09-27T09:19:49.460273"
    },
    {
      "text": "flowing silhouette and continues. A strong character line and visible lighters themselves on the front door.",
      "timestamp": "2025-09-27T09:19:52.312748"
    },
    {
      "text": "character line and visible lighters sensor on the friend or add to the concept like character.",
      "timestamp": "2025-09-27T09:19:55.106108"
    },
    {
      "text": "add to the concept like character. And there is even more drama with the full width LED.",
      "timestamp": "2025-09-27T09:19:57.948478"
    },
    {
      "text": "There's even more drama with the full width LED light bars and active spoiler with two settings",
      "timestamp": "2025-09-27T09:20:00.759686"
    },
    {
      "text": "light bulb and active spoiler with two settings, a massive carbon fiber diffuser and a M-",
      "timestamp": "2025-09-27T09:20:03.596426"
    },
    {
      "text": "a massive carbon fiber diffuser and every single angle is a head turner on this one.",
      "timestamp": "2025-09-27T09:20:06.411324"
    },
    {
      "text": "This single angle is a head turn on this one. Even without making a sound, the M-Yard.",
      "timestamp": "2025-09-27T09:20:09.341634"
    },
    {
      "text": "even without clicking the sound, the MMR demands attention.",
      "timestamp": "2025-09-27T09:20:12.017644"
    },
    {
      "text": "demands attention.",
      "timestamp": "2025-09-27T09:20:14.526054"
    },
    {
      "text": "So the exterior is something you've never seen on garlic before and interior",
      "timestamp": "2025-09-27T09:20:17.259434"
    },
    {
      "text": "is something you've never seen on Kajlupo and the interior is not different lots of quirky features.",
      "timestamp": "2025-09-27T09:20:20.239549"
    },
    {
      "text": "is no different. Lots of quirky features, but my favorite one are the automatic doors.",
      "timestamp": "2025-09-27T09:20:23.078408"
    },
    {
      "text": "but my favorite one are the automatic doors. One touch button to just open them automatically.",
      "timestamp": "2025-09-27T09:20:25.987489"
    },
    {
      "text": "one touch button to just open them automatically and if you want to close all you need to do is depress the",
      "timestamp": "2025-09-27T09:20:29.187420"
    },
    {
      "text": "and if you want to close all you need to do is depress the brake pedals and that.",
      "timestamp": "2025-09-27T09:20:34.084533"
    },
    {
      "text": "brake pedal and that's that but that's just one of the things like I mentioned it",
      "timestamp": "2025-09-27T09:20:37.074493"
    },
    {
      "text": "That's that. But that's just one of the things like I mentioned. If you sit, the dashboard is very unique, very very",
      "timestamp": "2025-09-27T09:20:40.174537"
    },
    {
      "text": "to sit the dashboard is very unique, very very focused and minimalistic in fact you have no button.",
      "timestamp": "2025-09-27T09:20:43.031165"
    },
    {
      "text": "and minimalistic in fact you have no buttons whatsoever on the actual dashboard it is all",
      "timestamp": "2025-09-27T09:20:45.765911"
    },
    {
      "text": "what's ever on the actual dashboard it is all crammed in this 15 inch touchscreen we'll get to",
      "timestamp": "2025-09-27T09:20:48.659062"
    },
    {
      "text": "crammed in this 15 inch saw screen will get to that in a bit.",
      "timestamp": "2025-09-27T09:20:51.454777"
    },
    {
      "text": "that in a bit. From where I am sitting, the steering wheel is absolutely stunning.",
      "timestamp": "2025-09-27T09:20:54.325868"
    },
    {
      "text": "where I am sitting the steering wheel is absolutely stunning angular very high quality",
      "timestamp": "2025-09-27T09:20:57.087204"
    },
    {
      "text": "angular very high quality you've got the dark chrome around here the side also",
      "timestamp": "2025-09-27T09:20:59.808341"
    },
    {
      "text": "dark chrome around here. The side also a metallic and really nice touch. A lot of noise",
      "timestamp": "2025-09-27T09:21:02.645483"
    },
    {
      "text": "metallic and really nice. No, no, no finishes at the back of the pedal. You get no finishes.",
      "timestamp": "2025-09-27T09:21:05.713206"
    },
    {
      "text": "the back of the paddles you get no finishes surrounding these top holders as well.",
      "timestamp": "2025-09-27T09:21:08.508717"
    },
    {
      "text": "is surrounding these stuff holders as well. Display wise you don't get much.",
      "timestamp": "2025-09-27T09:21:15.095108"
    },
    {
      "text": "Well display wise you don't get much, it's a thin display for your instrument cluster basically you get",
      "timestamp": "2025-09-27T09:21:17.980401"
    },
    {
      "text": "in this way for your instrument cluster basically you get your basic readouts and that's about it",
      "timestamp": "2025-09-27T09:21:20.933590"
    },
    {
      "text": "basic readouts and that's about it. The passengers side also guess their own district.",
      "timestamp": "2025-09-27T09:21:23.707118"
    },
    {
      "text": "The passengers side also gets their own display to control media and other functions and in the",
      "timestamp": "2025-09-27T09:21:26.542781"
    },
    {
      "text": "to control media and other functions and in the center console is where you have a few buttons.",
      "timestamp": "2025-09-27T09:21:29.412304"
    },
    {
      "text": "sensor console is where you have a few buttons to control your temperature to of course,",
      "timestamp": "2025-09-27T09:21:32.269780"
    },
    {
      "text": "to control your temperature to of course open the doors automatically you have your drive selector.",
      "timestamp": "2025-09-27T09:21:35.200616"
    },
    {
      "text": "the doors automatically you have your drive selector as well and lots of carbon fiber used.",
      "timestamp": "2025-09-27T09:21:38.013614"
    },
    {
      "text": "as well and lots of carbon fiber use. This big panel of carbon fiber you've got some carbon fiber.",
      "timestamp": "2025-09-27T09:21:41.034384"
    },
    {
      "text": "this big panel of carbon fiber you've got some carbon fiber on the doors as well but",
      "timestamp": "2025-09-27T09:21:43.886252"
    },
    {
      "text": "on the doors as well but some optional extras and this magnetic grey look",
      "timestamp": "2025-09-27T09:21:46.608246"
    },
    {
      "text": "some optional extras and this magnetized grey look is not standard fitment that is a 4.5",
      "timestamp": "2025-09-27T09:21:49.412824"
    },
    {
      "text": "is not standard treatment that is a 4.8 lakh rupees option if you want a brighter",
      "timestamp": "2025-09-27T09:21:52.197949"
    },
    {
      "text": "8 lakh rupees option if you want a brighter shade or a darker shade you can of course go through the load of scat",
      "timestamp": "2025-09-27T09:21:55.113484"
    },
    {
      "text": "or a darker shade you can of course go through the loadless catalog. What's also an optional extra is this 20...",
      "timestamp": "2025-09-27T09:21:58.037700"
    },
    {
      "text": "What's also an optional extra is this 23 speaker catch system and there is no engine.",
      "timestamp": "2025-09-27T09:22:00.865528"
    },
    {
      "text": "33 speaker catch the instrument in there is no engine to listen to you might as well be extra and get",
      "timestamp": "2025-09-27T09:22:03.734782"
    },
    {
      "text": "So listen to Humidest will be extra and get this and then you have the big party drink which is",
      "timestamp": "2025-09-27T09:22:06.588857"
    },
    {
      "text": "And then you have the big party drink which is this glass rope that can select individual panels.",
      "timestamp": "2025-09-27T09:22:09.471382"
    },
    {
      "text": "this last row of depth and select individual panels to control according to your liking. So you can",
      "timestamp": "2025-09-27T09:22:12.373951"
    },
    {
      "text": "To control according to your liking you can have half of it shaded half of it open you go",
      "timestamp": "2025-09-27T09:22:15.159565"
    },
    {
      "text": "half of it shaded half of it open you got a few triangles open basically you can make some",
      "timestamp": "2025-09-27T09:22:17.989862"
    },
    {
      "text": "a few triangles open. Basically you can make some combinations with a nice fun thing to look at.",
      "timestamp": "2025-09-27T09:22:20.814107"
    },
    {
      "text": "combination is a nice fun thing to look at but overall the vibe you get from here is that of a",
      "timestamp": "2025-09-27T09:22:23.704107"
    },
    {
      "text": "Overall the bivou get from here is that of a comfortable GT cars. The fifth even goes sporty.",
      "timestamp": "2025-09-27T09:22:26.652097"
    },
    {
      "text": "Global GT cars, the C7 does sporty, are very very high quality, well-cushion.",
      "timestamp": "2025-09-27T09:22:29.555273"
    },
    {
      "text": "very very high quality well-cushion lots of support everything is electronic",
      "timestamp": "2025-09-27T09:22:32.395136"
    },
    {
      "text": "Lots of support, everything is electronic, speed heating, ventilation, massage and the massage.",
      "timestamp": "2025-09-27T09:22:35.328524"
    },
    {
      "text": "the heating ventilation massage and the massage especially is exceptionally good.",
      "timestamp": "2025-09-27T09:22:38.015967"
    },
    {
      "text": "especially is exceptionally good. You can definitely feel it knowing inside your back.",
      "timestamp": "2025-09-27T09:22:40.802761"
    },
    {
      "text": "You can definitely feel it's gnarling inside your back and that is something you can never get tired of. So overall...",
      "timestamp": "2025-09-27T09:22:44.022960"
    },
    {
      "text": "And that is something you can never get tired of. So overall, very high quality got definitely a cabin.",
      "timestamp": "2025-09-27T09:22:46.967504"
    },
    {
      "text": "very high quality car, definitely a cabin that is worth the price that is this car.",
      "timestamp": "2025-09-27T09:22:49.799181"
    },
    {
      "text": "That is what the price that is the cost. The screen is to bring...",
      "timestamp": "2025-09-27T09:22:52.632510"
    },
    {
      "text": "The screen is the place behind every function on the car right from the auto doors.",
      "timestamp": "2025-09-27T09:22:55.444295"
    },
    {
      "text": "and every function on the car right from the auto door to the headlamps, spoiler setting, AC vents,",
      "timestamp": "2025-09-27T09:22:58.358498"
    },
    {
      "text": "headlamps, spoiler settings, AC vents, seat massaging and everything in between.",
      "timestamp": "2025-09-27T09:23:01.230291"
    },
    {
      "text": "massaging and everything in between. It's all packed in here. The resolution is",
      "timestamp": "2025-09-27T09:23:04.105912"
    },
    {
      "text": "it's all packed in here. The resolution is excellent, the response is superb and there is",
      "timestamp": "2025-09-27T09:23:06.939758"
    },
    {
      "text": "excellent responses superb and there is simply nothing to complain apart from the fact that it's",
      "timestamp": "2025-09-27T09:23:11.610857"
    },
    {
      "text": "simply nothing to complain about from the fact that it is going to take time to get used to the functionality.",
      "timestamp": "2025-09-27T09:23:16.436321"
    },
    {
      "text": "to get used to the functionality. The big glass roof is straight into digital",
      "timestamp": "2025-09-27T09:23:20.824816"
    },
    {
      "text": "The big glass roof is spread into digital triangles that can turn it from transparent to opaque from the",
      "timestamp": "2025-09-27T09:23:25.014506"
    },
    {
      "text": "that can turn it from transparent to opaque from the screen, the 23 speakers can't afford you.",
      "timestamp": "2025-09-27T09:23:31.384158"
    },
    {
      "text": "screen the 23 speaker KF audio is unbelievably good and there is just",
      "timestamp": "2025-09-27T09:23:35.710644"
    },
    {
      "text": "is unbelievably good and there is just nothing to fault in terms of build and quality.",
      "timestamp": "2025-09-27T09:23:40.215236"
    },
    {
      "text": "There's nothing to fault in terms of build and quality.",
      "timestamp": "2025-09-27T09:23:44.495266"
    },
    {
      "text": "I'm in the back seat of the AMA-R.",
      "timestamp": "2025-09-27T09:23:48.870336"
    },
    {
      "text": "Now in the back seat of the AMIR, our space is not an issue at all. It's a long car with a long...",
      "timestamp": "2025-09-27T09:23:54.321152"
    },
    {
      "text": "is not an issue at all. It's a long car with a long wheelbase. So legroom is plenty.",
      "timestamp": "2025-09-27T09:23:59.310830"
    },
    {
      "text": "will be so legroom is plantate decent amount of headroom as well what is the bit of an issue is",
      "timestamp": "2025-09-27T09:24:04.195133"
    },
    {
      "text": "one of headroom as well. What is the bit of an issue is the floor which is raised because",
      "timestamp": "2025-09-27T09:24:09.142354"
    },
    {
      "text": "the floor which is raised because you have the battery pack under it and that results in",
      "timestamp": "2025-09-27T09:24:13.834288"
    },
    {
      "text": "battery pack under it and that results in these opposition. Otherwise even under the support",
      "timestamp": "2025-09-27T09:24:18.490168"
    },
    {
      "text": "in these opposition. Otherwise even under the support would have been an issue. However, because you are seated.",
      "timestamp": "2025-09-27T09:24:23.178220"
    },
    {
      "text": "would have been an issue however because your seated knees up you don't really feel much of that.",
      "timestamp": "2025-09-27T09:24:27.990033"
    },
    {
      "text": "Please don't really feel much of that, what the scenes are exceptionally comfortable.",
      "timestamp": "2025-09-27T09:24:32.546050"
    },
    {
      "text": "but the seats are exceptionally comfortable. Now this car gets the optional executive",
      "timestamp": "2025-09-27T09:24:36.962393"
    },
    {
      "text": "So this turn gets the optional executive pack which is being checked. So 13.2 lakhs.",
      "timestamp": "2025-09-27T09:24:41.793631"
    },
    {
      "text": "which has been ticked of 13.2 lakh rupees option and that basically it leads to the middle",
      "timestamp": "2025-09-27T09:24:46.606094"
    },
    {
      "text": "and that basically it leads to the middle row you have this nice long center",
      "timestamp": "2025-09-27T09:24:52.955751"
    },
    {
      "text": "row you have this nice long center console with a tablet in the center to individual",
      "timestamp": "2025-09-27T09:24:57.204387"
    },
    {
      "text": "tablet in the center, two individual chat and everything can be controlled from",
      "timestamp": "2025-09-27T09:25:01.324782"
    },
    {
      "text": "and everything can be controlled from right here. What you have to do is just press this...",
      "timestamp": "2025-09-27T09:25:05.978958"
    },
    {
      "text": "right here. What you have to do is just press this button, it's anger towards for ease",
      "timestamp": "2025-09-27T09:25:10.394651"
    },
    {
      "text": "button it's angled towards for ease of use and then you have see heating see",
      "timestamp": "2025-09-27T09:25:14.551855"
    },
    {
      "text": "of use and then you have to heating, seat ventilation, seat massaging if you control this.",
      "timestamp": "2025-09-27T09:25:19.049717"
    },
    {
      "text": "ventilation, seat massaging, you can control the sun, roof, the temperature, media controls",
      "timestamp": "2025-09-27T09:25:23.409796"
    },
    {
      "text": "the temperature, media controls obviously. So this is basically your command center, the",
      "timestamp": "2025-09-27T09:25:27.105925"
    },
    {
      "text": "So this is basically your command center, the boss state is right here, so it can obviously be related.",
      "timestamp": "2025-09-27T09:25:31.414973"
    },
    {
      "text": "boss state is right here. It can obviously be reclined as well the backrest so you can find a nice comfy",
      "timestamp": "2025-09-27T09:25:35.868540"
    },
    {
      "text": "inclined as well the backrest so you can find a nice comfy spot. So amenities wise you don't get stunned blind.",
      "timestamp": "2025-09-27T09:25:40.501939"
    },
    {
      "text": "What? Emeritus wise you don't get stun blinds but you get a nice bit of flames for the real glass.",
      "timestamp": "2025-09-27T09:25:45.501923"
    },
    {
      "text": "but you get a nice bit of change for the rear glasses that is always nice on a hot day.",
      "timestamp": "2025-09-27T09:25:50.178463"
    },
    {
      "text": "that's always nice on a hot day, the cap audio system like I mentioned and storage",
      "timestamp": "2025-09-27T09:25:54.278046"
    },
    {
      "text": "I'll get audio system like I mentioned and storage wise you have a big copy hole here 2 types of",
      "timestamp": "2025-09-27T09:25:59.175161"
    },
    {
      "text": "you have a gig copy hole your 2 tight keyboards and you have some space in them.",
      "timestamp": "2025-09-27T09:26:03.607191"
    },
    {
      "text": "and you have some space in the back here as well. So overall, really...",
      "timestamp": "2025-09-27T09:26:08.193378"
    },
    {
      "text": "back here as well. So overall a really comfortable car and very comfortable GD bit.",
      "timestamp": "2025-09-27T09:26:12.303209"
    },
    {
      "text": "comfortable car and very comfortable GT bit it will do it very very nicely.",
      "timestamp": "2025-09-27T09:26:16.400738"
    },
    {
      "text": "It really works very, very nicely.",
      "timestamp": "2025-09-27T09:26:20.435127"
    },
    {
      "text": "Speaking of GT, the boost space is impressive.",
      "timestamp": "2025-09-27T09:26:36.315245"
    },
    {
      "text": "Speaking of GT, the boot space is impressive to add 428 liters which kind of...",
      "timestamp": "2025-09-27T09:26:40.787332"
    },
    {
      "text": "to at 428 liters which can accommodate airport runs and weekend trips along with",
      "timestamp": "2025-09-27T09:26:45.132005"
    },
    {
      "text": "accommodate airport runs and weekend trips along with an additional 31 liters in the front.",
      "timestamp": "2025-09-27T09:26:49.405964"
    },
    {
      "text": "an additional 31 liters in the front that is mostly taken up by charging cables.",
      "timestamp": "2025-09-27T09:26:53.980325"
    },
    {
      "text": "mostly taken up by charging cables. However, one of the lotuses all about is the performance.",
      "timestamp": "2025-09-27T09:26:58.348947"
    },
    {
      "text": "However, what the Lotus is all about is the performance. It's an R which is the most extreme I trade.",
      "timestamp": "2025-09-27T09:27:02.447730"
    },
    {
      "text": "It's an R which is the most extreme iteration with 918 horsepower and",
      "timestamp": "2025-09-27T09:27:06.559508"
    },
    {
      "text": "with 918 hosper and 985 Newton meters from",
      "timestamp": "2025-09-27T09:27:10.500798"
    },
    {
      "text": "985 Newton meters from a dual motor setup and 102 kilowatt.",
      "timestamp": "2025-09-27T09:27:14.836288"
    },
    {
      "text": "dual motor setup and 102 kWh battery pack.",
      "timestamp": "2025-09-27T09:27:19.116095"
    },
    {
      "text": "and feedback. Even in the comma to a mode it's fast but you...",
      "timestamp": "2025-09-27T09:27:23.432282"
    },
    {
      "text": "the camera to a mode it's fast but you can get crazy over this",
      "timestamp": "2025-09-27T09:27:27.679813"
    },
    {
      "text": "I'm getting crazy over this All you have to do is to hang on this bad shit",
      "timestamp": "2025-09-27T09:27:34.861381"
    },
    {
      "text": "All you have to do is run on this fire shifter that switches the mode to short and",
      "timestamp": "2025-09-27T09:27:39.667218"
    },
    {
      "text": "that which is the mode to sport and once it is in sport the car lowers down.",
      "timestamp": "2025-09-27T09:27:44.192487"
    },
    {
      "text": "Once it is in sport, the car lowers down, suspension is firm, or steering is hefty.",
      "timestamp": "2025-09-27T09:27:48.972459"
    },
    {
      "text": "The suspension is firmer steering is heavier and the battery performance is",
      "timestamp": "2025-09-27T09:27:53.454879"
    },
    {
      "text": "and the battery performance is unhinged.",
      "timestamp": "2025-09-27T09:27:57.593711"
    },
    {
      "text": "is unhinged. That's next laughing reaction we expect.",
      "timestamp": "2025-09-27T09:28:01.968603"
    },
    {
      "text": "That's next laughing reaction you expect of EVs. That is what the sport mode will give you.",
      "timestamp": "2025-09-27T09:28:06.442683"
    },
    {
      "text": "of EVs that is what this fortmore will give you. Like your foot.",
      "timestamp": "2025-09-27T09:28:10.729239"
    },
    {
      "text": "Oh, Lexo Ford! Yeah, it's not short.",
      "timestamp": "2025-09-27T09:28:15.017497"
    },
    {
      "text": "Yeah, it's not short of drama at all.",
      "timestamp": "2025-09-27T09:28:19.042208"
    },
    {
      "text": "no record I solve the situations in AT3 lens",
      "timestamp": "2025-09-27T09:28:33.433179"
    },
    {
      "text": "Now rapid isolation and straight line speed is one thing but what you mostly use for",
      "timestamp": "2025-09-27T09:28:37.800280"
    },
    {
      "text": "is one thing but what you mostly use for it more in an evening is for your heart.",
      "timestamp": "2025-09-27T09:28:40.921700"
    },
    {
      "text": "in an EV is for your hard launches and lifting",
      "timestamp": "2025-09-27T09:28:43.648072"
    },
    {
      "text": "launches and this thing has launch control as well",
      "timestamp": "2025-09-27T09:28:46.309235"
    },
    {
      "text": "as launch control as well. Now load the flame at 0 to 100.",
      "timestamp": "2025-09-27T09:28:49.225908"
    },
    {
      "text": "Now load the flame at 0 to 100 times of under-prest seconds with loads.",
      "timestamp": "2025-09-27T09:28:52.109855"
    },
    {
      "text": "100 times of under-free seconds with launch control of course what you need to do is be in support",
      "timestamp": "2025-09-27T09:28:55.099940"
    },
    {
      "text": "control of course what you need to do is be in support mode let's just do that",
      "timestamp": "2025-09-27T09:28:57.961289"
    },
    {
      "text": "mode let's just do that. Sport, Swipe Down, and turn.",
      "timestamp": "2025-09-27T09:29:00.812892"
    },
    {
      "text": "Swipe down and turn off the traction control. Carry.",
      "timestamp": "2025-09-27T09:29:03.627571"
    },
    {
      "text": "off the traction control. Extremely scary with this car. What do you do?",
      "timestamp": "2025-09-27T09:29:06.498149"
    },
    {
      "text": "Extremely scary with this car, but you do it anyway, foot on the brake, foot on the accelerator",
      "timestamp": "2025-09-27T09:29:09.499443"
    },
    {
      "text": "Anyway, foot on the brake, foot on the accelerator, wait for it launch mode active.",
      "timestamp": "2025-09-27T09:29:12.357658"
    },
    {
      "text": "Wait for it launch more active",
      "timestamp": "2025-09-27T09:29:14.967741"
    },
    {
      "text": "Oh",
      "timestamp": "2025-09-27T09:29:29.878390"
    },
    {
      "text": "Oh, okay. That's like that, you're a hunt.",
      "timestamp": "2025-09-27T09:29:32.651157"
    },
    {
      "text": "Just like that you are 100 and then you also notice",
      "timestamp": "2025-09-27T09:29:35.319795"
    },
    {
      "text": "and then you also notice what is actually wrong with this car and that is",
      "timestamp": "2025-09-27T09:29:38.169987"
    },
    {
      "text": "what is actually wrong with this car and that is the grip.",
      "timestamp": "2025-09-27T09:29:40.944709"
    },
    {
      "text": "the grip. Haruka, A-100, S-1 Michelin, Pilot 440.",
      "timestamp": "2025-09-27T09:29:44.782692"
    },
    {
      "text": "on Michelin, Pilot 4, 4 EV Tires, but there is an option.",
      "timestamp": "2025-09-27T09:29:49.151164"
    },
    {
      "text": "TV tiles but there is an option of putting on fairly pay zero.",
      "timestamp": "2025-09-27T09:29:53.591455"
    },
    {
      "text": "of putting on fairly P0 4.2 like extra and I think that is the key.",
      "timestamp": "2025-09-27T09:29:58.173925"
    },
    {
      "text": "1.2 like extra and I think that is the easiest and the safest 1.2 like you'll see.",
      "timestamp": "2025-09-27T09:30:03.045409"
    },
    {
      "text": "and the safest one point to like you'll spend because with this car you need...",
      "timestamp": "2025-09-27T09:30:07.711563"
    },
    {
      "text": "because with this car you need all the grip you can get as soon as you get off the line.",
      "timestamp": "2025-09-27T09:30:12.230019"
    },
    {
      "text": "all the grip you can get. As soon as you get off the line it latches on initially and then later",
      "timestamp": "2025-09-27T09:30:17.033584"
    },
    {
      "text": "It latches on initially and then later there's so much drop coming in that the time",
      "timestamp": "2025-09-27T09:30:21.413125"
    },
    {
      "text": "there's so much drop coming in that the tires just give up, it just is uncontrolled.",
      "timestamp": "2025-09-27T09:30:25.843884"
    },
    {
      "text": "just give up, it just is uncontrollably.",
      "timestamp": "2025-09-27T09:30:29.842275"
    },
    {
      "text": "Now sport mode is not extreme enough for you, there is...",
      "timestamp": "2025-09-27T09:30:33.860995"
    },
    {
      "text": "Now the sport mode is not extreme enough for you there is a track mode in there as well and you have to be",
      "timestamp": "2025-09-27T09:30:38.487449"
    },
    {
      "text": "or track mode in there as well and you have to be absolutely loose in the head to engage.",
      "timestamp": "2025-09-27T09:30:43.053421"
    },
    {
      "text": "absolutely loose in the head to engage that on a public road because night...",
      "timestamp": "2025-09-27T09:30:47.365946"
    },
    {
      "text": "that on a public road because 985 Newton meters of torque",
      "timestamp": "2025-09-27T09:30:51.562654"
    },
    {
      "text": "185 Newton meters of torque coming in to also wheels and wheels",
      "timestamp": "2025-09-27T09:30:55.614328"
    },
    {
      "text": "coming in to also win and wins that are not exactly grippy.",
      "timestamp": "2025-09-27T09:30:59.824717"
    },
    {
      "text": "but I'm not exactly grippy. I mean that is a recipe for trouble.",
      "timestamp": "2025-09-27T09:31:04.187651"
    },
    {
      "text": "that is a recipe for trouble but what you are",
      "timestamp": "2025-09-27T09:31:08.105763"
    },
    {
      "text": "But what you also get with track mode is really...",
      "timestamp": "2025-09-27T09:31:12.090721"
    },
    {
      "text": "So get with track mode, it's in big killer's handling.",
      "timestamp": "2025-09-27T09:31:16.354357"
    },
    {
      "text": "big pure talents.",
      "timestamp": "2025-09-27T09:31:28.852152"
    },
    {
      "text": "Now bear in mind and EV is never supposed to feel good in the car.",
      "timestamp": "2025-09-27T09:31:36.991039"
    },
    {
      "text": "Where in mind, an EV is never supposed to feel good in the corners, but the Porsche Tycan has to be...",
      "timestamp": "2025-09-27T09:31:41.691041"
    },
    {
      "text": "corners when the Porsche Tycoon has proved that it can and this one goes...",
      "timestamp": "2025-09-27T09:31:45.823542"
    },
    {
      "text": "proof that it can and this one goes very close to that. The steering is nice.",
      "timestamp": "2025-09-27T09:31:50.075464"
    },
    {
      "text": "very close to that. The steering is nice and sharp.",
      "timestamp": "2025-09-27T09:31:54.077184"
    },
    {
      "text": "and sharp one in terms of feeling feedback you don't have.",
      "timestamp": "2025-09-27T09:31:58.167175"
    },
    {
      "text": "in terms of feeling feedback, you don't have as much as the posture, like posture.",
      "timestamp": "2025-09-27T09:32:02.462854"
    },
    {
      "text": "as much as the posture, that posture is just beautifully balanced.",
      "timestamp": "2025-09-27T09:32:06.745204"
    },
    {
      "text": "This one is very good as well compared to the",
      "timestamp": "2025-09-27T09:32:10.795278"
    },
    {
      "text": "This one is very good as well compared to the EQS it is wise ahead",
      "timestamp": "2025-09-27T09:32:15.131349"
    },
    {
      "text": "EQS it is wise ahead but when it comes to the delicate",
      "timestamp": "2025-09-27T09:32:19.392940"
    },
    {
      "text": "but when it comes to that delicate, you know that lotus feel.",
      "timestamp": "2025-09-27T09:32:23.636657"
    },
    {
      "text": "that lotus peel is not right up there. There is just no...",
      "timestamp": "2025-09-27T09:32:28.073902"
    },
    {
      "text": "It's not right up there. There is just more getting away from the overall weight and in tights on our feet.",
      "timestamp": "2025-09-27T09:32:32.981988"
    },
    {
      "text": "getting away from the overall weight and in 5 ton of weeks, it's definitely feel the mass. While it is winked in.",
      "timestamp": "2025-09-27T09:32:37.945696"
    },
    {
      "text": "definitely feel the mask while it is doing it isn't exactly a joy what does help it",
      "timestamp": "2025-09-27T09:32:42.335747"
    },
    {
      "text": "is not exactly a join. What does help in this case is the air suspension with active roll stabilizer.",
      "timestamp": "2025-09-27T09:32:46.823045"
    },
    {
      "text": "is the air suspension with active roll stabilization. As a result,",
      "timestamp": "2025-09-27T09:32:50.988953"
    },
    {
      "text": "As a result, the corners are absolutely flat.",
      "timestamp": "2025-09-27T09:32:54.859237"
    },
    {
      "text": "The corners are absolutely flat. Body roll is next to none.",
      "timestamp": "2025-09-27T09:32:59.085244"
    },
    {
      "text": "Body roll is next to nothing. In fact, they had to induce some body roll because",
      "timestamp": "2025-09-27T09:33:03.346263"
    },
    {
      "text": "In fact they had to induce some body roll because it was so flat it was making drivers not.",
      "timestamp": "2025-09-27T09:33:07.682919"
    },
    {
      "text": "because it was so flat, it was making driver's muscles. And of course...",
      "timestamp": "2025-09-27T09:33:12.043373"
    },
    {
      "text": "And of course you then have real winds during",
      "timestamp": "2025-09-27T09:33:15.945772"
    },
    {
      "text": "you then have rear wheels during helping you out as well in the tight corners.",
      "timestamp": "2025-09-27T09:33:20.237146"
    },
    {
      "text": "helping you out as well in the tight corners but naturally where you use it more often.",
      "timestamp": "2025-09-27T09:33:24.716631"
    },
    {
      "text": "But naturally, where you use it more often is while taking new turns or",
      "timestamp": "2025-09-27T09:33:28.810957"
    },
    {
      "text": "is while taking U turns or 3 point turns it really strength over",
      "timestamp": "2025-09-27T09:33:32.957691"
    },
    {
      "text": "3 point turns, it really shrinks the overall length of the car and that is a big",
      "timestamp": "2025-09-27T09:33:37.522002"
    },
    {
      "text": "the length of the car and that is a big help. Now why is the corner?",
      "timestamp": "2025-09-27T09:33:41.901950"
    },
    {
      "text": "Yeah, it will be. Now, while the cornering is well and good weather suspension really shines through.",
      "timestamp": "2025-09-27T09:33:49.171684"
    },
    {
      "text": "is well and good weather suspension really shines through a is in the right quality especially and tour more.",
      "timestamp": "2025-09-27T09:33:53.691590"
    },
    {
      "text": "A is in the right quality especially in tour mode this thing has 22 inch wheels.",
      "timestamp": "2025-09-27T09:33:58.220897"
    },
    {
      "text": "This thing has 22 inch wheels fitted on right now and it still is not bad.",
      "timestamp": "2025-09-27T09:34:02.815841"
    },
    {
      "text": "it on right now and it still is not bad. With a car like this, no slung, lot of weight.",
      "timestamp": "2025-09-27T09:34:07.859961"
    },
    {
      "text": "With a car like this, no slung, lot of weight in the bottom. You expect the third to exit.",
      "timestamp": "2025-09-27T09:34:12.585475"
    },
    {
      "text": "in the bottom. You expect the third, you expect the firmness of a skateboard architecture.",
      "timestamp": "2025-09-27T09:34:16.987817"
    },
    {
      "text": "the formness of a skateboard architecture, but that's not the case with this one.",
      "timestamp": "2025-09-27T09:34:21.368317"
    },
    {
      "text": "But that's not the case with this one. In tour mode you can actually use it every day.",
      "timestamp": "2025-09-27T09:34:25.896041"
    },
    {
      "text": "In tour mode you can actually use it every day as a daily driver even through the city's washroom.",
      "timestamp": "2025-09-27T09:34:30.514290"
    },
    {
      "text": "as a daily driver even through the city's wash roads it will cope up quite well.",
      "timestamp": "2025-09-27T09:34:34.857639"
    },
    {
      "text": "it will cope up quite well and the best part is there is an individual mode.",
      "timestamp": "2025-09-27T09:34:39.286298"
    },
    {
      "text": "And the best part is there is an individual mode as well. So you can configure it.",
      "timestamp": "2025-09-27T09:34:43.699493"
    },
    {
      "text": "as well so you can configure everything according to your liking of course.",
      "timestamp": "2025-09-27T09:34:47.811915"
    },
    {
      "text": "everything according to your liking of course all of that isn't this massive 15 and stuff",
      "timestamp": "2025-09-27T09:34:52.196722"
    },
    {
      "text": "all of that is in this master 15 and stuff screen but the fact that you can't pick and choose",
      "timestamp": "2025-09-27T09:34:56.726240"
    },
    {
      "text": "but the fact that you can pick and choose you can have just the right setup for your",
      "timestamp": "2025-09-27T09:35:01.043344"
    },
    {
      "text": "You can have just the right setup for your liking, depending on where you're going, where you're going.",
      "timestamp": "2025-09-27T09:35:05.642652"
    },
    {
      "text": "like it depending on where you're going, where you're traveling, if you need good ride height, what you need.",
      "timestamp": "2025-09-27T09:35:10.650173"
    },
    {
      "text": "If you need good ride height, what you need a light steering or you need a shaft, what you need a",
      "timestamp": "2025-09-27T09:35:15.236684"
    },
    {
      "text": "the light steering, all you need is a shaft, but you're on a bad path so you need that right hide you can.",
      "timestamp": "2025-09-27T09:35:20.067652"
    },
    {
      "text": "or on a bad path so you need that right hide you can make all sorts of combinations and it will work.",
      "timestamp": "2025-09-27T09:35:24.679877"
    },
    {
      "text": "You know make all sorts of combinations and it will work very very well.",
      "timestamp": "2025-09-27T09:35:28.996254"
    },
    {
      "text": "very very well. The performance of the course extreme",
      "timestamp": "2025-09-27T09:35:33.079181"
    }
  ],
  "insights": {
    "insights": [
      "The Lotus MMR offers a unique blend of luxury and performance, with a powerful dual motor setup producing 918 horsepower and 985 Newton meters of torque.",
      "The car features a range of advanced technologies, including a 15-inch touchscreen, a 23-speaker audio system, and a digital glass roof that can be adjusted to different levels of transparency.",
      "The Lotus MMR has a spacious interior, with plenty of legroom and headroom in the front and rear seats, as well as a large boot space of 428 liters.",
      "The car's performance is exceptional, with a 0-100 km/h time of under 3 seconds and a top speed of over 300 km/h, making it one of the fastest production cars on the market.",
      "The Lotus MMR's handling is also impressive, with a well-balanced chassis and a sophisticated air suspension system that provides excellent ride comfort and stability.",
      "The car's track mode is particularly noteworthy, offering a level of handling and grip that is unmatched by many other production cars, making it a serious contender for track days and high-performance driving.",
      "The Lotus MMR's individual mode allows drivers to configure the car's settings to suit their preferences, including ride height, steering weight, and suspension firmness, making it a highly customizable and adaptable vehicle."
    ]
  },
  "session_ended": "2025-09-27T09:35:38.129974"
}