{
  "transcript_parts": [
    {
      "text": "n Seoul",
      "timestamp": "2025-09-10T20:59:57.400764"
    },
    {
      "text": "Are we going back to the days where...",
      "timestamp": "2025-09-10T21:00:06.985845"
    },
    {
      "text": "Are we going back to the days when the entire market was controlled by maybe...",
      "timestamp": "2025-09-10T21:00:11.106161"
    },
    {
      "text": "the entire market was controlled by maybe just Maruti at one point and",
      "timestamp": "2025-09-10T21:00:15.317850"
    },
    {
      "text": "We just Maruti at one point and here which is 80% plus one mani...",
      "timestamp": "2025-09-10T21:00:19.591394"
    },
    {
      "text": "and here we do 80% plus 1 magnified extra and before that just prep",
      "timestamp": "2025-09-10T21:00:24.040332"
    },
    {
      "text": "And before that just premier and invest on motors the headline number is 9",
      "timestamp": "2025-09-10T21:00:28.301920"
    },
    {
      "text": "We are in the InfoSan Motors headline number is 94% of the market is controlled by",
      "timestamp": "2025-09-10T21:00:32.355040"
    },
    {
      "text": "24% of the market is controlled by just six players. The brands which are...",
      "timestamp": "2025-09-10T21:00:37.925292"
    },
    {
      "text": "The brands which are successful here are making products from",
      "timestamp": "2025-09-10T21:00:41.984332"
    },
    {
      "text": "successful here I have making products from ground up conceived specifically.",
      "timestamp": "2025-09-10T21:00:46.138897"
    },
    {
      "text": "ground up conceived specifically for the Indian market first and not.",
      "timestamp": "2025-09-10T21:00:50.074715"
    },
    {
      "text": "for the Indian market first and not the global market. But you could have a situation where you know...",
      "timestamp": "2025-09-10T21:00:54.132570"
    },
    {
      "text": "a global market. You could have a situation where these top sticks are taking so granted",
      "timestamp": "2025-09-10T21:00:57.977196"
    },
    {
      "text": "these top sticks are taking so granted and don't try so hard I mean you you have a",
      "timestamp": "2025-09-10T21:01:01.975325"
    },
    {
      "text": "Don't cry so hard, I mean you have a weakened competition set. What has...",
      "timestamp": "2025-09-10T21:01:06.688700"
    },
    {
      "text": "Weekend competition set what has made the top six even stronger",
      "timestamp": "2025-09-10T21:01:10.849825"
    },
    {
      "text": "made that top six even stronger is just a scale because with this",
      "timestamp": "2025-09-10T21:01:15.337540"
    },
    {
      "text": "is just a skill because with their skill they can afford",
      "timestamp": "2025-09-10T21:01:21.233938"
    },
    {
      "text": "they can afford to kind of absorb the cost of newer",
      "timestamp": "2025-09-10T21:01:27.675646"
    },
    {
      "text": "to kind of absorb the cost of newer regulations and put it into new product development.",
      "timestamp": "2025-09-10T21:01:33.425502"
    },
    {
      "text": "regulations and put it into new product development whereas the others they just exit.",
      "timestamp": "2025-09-10T21:01:39.126370"
    },
    {
      "text": "Where is the others? These are the exit, that segment.",
      "timestamp": "2025-09-10T21:01:45.048937"
    },
    {
      "text": "That segment It started the morning",
      "timestamp": "2025-09-10T21:01:51.419770"
    },
    {
      "text": "Excited morning and time for deep drive hours.",
      "timestamp": "2025-09-10T21:01:56.622976"
    },
    {
      "text": "and time for deep drive our weekly podcast powered by",
      "timestamp": "2025-09-10T21:02:02.241964"
    },
    {
      "text": "weekly podcast powered by Kotak Mahendra Prime. Now this week",
      "timestamp": "2025-09-10T21:02:07.342833"
    },
    {
      "text": "Welcome to my hands up, Ryan. Now this week we have a pretty interesting",
      "timestamp": "2025-09-10T21:02:12.701778"
    },
    {
      "text": "We have a pretty interesting topic, which is the",
      "timestamp": "2025-09-10T21:02:17.740857"
    },
    {
      "text": "topic which is the Indian car market becoming a",
      "timestamp": "2025-09-10T21:02:24.192738"
    },
    {
      "text": "Indian Car Market becoming a monopoly. I am Horma Suraabji.",
      "timestamp": "2025-09-10T21:02:29.566336"
    },
    {
      "text": "I'm not believe I'm almost or object and I'm just but it all and yeah absolutely",
      "timestamp": "2025-09-10T21:02:38.916888"
    },
    {
      "text": "and I'm Sergei Sparetto and yeah absolutely whoever the headline number is 94%",
      "timestamp": "2025-09-10T21:02:43.991951"
    },
    {
      "text": "The headline number is 94% of the market is controlled by just six players.",
      "timestamp": "2025-09-10T21:02:48.998078"
    },
    {
      "text": "of the market is controlled by just six players. Wow that is short-term recovery.",
      "timestamp": "2025-09-10T21:02:56.342628"
    },
    {
      "text": "Wow, that is so cool. I mean, I mean, I don't know. I'll be going back",
      "timestamp": "2025-09-10T21:03:02.871936"
    },
    {
      "text": "I mean, I mean, I don't know, I'll be going back to the days when the entire market was controlled.",
      "timestamp": "2025-09-10T21:03:08.577508"
    },
    {
      "text": "to the days when the entire market was controlled by maybe just Maruti and",
      "timestamp": "2025-09-10T21:03:13.583283"
    },
    {
      "text": "by maybe just Maruti at one point and here which is 80%",
      "timestamp": "2025-09-10T21:03:18.546187"
    },
    {
      "text": "point and here we do 80% plus 1 manufacturer and before that.",
      "timestamp": "2025-09-10T21:03:23.537504"
    },
    {
      "text": "and plus one manufacturer and before that just premier and invest on motors with this",
      "timestamp": "2025-09-10T21:03:28.650261"
    },
    {
      "text": "just premiere and invest on motors with the yeah exactly so I mean that",
      "timestamp": "2025-09-10T21:03:33.622909"
    },
    {
      "text": "Yeah, exactly so I mean absolutely I think that's quite a shocking number",
      "timestamp": "2025-09-10T21:03:38.665540"
    },
    {
      "text": "Absolutely, I think that's quite a shocking number 94% by only",
      "timestamp": "2025-09-10T21:03:43.695479"
    },
    {
      "text": "94% by only 6 miles and the hurrah which means the",
      "timestamp": "2025-09-10T21:03:49.881065"
    },
    {
      "text": "wallome enig... w",
      "timestamp": "2025-09-10T21:04:11.640327"
    },
    {
      "text": "Adol",
      "timestamp": "2025-09-10T21:04:16.657855"
    },
    {
      "text": "So we are talking, we are talking, we are talking, we are talking",
      "timestamp": "2025-09-10T21:04:33.346248"
    },
    {
      "text": "in brands. So we're talking when we we're talking brands in fact it is non-luxury and non-",
      "timestamp": "2025-09-10T21:04:38.041154"
    },
    {
      "text": "In fact, it is non-laggerian non super car, etc. Yeah, really really awesome.",
      "timestamp": "2025-09-10T21:04:42.848206"
    },
    {
      "text": "the city's Audi all the exact. There are any way to 2% of the market 1.3% last year.",
      "timestamp": "2025-09-10T21:04:52.066162"
    },
    {
      "text": "2% of the market 1.3% last year right so this is the mainstream brand so",
      "timestamp": "2025-09-10T21:04:56.259219"
    },
    {
      "text": "So this is the mainstream brands so there are same other mainstream brands who are all",
      "timestamp": "2025-09-10T21:05:00.496424"
    },
    {
      "text": "So there are some other mainstream brands who are all fighting over 6% of the market share screen.",
      "timestamp": "2025-09-10T21:05:05.182965"
    },
    {
      "text": "riding over 6% of the market. That's crazy. So it is good.",
      "timestamp": "2025-09-10T21:05:09.807917"
    },
    {
      "text": "It is because you make sure a great topic as to what.",
      "timestamp": "2025-09-10T21:05:14.002929"
    },
    {
      "text": "makes it a great topic as to what should these other brands do. Yeah, today is...",
      "timestamp": "2025-09-10T21:05:18.713964"
    },
    {
      "text": "These other brands do. Yeah, today is all about the bottom ten. That's right, I mean...",
      "timestamp": "2025-09-10T21:05:23.681796"
    },
    {
      "text": "all about the bottom 10. But before we go to that, I think...",
      "timestamp": "2025-09-10T21:05:28.223655"
    },
    {
      "text": "But before we go to that surges, I think if you slice it a bit, let's go.",
      "timestamp": "2025-09-10T21:05:32.637925"
    },
    {
      "text": "If you slice it a bit, the top 4 players are 80% of the guessing.",
      "timestamp": "2025-09-10T21:05:36.864755"
    },
    {
      "text": "4 players are 80% of the guests in. Absolutely. 80% of the top 4 players.",
      "timestamp": "2025-09-10T21:05:41.317610"
    },
    {
      "text": "Absolutely 80% of the top 4 players which is Maruti. In fact I have that here.",
      "timestamp": "2025-09-10T21:05:46.046693"
    },
    {
      "text": "is Maruti. In fact I have that here Maruti first Monday and then and then and then",
      "timestamp": "2025-09-10T21:05:50.560196"
    },
    {
      "text": "the first one day 100 and 100 and 100 exactly 80% of the market from just 4",
      "timestamp": "2025-09-10T21:05:55.052526"
    },
    {
      "text": "exactly 80% of the market from just 4 you know Toyota Kia come",
      "timestamp": "2025-09-10T21:05:59.611753"
    },
    {
      "text": "Oh, you know, Toyota Kia come in maybe and bring that number up to like 90...",
      "timestamp": "2025-09-10T21:06:04.341793"
    },
    {
      "text": "maybe end and bring that number up to like 94% then but yeah it's interesting",
      "timestamp": "2025-09-10T21:06:08.692907"
    },
    {
      "text": "but yeah it's interesting and also what's very interesting on what this is really",
      "timestamp": "2025-09-10T21:06:13.060301"
    },
    {
      "text": "Also what's very interesting, always is we look at this top 4 The wicket",
      "timestamp": "2025-09-10T21:06:20.482014"
    },
    {
      "text": "this top 4. The bigger genes have been made by the Indian Ranser 2 Indian",
      "timestamp": "2025-09-10T21:06:25.127234"
    },
    {
      "text": "Gains have been made by the Indian brands, the two Indian brands. They've actually rapidly increased their market.",
      "timestamp": "2025-09-10T21:06:30.070065"
    },
    {
      "text": "Steve actually rapidly increased their market share. I think I was covered in Indian brands.",
      "timestamp": "2025-09-10T21:06:34.931466"
    },
    {
      "text": "I think I was covered in Indian brands really kind of great. I mean, start-up motors we know I'm eating.",
      "timestamp": "2025-09-10T21:06:40.189490"
    },
    {
      "text": "Mc pliers",
      "timestamp": "2025-09-10T21:07:01.085744"
    },
    {
      "text": "I'm facing a bit of a challenge right now but you can't take away from the facts.",
      "timestamp": "2025-09-10T21:07:05.778609"
    },
    {
      "text": "challenge right now but you can't take away from the facts that they've really grown. I think they're almost...",
      "timestamp": "2025-09-10T21:07:11.145345"
    },
    {
      "text": "Double market share difference, yeah, but in fact, if you look back from 20, uh, from the",
      "timestamp": "2025-09-10T21:07:21.070122"
    },
    {
      "text": "If you look back from the financial year 2021, talk to you more.",
      "timestamp": "2025-09-10T21:07:25.823558"
    },
    {
      "text": "financial year 2021. Other motors went from 8.2% to today.",
      "timestamp": "2025-09-10T21:07:30.121956"
    },
    {
      "text": "was went from 8.2% to today 13.23% right? Right, right?",
      "timestamp": "2025-09-10T21:07:35.126877"
    },
    {
      "text": "13.23. Right, right. Mahendra has gone from 5.8.",
      "timestamp": "2025-09-10T21:07:40.150437"
    },
    {
      "text": "Mahindra has gone from 5.8 to 12.82. They've mind that really.",
      "timestamp": "2025-09-10T21:07:44.964515"
    },
    {
      "text": "12.82. They mind the really the star of the thing, really kind of worked.",
      "timestamp": "2025-09-10T21:07:49.719156"
    },
    {
      "text": "the star of the thing, really kind of like knocked it out of the park. So mind double them.",
      "timestamp": "2025-09-10T21:07:54.585571"
    },
    {
      "text": "not take over the park so mind that double their market share they have they have a they have double their market",
      "timestamp": "2025-09-10T21:07:59.691040"
    },
    {
      "text": "market share they have they have they have double their market share so whose loss actually almost is interestingly.",
      "timestamp": "2025-09-10T21:08:06.203574"
    },
    {
      "text": "So whose loss actually almost is interestingly Maruti from 47, they went down to 40%",
      "timestamp": "2025-09-10T21:08:11.154881"
    },
    {
      "text": "Maruti from 47, they've gone down to 40% Hyundai 2 from 70%",
      "timestamp": "2025-09-10T21:08:15.495863"
    },
    {
      "text": "and Hyundai took from 17 to 13%. So I will...",
      "timestamp": "2025-09-10T21:08:19.938103"
    },
    {
      "text": "to 13% so I guess there is something to see here that now.",
      "timestamp": "2025-09-10T21:08:24.194710"
    },
    {
      "text": "I guess there is something to see here that I have. Indian cars are a world-class now I guess, and then can...",
      "timestamp": "2025-09-10T21:08:29.748735"
    },
    {
      "text": "Indian cars are a world-class now I guess and consumers are going to the well we at the stock league I don't know if they are world",
      "timestamp": "2025-09-10T21:08:35.201169"
    },
    {
      "text": "consumers are going to the well we at this talk we I don't know if they are world class frankly I don't think all they are right",
      "timestamp": "2025-09-10T21:08:40.743122"
    },
    {
      "text": "Well, perhaps frankly, I don't think all the other, right? I mean, they don't sell in global markets at all.",
      "timestamp": "2025-09-10T21:08:46.085595"
    },
    {
      "text": "So, they're known as selling global markets after all. We have a big topic on this. Yes. So, I think...",
      "timestamp": "2025-09-10T21:08:51.718706"
    },
    {
      "text": "a big topic on this. So I think they are suitable for",
      "timestamp": "2025-09-10T21:08:56.209936"
    },
    {
      "text": "I think they are suitable for Indian consumers.",
      "timestamp": "2025-09-10T21:09:00.409383"
    },
    {
      "text": "Indian consumers will be built for the market but that value",
      "timestamp": "2025-09-10T21:09:04.629740"
    },
    {
      "text": "it's built for the markets but that relevance does not translate to anything.",
      "timestamp": "2025-09-10T21:09:09.271623"
    },
    {
      "text": "does not translate to anything doable and we know that there is no",
      "timestamp": "2025-09-10T21:09:13.298966"
    },
    {
      "text": "Global and we know that we there's no yes Indian brand which is global",
      "timestamp": "2025-09-10T21:09:17.750076"
    },
    {
      "text": "Indian brand which is global right now which is the same given the fact that you",
      "timestamp": "2025-09-10T21:09:33.317765"
    },
    {
      "text": "Now we will show him given the fact that he is in a way in a net of tariffs of China.",
      "timestamp": "2025-09-10T21:09:38.422444"
    },
    {
      "text": "of tariffs of China's on the mat. Could we have, you know, let's-",
      "timestamp": "2025-09-10T21:09:43.502558"
    },
    {
      "text": "on the mat. Could we have, you know, let's say, completed with China for other",
      "timestamp": "2025-09-10T21:09:48.507697"
    },
    {
      "text": "for completed with China for the wide with China for the market is definitely not.",
      "timestamp": "2025-09-10T21:09:52.800116"
    },
    {
      "text": "A wide which China for the market is definitely not. I mean there's not even a hint.",
      "timestamp": "2025-09-10T21:09:57.379926"
    },
    {
      "text": "I mean there's not even a hint of a company becoming like a BYD in India.",
      "timestamp": "2025-09-10T21:10:02.356778"
    },
    {
      "text": "of a company becoming like a BYD in India for example. No, not in the immediate future. Not in the immediate future.",
      "timestamp": "2025-09-10T21:10:07.942455"
    },
    {
      "text": "examples, not in the immediate future, not in the immediate future. But anyway, that's a separate title we discussed that, but I think...",
      "timestamp": "2025-09-10T21:10:13.748180"
    },
    {
      "text": "But anyway, that's a separate title we discussed that, but I think you're coming back to this. I think it's...",
      "timestamp": "2025-09-10T21:10:19.308232"
    },
    {
      "text": "coming back to this. I think it's you know again we've discussed this before it's really this.",
      "timestamp": "2025-09-10T21:10:24.017759"
    },
    {
      "text": "you know again we have discussed this before it is really the structure of the market.",
      "timestamp": "2025-09-10T21:10:28.532623"
    },
    {
      "text": "structure of the market which really plays to the",
      "timestamp": "2025-09-10T21:10:32.837606"
    },
    {
      "text": "really plays to the high volume localized players over here.",
      "timestamp": "2025-09-10T21:10:37.511505"
    },
    {
      "text": "high volume localized players over here designing cars specifically for the",
      "timestamp": "2025-09-10T21:10:41.525619"
    },
    {
      "text": "designing cars specifically for the engine market and constantly invest in the",
      "timestamp": "2025-09-10T21:10:45.503698"
    },
    {
      "text": "engine market and constantly investing in little model refreshments.",
      "timestamp": "2025-09-10T21:10:49.594478"
    },
    {
      "text": "in little model refreshments. If you see the top six.",
      "timestamp": "2025-09-10T21:10:53.789883"
    },
    {
      "text": "very if you see the top six they are the brands which have",
      "timestamp": "2025-09-10T21:10:58.042205"
    },
    {
      "text": "They are the brands which have a kind of a pipeline.",
      "timestamp": "2025-09-10T21:11:02.460679"
    },
    {
      "text": "a kind of a pipeline, a constant kind of floor.",
      "timestamp": "2025-09-10T21:11:06.483659"
    },
    {
      "text": "constant kind of flow of models consistently start like.",
      "timestamp": "2025-09-10T21:11:10.550643"
    },
    {
      "text": "of models consistently start like, you know they have developed a model once or they",
      "timestamp": "2025-09-10T21:11:15.024009"
    },
    {
      "text": "They have developed a model once so they launch the bang and then there's a product out there",
      "timestamp": "2025-09-10T21:11:20.513910"
    },
    {
      "text": "to the bank and then there's a part of it all the next stuff. We did this for Gartnerbord. I think that...",
      "timestamp": "2025-09-10T21:11:26.128979"
    },
    {
      "text": "We do this extraordinary discography But this is completely forgotten about I think 뒤's release arms it up please be reminded.",
      "timestamp": "2025-09-10T21:11:42.512280"
    },
    {
      "text": "Release arms it up. Absolutely. Absolutely right because we look at the brands. In fact, I'll read it now. The top.",
      "timestamp": "2025-09-10T21:11:48.473508"
    },
    {
      "text": "because we look at the brands, in fact I'll read out now the top bottom 10 for our",
      "timestamp": "2025-09-10T21:11:53.682188"
    },
    {
      "text": "the bottom ten for our viewers. They are brands who have done it.",
      "timestamp": "2025-09-10T21:11:58.325111"
    },
    {
      "text": "Have a nice day, pay attention to the impact of a radioactive plant but it contains the problem.",
      "timestamp": "2025-09-10T21:12:12.856708"
    },
    {
      "text": "This is the long scars in Spurts. So we have Honda Volkswagen Scoda.",
      "timestamp": "2025-09-10T21:12:19.957773"
    },
    {
      "text": "We have Honda Volkswagen Skoda Renault Nissan MG",
      "timestamp": "2025-09-10T21:12:25.464216"
    },
    {
      "text": "Renault Nissan MG Citroen Jeep Force Motors NS.",
      "timestamp": "2025-09-10T21:12:30.196682"
    },
    {
      "text": "Citroen Jeep Force Motors in the Susu. Yeah, right. And all",
      "timestamp": "2025-09-10T21:12:34.860322"
    },
    {
      "text": "Yeah, right and all of them are 1.5% market share and then",
      "timestamp": "2025-09-10T21:12:39.546106"
    },
    {
      "text": "of them are 1.5% market share and then download. So yeah, I mean if...",
      "timestamp": "2025-09-10T21:12:44.623998"
    },
    {
      "text": "down to this right so yeah I mean if you look I think Honda would be the",
      "timestamp": "2025-09-10T21:12:49.867365"
    },
    {
      "text": "I think Honda would be the best of the rest of the rest.",
      "timestamp": "2025-09-10T21:12:54.417018"
    },
    {
      "text": "The best of the rest of the rest. Yeah, best of the rest. What about 1.5 miles?",
      "timestamp": "2025-09-10T21:12:59.598941"
    },
    {
      "text": "Yeah, best of the next step, what about 1.5 market? 1.5 market, yeah. The next one.",
      "timestamp": "2025-09-10T21:13:04.919588"
    },
    {
      "text": "You know, hard to be honest, you know, I think one thing I would give Honda is that...",
      "timestamp": "2025-09-10T21:13:14.159281"
    },
    {
      "text": "I think one thing I would give Honda is that they have a plan unlike others who don't.",
      "timestamp": "2025-09-10T21:13:18.818656"
    },
    {
      "text": "They have a plan unlike those who don't. You know, you know, there's a next...",
      "timestamp": "2025-09-10T21:13:23.740148"
    },
    {
      "text": "You know there's an next chance it will come and they keep up.",
      "timestamp": "2025-09-10T21:13:28.051682"
    },
    {
      "text": "to come and they keep up. You know, that's, that's, you know, there's a new image going to come.",
      "timestamp": "2025-09-10T21:13:33.152122"
    },
    {
      "text": "You know there's a new image gonna come we just launch and you want very you know there'll be the next you know",
      "timestamp": "2025-09-10T21:13:37.928454"
    },
    {
      "text": "We just launched a new one for it. You know, there'll be the next one also coming. Hello, we have the LWA TV.",
      "timestamp": "2025-09-10T21:13:43.625873"
    },
    {
      "text": "also coming. They've got the LWA TV so they've got and they've kind of you know let's say.",
      "timestamp": "2025-09-10T21:13:48.456955"
    },
    {
      "text": "So they've got, they've kind of, you know, let's say, have the product life site.",
      "timestamp": "2025-09-10T21:13:53.034677"
    },
    {
      "text": "have the product life cycle kind of strategy in place.",
      "timestamp": "2025-09-10T21:13:57.937884"
    },
    {
      "text": "The only thing is I think",
      "timestamp": "2025-09-10T21:14:01.913705"
    },
    {
      "text": "for that existing product. The only thing is I think they just start tailored.",
      "timestamp": "2025-09-10T21:14:06.406881"
    },
    {
      "text": "they just start tailors their new products to the Indian market. elevate as we are saying.",
      "timestamp": "2025-09-10T21:14:11.428452"
    },
    {
      "text": "their new products to the Indian market. Elevate as we have said earlier, it's doing well in Japan.",
      "timestamp": "2025-09-10T21:14:16.231393"
    },
    {
      "text": "earlier you know it's doing well in Japan but not well in India.",
      "timestamp": "2025-09-10T21:14:20.991176"
    },
    {
      "text": "but not well in India, whether it's the feature set. I mean something similar.",
      "timestamp": "2025-09-10T21:14:25.528437"
    },
    {
      "text": "feature set. I mean something simple like even the CVT of the yellow",
      "timestamp": "2025-09-10T21:14:32.106322"
    },
    {
      "text": "like even the CVT of the elevator you know Honda is known for a CVT but they views are cheap",
      "timestamp": "2025-09-10T21:14:36.620136"
    },
    {
      "text": "Honda is known for a CVT but they've used a cheap CVT, you know, they've used a push valve CVT.",
      "timestamp": "2025-09-10T21:14:41.907720"
    },
    {
      "text": "You know you are push bell CVT you know bell CVT unlike you know cut",
      "timestamp": "2025-09-10T21:14:46.737682"
    },
    {
      "text": "you know, Bell CVD unlike you know, Kata with you, the chain CVD, which is so much better.",
      "timestamp": "2025-09-10T21:14:51.715387"
    },
    {
      "text": "which is a chain serity which is so much better. So small things like that, you know, and the",
      "timestamp": "2025-09-10T21:14:56.548608"
    },
    {
      "text": "So small things like that you know and the NVH is very high on the elevator so I think",
      "timestamp": "2025-09-10T21:15:00.912873"
    },
    {
      "text": "and nature is very high on the elevator. So I think people, these small issues look...",
      "timestamp": "2025-09-10T21:15:05.403412"
    },
    {
      "text": "people these small issues are kind of of people whether it's a feature set and",
      "timestamp": "2025-09-10T21:15:09.685751"
    },
    {
      "text": "kind of all people whether it is a feature set and as we said earlier and we said it before elevate.",
      "timestamp": "2025-09-10T21:15:14.279629"
    },
    {
      "text": "And as we said earlier and we said it before, elevate was actually conceived, you know.",
      "timestamp": "2025-09-10T21:15:18.692505"
    },
    {
      "text": "was actually conceived, you know, about a starting work.",
      "timestamp": "2025-09-10T21:15:22.880079"
    },
    {
      "text": "About started, we were going at about seven, eight years ago. They had...",
      "timestamp": "2025-09-10T21:15:27.594725"
    },
    {
      "text": "about 70 years ago they had they're looking at the WRV that didn't happen.",
      "timestamp": "2025-09-10T21:15:32.549396"
    },
    {
      "text": "So looking at the WRV that didn't happen so in terms of the product planning.",
      "timestamp": "2025-09-10T21:15:37.470928"
    },
    {
      "text": "And so in terms of the product planning it was done so much earlier that today the market is coming.",
      "timestamp": "2025-09-10T21:15:42.474924"
    },
    {
      "text": "it was done so much earlier that today the market is completely moved on and customer",
      "timestamp": "2025-09-10T21:15:48.887290"
    },
    {
      "text": "completely moved on and customer expectations have also completely moved on and they've",
      "timestamp": "2025-09-10T21:15:53.365900"
    },
    {
      "text": "have also completely moved on and they have fallen short in that respect. So I think it's...",
      "timestamp": "2025-09-10T21:15:58.801613"
    },
    {
      "text": "fallen short in that respect. So I think it's really having the how do I say.",
      "timestamp": "2025-09-10T21:16:03.435264"
    },
    {
      "text": "having the how do I say we are trying to spend the",
      "timestamp": "2025-09-10T21:16:07.774178"
    },
    {
      "text": "they have to be flexible to",
      "timestamp": "2025-09-10T21:16:12.038057"
    },
    {
      "text": "to be flexible to get over the kind of global hang-ups that they're doing.",
      "timestamp": "2025-09-10T21:16:17.002681"
    },
    {
      "text": "get over the kind of global hangups that everything has to be to be honest over global.",
      "timestamp": "2025-09-10T21:16:21.968239"
    },
    {
      "text": "everything has to be to be honest over global standard or a template. One side.",
      "timestamp": "2025-09-10T21:16:26.763406"
    },
    {
      "text": "standard or a template, a one-size-fits-all formula which never works in India.",
      "timestamp": "2025-09-10T21:16:31.424826"
    },
    {
      "text": "street hall formula which never works in India. I think that's fundamentally Honda.",
      "timestamp": "2025-09-10T21:16:35.726610"
    },
    {
      "text": "I think that's fundamentally Honda, you know you can accuse Honda.",
      "timestamp": "2025-09-10T21:16:40.128126"
    },
    {
      "text": "you know you can accuse Honda of following that and I think that's the same with a lot of",
      "timestamp": "2025-09-10T21:16:44.811463"
    },
    {
      "text": "following that and I think that's the same with a lot of the other brands as well which are in this",
      "timestamp": "2025-09-10T21:16:49.720151"
    },
    {
      "text": "the other brands as well which are in this best of the rest kind of situation.",
      "timestamp": "2025-09-10T21:16:54.056113"
    },
    {
      "text": "best of the rest kind of situation of 6% of the total karma.",
      "timestamp": "2025-09-10T21:16:58.567999"
    },
    {
      "text": "of 6% of the total car market. Absolutely. And in fact, I...",
      "timestamp": "2025-09-10T21:17:03.560689"
    },
    {
      "text": "absolutely amazing and in fact I think for Honda also strategically",
      "timestamp": "2025-09-10T21:17:08.098756"
    },
    {
      "text": "for Honda. Also strategically did in july double down on s.",
      "timestamp": "2025-09-10T21:17:12.526820"
    },
    {
      "text": "they didn't really double down on SUVs when they do have an SUV like a CRV was",
      "timestamp": "2025-09-10T21:17:17.252844"
    },
    {
      "text": "when they do have an SUV like IXERV was made here for a while they can't find fill",
      "timestamp": "2025-09-10T21:17:22.089049"
    },
    {
      "text": "for a while. I think I know five fell give up on that brand. You know it it came in.",
      "timestamp": "2025-09-10T21:17:27.121266"
    },
    {
      "text": "Give up on that brand. So you know, it came in really strong. I remember reading your reviewer.",
      "timestamp": "2025-09-10T21:17:32.684356"
    },
    {
      "text": "really strong. I remember reading your review of the CRW. It was the fastest.",
      "timestamp": "2025-09-10T21:17:37.583298"
    },
    {
      "text": "And off the CRW it was the first one that came to India. Really good pro",
      "timestamp": "2025-09-10T21:17:42.438173"
    },
    {
      "text": "the first one that came to India. Really good product we saw will consumers flock to it. But I...",
      "timestamp": "2025-09-10T21:17:47.464328"
    },
    {
      "text": "product we saw because he was flocked to it but I feel like let that die.",
      "timestamp": "2025-09-10T21:17:52.309264"
    },
    {
      "text": "I feel like let's die. Die away. It did let's die and also I think what...",
      "timestamp": "2025-09-10T21:17:57.754293"
    },
    {
      "text": "It did let them die and also I think what happened with the CRV was that scene was",
      "timestamp": "2025-09-10T21:18:02.604057"
    },
    {
      "text": "happened with the CRV was that you know the the last generation before did.",
      "timestamp": "2025-09-10T21:18:07.269251"
    },
    {
      "text": "the last generation before they discontinued in terms of",
      "timestamp": "2025-09-10T21:18:11.764962"
    },
    {
      "text": "discontinued PNL in terms of it was a global product.",
      "timestamp": "2025-09-10T21:18:16.355124"
    },
    {
      "text": "it was a global product and you know you had it with a",
      "timestamp": "2025-09-10T21:18:20.877532"
    },
    {
      "text": "and you know, you had it with a nine speed auto, you know.",
      "timestamp": "2025-09-10T21:18:25.126523"
    },
    {
      "text": "9 speed auto you know on I think it was a diesel",
      "timestamp": "2025-09-10T21:18:29.286149"
    },
    {
      "text": "I think it was a diesel. Yes, I so I had that diesel there. That side, you know.",
      "timestamp": "2025-09-10T21:18:33.879315"
    },
    {
      "text": "Yes, I so I had that easily. That's right, you know, which is just, it's meant for your opinion.",
      "timestamp": "2025-09-10T21:18:38.836803"
    },
    {
      "text": "which is meant for European freeways and motorways not.",
      "timestamp": "2025-09-10T21:18:43.270947"
    },
    {
      "text": "Freeways and motorways not meant for here, but you know you can't with that volume you",
      "timestamp": "2025-09-10T21:18:48.175927"
    },
    {
      "text": "meant for here but you know you can't with that volume you have to go with what is you know let's say",
      "timestamp": "2025-09-10T21:18:53.135364"
    },
    {
      "text": "have to go with what is the global product.",
      "timestamp": "2025-09-10T21:18:57.526772"
    },
    {
      "text": "the global product and the clearly I think that's the issue that you know a lot.",
      "timestamp": "2025-09-10T21:19:02.070405"
    },
    {
      "text": "and clearly I think that's the issue that a lot of them have a global template.",
      "timestamp": "2025-09-10T21:19:07.072940"
    },
    {
      "text": "Most of them have a global template, one size which solve all global markets.",
      "timestamp": "2025-09-10T21:19:11.734888"
    },
    {
      "text": "one size which solves all global markets and very often that does not translate to India the CRVB.",
      "timestamp": "2025-09-10T21:19:16.931112"
    },
    {
      "text": "And very often that does not translate to India, the CRB being a classic example. The last generation one which",
      "timestamp": "2025-09-10T21:19:22.250949"
    },
    {
      "text": "a classic example. The last generation one which got discontinued, whereas,",
      "timestamp": "2025-09-10T21:19:26.678919"
    },
    {
      "text": "discontinued. Where else? The brands which are successful.",
      "timestamp": "2025-09-10T21:19:30.964143"
    },
    {
      "text": "So the bands which are successful here are making products from ground",
      "timestamp": "2025-09-10T21:19:35.282861"
    },
    {
      "text": "here I have making products from ground up conceived specifically for",
      "timestamp": "2025-09-10T21:19:39.496397"
    },
    {
      "text": "up conceived specifically for the Indian market first and not the global",
      "timestamp": "2025-09-10T21:19:43.763571"
    },
    {
      "text": "Indian market first and not the global market's rise and the Indian players they have to do that because",
      "timestamp": "2025-09-10T21:19:48.644597"
    },
    {
      "text": "market's rights and the Indian players they have to do that because they don't have a global market they have to do",
      "timestamp": "2025-09-10T21:19:53.816614"
    },
    {
      "text": "because they don't have a global market, they have to do everything that the Indian consumer watch. So I think that is the fundamental.",
      "timestamp": "2025-09-10T21:19:58.918425"
    },
    {
      "text": "everything that the Indian consumer wants. So I think that is the fundamental difference exactly and you know what was so let let's",
      "timestamp": "2025-09-10T21:20:03.853065"
    },
    {
      "text": "different exactly and you know what was so let's move on to the next brand here which in terms of",
      "timestamp": "2025-09-10T21:20:08.509511"
    },
    {
      "text": "move on to the next brand here which in the office of let's your market share the at least would be Scoda.",
      "timestamp": "2025-09-10T21:20:13.618403"
    },
    {
      "text": "I'm not a bad guy, at least. Would be a good guy. But that's very interesting to see you, so because it was...",
      "timestamp": "2025-09-10T21:20:18.915398"
    },
    {
      "text": "Now that's very interesting to see also because they were at 0.4% with the market share they had at 1%",
      "timestamp": "2025-09-10T21:20:24.001593"
    },
    {
      "text": "at 0.4% of the market share there at 1.0% so say 1%",
      "timestamp": "2025-09-10T21:20:28.859155"
    },
    {
      "text": "0.0, so say 1% and I think they have along with folks.",
      "timestamp": "2025-09-10T21:20:33.486343"
    },
    {
      "text": "And I didn't even have along with folks, so I can obviously like you just we've discussed before.",
      "timestamp": "2025-09-10T21:20:38.058554"
    },
    {
      "text": "So I can obviously like you've discussed before. Address the Indian consumer now with the Indian.",
      "timestamp": "2025-09-10T21:20:42.878794"
    },
    {
      "text": "address the Indian consumer now with the India 2.0 plan. Right, the seems to have shown.",
      "timestamp": "2025-09-10T21:20:48.049136"
    },
    {
      "text": "to point the plan. Right, this seems to have shown some numbers because Volkswagen is the third highest.",
      "timestamp": "2025-09-10T21:20:53.071039"
    },
    {
      "text": "some numbers because Volkswagen is the third highest in the bottom 10 and they are at 0.9",
      "timestamp": "2025-09-10T21:20:57.640976"
    },
    {
      "text": "in the bottom 10 and they are at 0.98 percent. You know so.",
      "timestamp": "2025-09-10T21:21:02.501078"
    },
    {
      "text": "percent you know so I think for these two brands",
      "timestamp": "2025-09-10T21:21:06.945561"
    },
    {
      "text": "I think for these two brands they've kind of awakened to this thing that",
      "timestamp": "2025-09-10T21:21:11.346284"
    },
    {
      "text": "kind of a vacant to this thing that we need to develop domestic.",
      "timestamp": "2025-09-10T21:21:16.226754"
    },
    {
      "text": "we need to develop the mystic production without it. Here focus on...",
      "timestamp": "2025-09-10T21:21:20.838111"
    },
    {
      "text": "production of it. Here focus on the Indian consumer but what",
      "timestamp": "2025-09-10T21:21:25.265673"
    },
    {
      "text": "in consumer but what next is also now the next",
      "timestamp": "2025-09-10T21:21:31.253872"
    },
    {
      "text": "Next is also now the next uh... Yeah because... So I can go, yeah. Ok, so I can score here right...",
      "timestamp": "2025-09-10T21:21:39.859449"
    },
    {
      "text": "So I think, well, Volkswagen is good at your ride with India 2.0, they did realize, but I think",
      "timestamp": "2025-09-10T21:21:44.798253"
    },
    {
      "text": "with India 2.0 they did realize but I think even they have had a lot of challenges I think the biggest",
      "timestamp": "2025-09-10T21:21:49.939050"
    },
    {
      "text": "they've had a lot of challenges. I think the biggest challenge has been overall cost.",
      "timestamp": "2025-09-10T21:21:54.870747"
    },
    {
      "text": "challenge has been overall cost. It's a very high cost",
      "timestamp": "2025-09-10T21:21:59.409804"
    },
    {
      "text": "It's a very high cost structure, high cost organization where this development",
      "timestamp": "2025-09-10T21:22:03.877095"
    },
    {
      "text": "high cost organizations where this development cost or whatever cost is all counted.",
      "timestamp": "2025-09-10T21:22:08.124753"
    },
    {
      "text": "any separate cost or whatever cost is all counted in Euros? Even Lentilary� vérose laughs or whatever Français' moving money!",
      "timestamp": "2025-09-10T21:22:27.754438"
    },
    {
      "text": "in Euros. Even in England, Euros, Scota developing. And even I'm Scota developing it. But, you don't... Don't forget...",
      "timestamp": "2025-09-10T21:22:33.515951"
    },
    {
      "text": "Even I scored a developing it but don't forget score. It still is not developing a lot of it.",
      "timestamp": "2025-09-10T21:22:38.791967"
    },
    {
      "text": "that Skoda still is not developing a lot of it a lot of the sobriety parts like the",
      "timestamp": "2025-09-10T21:22:45.222846"
    },
    {
      "text": "lot of the sobriety parts like the platforms, the engines are still controlled by folks Whoever likes some of my videos might be willing to treat their customers, so feel free to think about it for the first time.",
      "timestamp": "2025-09-10T21:23:00.844300"
    },
    {
      "text": "the engines are still controlled by Volkswagen. So any changes there obviously there is a big",
      "timestamp": "2025-09-10T21:23:05.668051"
    },
    {
      "text": "So any changes there, obviously there's a big bill being sent by folks, which makes...",
      "timestamp": "2025-09-10T21:23:10.847639"
    },
    {
      "text": "being sent by Volkswagen which makes, you know, let's say projects unwabble.",
      "timestamp": "2025-09-10T21:23:15.460761"
    },
    {
      "text": "you know let's say projects unwambled to launch new products now I think let's",
      "timestamp": "2025-09-10T21:23:20.082136"
    },
    {
      "text": "to launch new products. Now I think again there are the crossroads right now we've discussed.",
      "timestamp": "2025-09-10T21:23:25.155919"
    },
    {
      "text": "there are the crossroads right now we've discussed this before they don't have a release.",
      "timestamp": "2025-09-10T21:23:30.189138"
    },
    {
      "text": "before they don't have a really signed of any new products immediately.",
      "timestamp": "2025-09-10T21:23:34.475991"
    },
    {
      "text": "of any new products immediately beyond the 2.0 products. We know that",
      "timestamp": "2025-09-10T21:23:38.948218"
    },
    {
      "text": "beyond that 2.0 products. We know there will be facelips of the Kushak.",
      "timestamp": "2025-09-10T21:23:43.438452"
    },
    {
      "text": "facelifts of the Kushak and you know Tygoon node.",
      "timestamp": "2025-09-10T21:23:48.332681"
    },
    {
      "text": "and you know, tygoon, nodial priest is spent for the vortice and slum.",
      "timestamp": "2025-09-10T21:23:53.674082"
    },
    {
      "text": "will face this fan for the word and Slavya but I think",
      "timestamp": "2025-09-10T21:23:58.422223"
    },
    {
      "text": "we have but I think obviously they are looking at a new platform right now.",
      "timestamp": "2025-09-10T21:24:02.923607"
    },
    {
      "text": "obviously they are looking at a new platform right now which will be a combination of EVI's",
      "timestamp": "2025-09-10T21:24:09.235581"
    },
    {
      "text": "which will be a combination of EVI's, hybrid and everything still in the works. They're quite...",
      "timestamp": "2025-09-10T21:24:14.648670"
    },
    {
      "text": "everything still in the works they're quite late to it. Basically they're stuck.",
      "timestamp": "2025-09-10T21:24:19.754344"
    },
    {
      "text": "lead to it. Basically they are struggling with cost. I think that is the basic problem.",
      "timestamp": "2025-09-10T21:24:24.448999"
    },
    {
      "text": "struggling with cost. I think that is the basic problem and I think all these come",
      "timestamp": "2025-09-10T21:24:29.036062"
    },
    {
      "text": "And I think all these companies, you know, with such small markets.",
      "timestamp": "2025-09-10T21:24:33.732180"
    },
    {
      "text": "Japanese, you know, with such small market share, they don't have the scale to really develop.",
      "timestamp": "2025-09-10T21:24:38.648076"
    },
    {
      "text": "they don't have the scale to really develop let's say you know let's say local",
      "timestamp": "2025-09-10T21:24:43.644768"
    },
    {
      "text": "Let's say localized products or products specifically for the Indian",
      "timestamp": "2025-09-10T21:24:48.005966"
    },
    {
      "text": "products or products specifically for the Indian market. So that means a bit of chicken and eggs for everyone.",
      "timestamp": "2025-09-10T21:24:53.312637"
    },
    {
      "text": "market. So that is a bit of a chicken and egg for everyone, you know, do you just take the chicken?",
      "timestamp": "2025-09-10T21:25:08.301791"
    },
    {
      "text": "you know do you just take the plan to invest heavily and hope you'll get the volume",
      "timestamp": "2025-09-10T21:25:13.177720"
    },
    {
      "text": "West heavily and hope you'll get the volume or you know or just",
      "timestamp": "2025-09-10T21:25:17.447077"
    },
    {
      "text": "Or just hope that the customer will be able to...",
      "timestamp": "2025-09-10T21:25:21.989497"
    },
    {
      "text": "the customer will appreciate the product for what it is. So I think they are...",
      "timestamp": "2025-09-10T21:25:27.074851"
    },
    {
      "text": "share the product for what it is so I think they are having a challenge over there I think",
      "timestamp": "2025-09-10T21:25:31.545479"
    },
    {
      "text": "having a challenge over there. I think Skylack has given Scoda a big boost of it.",
      "timestamp": "2025-09-10T21:25:36.480971"
    },
    {
      "text": "has given SCOTA a big boost of it. It's done fairly well but I think again they've...",
      "timestamp": "2025-09-10T21:25:41.422373"
    },
    {
      "text": "It's done fairly well, but I think again they've got their pricing a bit wrong the lower way",
      "timestamp": "2025-09-10T21:25:46.299379"
    },
    {
      "text": "they are pricing a bit wrong the lower variant is too cheap and the top end variant",
      "timestamp": "2025-09-10T21:25:50.956485"
    },
    {
      "text": "and that's the top and very expensive. I think they need to...",
      "timestamp": "2025-09-10T21:25:55.934475"
    },
    {
      "text": "expensive. I think they need to, you know, collab now, or the gabs a bit.",
      "timestamp": "2025-09-10T21:26:00.750610"
    },
    {
      "text": "in Calamnaro, Mad Hafota a bit. Idea product's pretty light accepted, bunies.",
      "timestamp": "2025-09-10T21:26:20.484332"
    },
    {
      "text": "By the products pretty well accepted, we've liked it. It is brilliantly not attractive by the way.",
      "timestamp": "2025-09-10T21:26:25.605714"
    },
    {
      "text": "it is brilliantly not attractive by the way. So, you know, dynamically a great car.",
      "timestamp": "2025-09-10T21:26:30.857904"
    },
    {
      "text": "So you know, dynamically agreed gun. So I think, well, yeah, I mean, I...",
      "timestamp": "2025-09-10T21:26:36.162177"
    },
    {
      "text": "So I think, I mean, I think what I can see is this boy.",
      "timestamp": "2025-09-10T21:26:40.991796"
    },
    {
      "text": "I think what I can see is with both Volkswagen and Scoda. They want to make...",
      "timestamp": "2025-09-10T21:26:46.181692"
    },
    {
      "text": "Volkswagen and Scoda. They want to make a go over it in the Indian market and...",
      "timestamp": "2025-09-10T21:26:50.627594"
    },
    {
      "text": "and go over to Indian market and you know they've doubled with let's say the",
      "timestamp": "2025-09-10T21:26:55.816756"
    },
    {
      "text": "You know they've dabbled with let's say the partners they've been talking to a lot of people.",
      "timestamp": "2025-09-10T21:27:01.122278"
    },
    {
      "text": "We've been talking to a lot of people, they may be talking to partners.",
      "timestamp": "2025-09-10T21:27:06.307251"
    },
    {
      "text": "They may be talking to partners again. Who knows?",
      "timestamp": "2025-09-10T21:27:10.570157"
    },
    {
      "text": "again who knows you know you might have a diaphanciting now",
      "timestamp": "2025-09-10T21:27:14.872500"
    },
    {
      "text": "might have a type of typing now after my end this talk failed.",
      "timestamp": "2025-09-10T21:27:19.751902"
    },
    {
      "text": "after my English talk sales, they might be having a, you know, MG.",
      "timestamp": "2025-09-10T21:27:24.677008"
    },
    {
      "text": "be having, you know, MG, SAC, I-S-H-I-G-S-W-M-G-S-I-S.",
      "timestamp": "2025-09-10T21:27:30.187436"
    },
    {
      "text": "I see I see I saw it here WMZ here. It's a kind of a partnership coming back.",
      "timestamp": "2025-09-10T21:27:35.237164"
    },
    {
      "text": "he kind of a partnership coming back. So I think lots of options for them.",
      "timestamp": "2025-09-10T21:27:39.977296"
    },
    {
      "text": "I think lots of options for them, but I think they're running out of time and they need to do...",
      "timestamp": "2025-09-10T21:27:44.935799"
    },
    {
      "text": "but I think they're running out of time and they need to do something fast. Right. So you know that that's...",
      "timestamp": "2025-09-10T21:27:50.693741"
    },
    {
      "text": "something fast. Alright, so you know that that's folks who are getting on school where?",
      "timestamp": "2025-09-10T21:28:06.665178"
    },
    {
      "text": "I think I like what you said you have to sum up, it's like Honda.",
      "timestamp": "2025-09-10T21:28:11.300463"
    },
    {
      "text": "Like what you said you have to sum up, it's like Konda It seemed to have like a product or a problem where it is",
      "timestamp": "2025-09-10T21:28:16.520065"
    },
    {
      "text": "to have like a product or a problem or if it is Volkswagen and school or something like a cost or problem.",
      "timestamp": "2025-09-10T21:28:21.754508"
    },
    {
      "text": "so I can one score, I don't think we have a lost problem Karrak, travelled",
      "timestamp": "2025-09-10T21:28:41.518564"
    },
    {
      "text": "problem cracker right so I will do the next in the list and",
      "timestamp": "2025-09-10T21:28:46.215348"
    },
    {
      "text": "to the next in the list and coincidentally again its partners Reno.",
      "timestamp": "2025-09-10T21:28:50.712690"
    },
    {
      "text": "Again it's the partners, they know and they're not, you know, it's 0.8 and 0.6.",
      "timestamp": "2025-09-10T21:28:55.614223"
    },
    {
      "text": "this on you know it's 0.8 and 0.6% market share of what",
      "timestamp": "2025-09-10T21:29:00.428200"
    },
    {
      "text": "and market share. What's your take on these two? What do we know?",
      "timestamp": "2025-09-10T21:29:04.757390"
    },
    {
      "text": "What's your take on this to what do they know we know we did the last podcast on this?",
      "timestamp": "2025-09-10T21:29:09.285557"
    },
    {
      "text": "we did the last podcast on this. I mean, there's a product pipeline there is a product pipeline.",
      "timestamp": "2025-09-10T21:29:14.054608"
    },
    {
      "text": "is a product pipeline there is a product pipeline but I think over there again you know these",
      "timestamp": "2025-09-10T21:29:18.663473"
    },
    {
      "text": "I think over there again, you know, these also, what you have to understand, these come",
      "timestamp": "2025-09-10T21:29:23.889142"
    },
    {
      "text": "also what you have to understand these companies have their own issues back home.",
      "timestamp": "2025-09-10T21:29:28.830696"
    },
    {
      "text": "companies have their own issues back home. You know, Nissan especially, you know, and...",
      "timestamp": "2025-09-10T21:29:33.883845"
    },
    {
      "text": "you know Nissan specially you know and we said this earlier when",
      "timestamp": "2025-09-10T21:29:38.304517"
    },
    {
      "text": "And we said this earlier when you have big fires to put out in your",
      "timestamp": "2025-09-10T21:29:42.719629"
    },
    {
      "text": "you have big fires to put out in your key markets. In there is going to become...",
      "timestamp": "2025-09-10T21:29:47.911254"
    },
    {
      "text": "key markets, India is going to become a less and less of a priority because I mean it's quite logical.",
      "timestamp": "2025-09-10T21:29:52.518119"
    },
    {
      "text": "Lesson less of a priority because I mean it's quite logical who would want to throw money which is",
      "timestamp": "2025-09-10T21:29:57.844407"
    },
    {
      "text": "food, want to throw money which just gets in a market where you can't...",
      "timestamp": "2025-09-10T21:30:02.841816"
    },
    {
      "text": "In a market where you can't see any media to turn, you know you're betting on a few",
      "timestamp": "2025-09-10T21:30:08.096103"
    },
    {
      "text": "see any media to turn you know you're betting on a future which you are not sure",
      "timestamp": "2025-09-10T21:30:12.782818"
    },
    {
      "text": "which you are not sure is there for you and even if you are part of that field.",
      "timestamp": "2025-09-10T21:30:17.932265"
    },
    {
      "text": "is there for you and even if you are part of that future will you be able to make money there? You know subscribe.",
      "timestamp": "2025-09-10T21:30:23.343311"
    },
    {
      "text": "sure will you be able to make money there you know subscribe challenging so I think that's why we are seeing",
      "timestamp": "2025-09-10T21:30:28.198536"
    },
    {
      "text": "challenging. So I think that's why we have seen this kind of a monopolistic structure of",
      "timestamp": "2025-09-10T21:30:32.689981"
    },
    {
      "text": "is kind of a monopolistic structure of only the people who can make money.",
      "timestamp": "2025-09-10T21:30:37.348820"
    },
    {
      "text": "Only the people who can make money, they make a lot of money and they squeeze everyone else out.",
      "timestamp": "2025-09-10T21:30:42.132871"
    },
    {
      "text": "They make a lot of money and they squeeze everyone else out. And that's what is happening in this market. And clearly again...",
      "timestamp": "2025-09-10T21:30:48.201345"
    },
    {
      "text": "And that's what is happening in this market. And clearly again for anyone in this sun, I think, you know.",
      "timestamp": "2025-09-10T21:30:53.800467"
    },
    {
      "text": "for the NOS and I think of course now the NOS is taking over.",
      "timestamp": "2025-09-10T21:30:58.600440"
    },
    {
      "text": "Of course now Reno is you know taken over the plant completely again they're not given",
      "timestamp": "2025-09-10T21:31:03.133198"
    },
    {
      "text": "the plant completely again they are not giving up on India but I think all of them are",
      "timestamp": "2025-09-10T21:31:07.883099"
    },
    {
      "text": "giving up on India but I think all of them are struggling and scratching their heads. What do we do next?",
      "timestamp": "2025-09-10T21:31:13.647910"
    },
    {
      "text": "and scratching the heads, what do we do next? They just don't have the right answer. Ideal thing would be...",
      "timestamp": "2025-09-10T21:31:18.568321"
    },
    {
      "text": "don't have the right answer. Ideal thing would be to partner with someone but there no partners there.",
      "timestamp": "2025-09-10T21:31:23.305932"
    },
    {
      "text": "be to partner with someone but there no partners there as well they don't have the product lineup.",
      "timestamp": "2025-09-10T21:31:27.888381"
    },
    {
      "text": "as well they don't have the product line up but they just don't have the products which are suitable for the Indian",
      "timestamp": "2025-09-10T21:31:32.629630"
    },
    {
      "text": "But they just don't have the products which are suitable for the Indian market. I mean they had something like the quid.",
      "timestamp": "2025-09-10T21:31:37.817279"
    },
    {
      "text": "market. I mean they had something like the quid which they did you know and that did well.",
      "timestamp": "2025-09-10T21:31:42.461324"
    },
    {
      "text": "which they did and that did well for this time. But again they didn't invest in...",
      "timestamp": "2025-09-10T21:31:46.945470"
    },
    {
      "text": "for its time but again they didn't invest in kind of refreshing it so",
      "timestamp": "2025-09-10T21:31:51.221971"
    },
    {
      "text": "kind of refreshing it so they don't keep investing in the product",
      "timestamp": "2025-09-10T21:31:55.767146"
    },
    {
      "text": "They don't keep investing in the product pipeline and even the stop start never really works.",
      "timestamp": "2025-09-10T21:32:00.377456"
    },
    {
      "text": "pipeline and even the stop start never really works and again this is another case of you know stop",
      "timestamp": "2025-09-10T21:32:04.846068"
    },
    {
      "text": "And again Nissan another case of you know stop and start They've had a big product out there",
      "timestamp": "2025-09-10T21:32:09.774555"
    },
    {
      "text": "and start. They've had a big product down right now again trying to reinvest into the",
      "timestamp": "2025-09-10T21:32:14.862428"
    },
    {
      "text": "right now again trying to reinvest into the market and again I think a lot of them are looking at it.",
      "timestamp": "2025-09-10T21:32:19.990212"
    },
    {
      "text": "Okay then again, I think a lot of them are looking at India as the hero with the current geopolitical",
      "timestamp": "2025-09-10T21:32:25.319518"
    },
    {
      "text": "India has the, you know, with the current geopolitical situation, which, you know,",
      "timestamp": "2025-09-10T21:32:30.534162"
    },
    {
      "text": "situation with you know doing things that going in China.",
      "timestamp": "2025-09-10T21:32:35.198144"
    },
    {
      "text": "things are going in China, all the tariffs happening, it's very challenging to be.",
      "timestamp": "2025-09-10T21:32:39.921145"
    },
    {
      "text": "the tariff is happening, it is very challenging period, a very uncertain time. But every...",
      "timestamp": "2025-09-10T21:32:44.890696"
    },
    {
      "text": "a very uncertain time. But everyone somehow sees India as a market.",
      "timestamp": "2025-09-10T21:32:49.451963"
    },
    {
      "text": "someone sees India as a market, you can't ignore and it's a kind of a pain away.",
      "timestamp": "2025-09-10T21:32:54.449858"
    },
    {
      "text": "you can't ignore and it's a kind of a way a good bet to have this market as",
      "timestamp": "2025-09-10T21:32:59.716072"
    },
    {
      "text": "a good bet to have this market as well. Have you ever put in the door or a...",
      "timestamp": "2025-09-10T21:33:05.145375"
    },
    {
      "text": "as well, I have your foot in the door, a toe in the market as well, get. No, I'll sit here, I'll sit here. You know, you...",
      "timestamp": "2025-09-10T21:33:12.054162"
    },
    {
      "text": "in the market as well. Well, I'll see you in the next video. You know, you're really right there and especially for a brand like I would say...",
      "timestamp": "2025-09-10T21:33:18.037389"
    },
    {
      "text": "really right there and especially for a brand like I would say Renault because",
      "timestamp": "2025-09-10T21:33:22.885834"
    },
    {
      "text": "because they are not in the US, they are not in China. Large amount.",
      "timestamp": "2025-09-10T21:33:28.016385"
    },
    {
      "text": "They are not in the US, they are not in China. Large markets. Devar in Russia but with the...",
      "timestamp": "2025-09-10T21:33:32.913214"
    },
    {
      "text": "They were in Russia but with the war they pulled out obviously.",
      "timestamp": "2025-09-10T21:33:37.372155"
    },
    {
      "text": "or they pulled out obviously. So right, so India is the market they have to.",
      "timestamp": "2025-09-10T21:33:42.291630"
    },
    {
      "text": "right sort of India is the market they have to, you know, can I do this or go or do you know? I mean, you",
      "timestamp": "2025-09-10T21:33:48.430679"
    },
    {
      "text": "You know, can we do her go here now? I mean, you know, they're not in any other large market, so...",
      "timestamp": "2025-09-10T21:33:54.416316"
    },
    {
      "text": "they are not in any other large market so they have got to make it work.",
      "timestamp": "2025-09-10T21:33:59.323543"
    },
    {
      "text": "They've got to make it work, you know, and but again no proper investment.",
      "timestamp": "2025-09-10T21:34:04.477715"
    },
    {
      "text": "you know and but again no proper investment in it they've got they've really not см",
      "timestamp": "2025-09-10T21:34:19.902504"
    },
    {
      "text": "They really not refresh their products away, they should have, they have not invested.",
      "timestamp": "2025-09-10T21:34:24.756201"
    },
    {
      "text": "the products away they should have they have not invested in it I mean even the essay by Friday, but bye.",
      "timestamp": "2025-09-10T21:34:39.621851"
    },
    {
      "text": "in a time and even the drivers such a promising product, you know, they are not updated in terms of engine.",
      "timestamp": "2025-09-10T21:34:44.623728"
    },
    {
      "text": "products you know they're not updated in terms of engines or whatever they keep doing the facelift",
      "timestamp": "2025-09-10T21:34:49.927106"
    },
    {
      "text": "or whatever it keeps doing the facelifts but it's really not enough and it's clearly",
      "timestamp": "2025-09-10T21:34:55.023519"
    },
    {
      "text": "it's really not enough and it's clearly not enough to compete with the",
      "timestamp": "2025-09-10T21:34:59.536044"
    },
    {
      "text": "not enough to compete with the top six. You are investing more and more.",
      "timestamp": "2025-09-10T21:35:04.283740"
    },
    {
      "text": "Top 6, you are investing more and more and more and eating more of the market channel.",
      "timestamp": "2025-09-10T21:35:09.309276"
    },
    {
      "text": "and more and more and eating more of the market share as I say the top six are squeezing these guys more",
      "timestamp": "2025-09-10T21:35:14.262558"
    },
    {
      "text": "As I say the top six are squeezing these guys more and more to the margins as we seen from their increases.",
      "timestamp": "2025-09-10T21:35:19.886247"
    },
    {
      "text": "and more to the margins as we seen for their increase in market share. Yeah, absolutely. It was in fact the...",
      "timestamp": "2025-09-10T21:35:25.650241"
    },
    {
      "text": "market share. Yeah, absolutely. It was in fact the bottom 10. Use.",
      "timestamp": "2025-09-10T21:35:30.390106"
    },
    {
      "text": "the bottom 10, used to account for about 11% now it's 5%",
      "timestamp": "2025-09-10T21:35:35.161773"
    },
    {
      "text": "to account for about 11% now it's 5% overall. Yeah so they have a",
      "timestamp": "2025-09-10T21:35:40.428726"
    },
    {
      "text": "overall. So they have also lost their own together as a group.",
      "timestamp": "2025-09-10T21:35:45.204334"
    },
    {
      "text": "also lost their together as a group but what was you know you think with",
      "timestamp": "2025-09-10T21:35:50.175521"
    },
    {
      "text": "But what was you know you think with Renault let's say realizing that they aren't in",
      "timestamp": "2025-09-10T21:35:55.463859"
    },
    {
      "text": "know let's say realizing that the antennae of the major car markets do you think we'll see more",
      "timestamp": "2025-09-10T21:36:00.814462"
    },
    {
      "text": "of the major car markets. Do you think we'll see more investment coming towards India now?",
      "timestamp": "2025-09-10T21:36:06.226428"
    },
    {
      "text": "investment coming towards India now. We have already announced investment but we are social",
      "timestamp": "2025-09-10T21:36:21.650658"
    },
    {
      "text": "already announced investment but my point is what there is a product.",
      "timestamp": "2025-09-10T21:36:26.105943"
    },
    {
      "text": "point is what there is a product. I don't see a suitable product.",
      "timestamp": "2025-09-10T21:36:31.324170"
    },
    {
      "text": "I don't see a suitable product in India. Well, okay.",
      "timestamp": "2025-09-10T21:36:35.787837"
    },
    {
      "text": "in India. Well okay, everyone's getting into, they're gonna get out of dusters.",
      "timestamp": "2025-09-10T21:36:41.338402"
    },
    {
      "text": "Everyone's getting into they're gonna get our dustest product. We just great. Which is okay?",
      "timestamp": "2025-09-10T21:36:46.742242"
    },
    {
      "text": "product. We use great which is the brand I think also absolutely is still alive.",
      "timestamp": "2025-09-10T21:36:52.139215"
    },
    {
      "text": "Because the brand I think also is still alive. That's a great market to be like. But there's no...",
      "timestamp": "2025-09-10T21:36:57.942935"
    },
    {
      "text": "That's a great market to be like but there is no real, there is a compact SUV.",
      "timestamp": "2025-09-10T21:37:03.069506"
    },
    {
      "text": "There is a compact SUV in the form of a Kaiba Kaiga but it's like",
      "timestamp": "2025-09-10T21:37:07.815438"
    },
    {
      "text": "in the form of a Kaiba Kaiga but there's still a gap between the Kaiga and the thing that's nothing",
      "timestamp": "2025-09-10T21:37:13.441874"
    },
    {
      "text": "the gap between the kai j er and the thing there's nothing or you know let's say I don't see them really.",
      "timestamp": "2025-09-10T21:37:19.126500"
    },
    {
      "text": "I don't see them coming in and refreshing their products. I mean they are all in good...",
      "timestamp": "2025-09-10T21:37:24.715431"
    },
    {
      "text": "coming in and refreshing their products. I mean there are good spaces you know they're not in the",
      "timestamp": "2025-09-10T21:37:30.014048"
    },
    {
      "text": "basis, you know, they're not in the sedan market, okay, that's de-growing.",
      "timestamp": "2025-09-10T21:37:35.074794"
    },
    {
      "text": "okay that's de-growing or that's disappearing much again",
      "timestamp": "2025-09-10T21:37:39.718924"
    },
    {
      "text": "That's a very much again. I think you know, they need to",
      "timestamp": "2025-09-10T21:37:44.273203"
    },
    {
      "text": "I think they need to have a broader spread of products. I mean, they are...",
      "timestamp": "2025-09-10T21:37:49.601082"
    },
    {
      "text": "have a broader spread of products. I mean they are there in key segments or they will be just a segment",
      "timestamp": "2025-09-10T21:37:54.747344"
    },
    {
      "text": "there in key segments or they will be. Just the segment is very key, they play a segment with everyone wants.",
      "timestamp": "2025-09-10T21:38:00.658873"
    },
    {
      "text": "is very key if I press that segment with everyone wants. But again, we discussed it in this one. I don't think they'll have the...",
      "timestamp": "2025-09-10T21:38:06.800334"
    },
    {
      "text": "Again we discussed it and I don't think they'll have the power trains to really be competitive.",
      "timestamp": "2025-09-10T21:38:12.246120"
    },
    {
      "text": "power trains to really be competitive. One liter and a 1.3 liter. You know and",
      "timestamp": "2025-09-10T21:38:17.161405"
    },
    {
      "text": "only 10 or 1.3 liters. You know, and as I said, as we said with Nissan, stay.",
      "timestamp": "2025-09-10T21:38:23.003985"
    },
    {
      "text": "And as I said, as he said with Nissan, the table really has to do something disruptive.",
      "timestamp": "2025-09-10T21:38:28.340740"
    },
    {
      "text": "really have to do something disruptive by way of product or by way of product.",
      "timestamp": "2025-09-10T21:38:33.054460"
    },
    {
      "text": "by way of product or by way of price. These are the two things that can really kind of...",
      "timestamp": "2025-09-10T21:38:38.523335"
    },
    {
      "text": "These are the two things that can really kind of you know, disrupt the market and literally.",
      "timestamp": "2025-09-10T21:38:43.573061"
    },
    {
      "text": "you know, the software market and literally bio grab market share from",
      "timestamp": "2025-09-10T21:38:48.366179"
    },
    {
      "text": "bio grab market share from let's say well established brands",
      "timestamp": "2025-09-10T21:38:52.972928"
    },
    {
      "text": "Let's say well established brands or companies like Hyundai with the KETA.",
      "timestamp": "2025-09-10T21:38:58.192725"
    },
    {
      "text": "companies like Hyundai with the KETA, you know, it's so unanswered for you. You've got $7,000.",
      "timestamp": "2025-09-10T21:39:04.384725"
    },
    {
      "text": "you know, it's one and so forth. You've got cell-tops, cranberry, tarab, hi-dried, all of them over there, so...",
      "timestamp": "2025-09-10T21:39:22.567473"
    },
    {
      "text": "I think it's going to be very tough. Subcompact.",
      "timestamp": "2025-09-10T21:39:27.684597"
    },
    {
      "text": "I think it's gonna be very tough. Subcompact SUV segment super super comparative.",
      "timestamp": "2025-09-10T21:39:32.974170"
    },
    {
      "text": "I see this segment super super competitive again for them to make up",
      "timestamp": "2025-09-10T21:39:37.708190"
    },
    {
      "text": "Again for them to make up you know let's say Mark over there. Bye bye.",
      "timestamp": "2025-09-10T21:39:42.875563"
    },
    {
      "text": "you know let's say Mark over there very very challenging so driver again",
      "timestamp": "2025-09-10T21:39:47.372455"
    },
    {
      "text": "challenging so, driver again they have had a great you know let us say.",
      "timestamp": "2025-09-10T21:39:52.126905"
    },
    {
      "text": "They've had a great, you know, the shape, the white space, the whole idea.",
      "timestamp": "2025-09-10T21:39:57.447541"
    },
    {
      "text": "white space there but I don't think that they've taken maximum use of it.",
      "timestamp": "2025-09-10T21:40:02.611785"
    },
    {
      "text": "think that they've taken maximum use of it. Right. Absolutely no. In fact, we've",
      "timestamp": "2025-09-10T21:40:08.185994"
    },
    {
      "text": "Right. Absolutely no. In fact, we've discussed this in the past also. Right? I mean...",
      "timestamp": "2025-09-10T21:40:13.544571"
    },
    {
      "text": "the past also right I mean the driver the turbo engine for example that could be a nice",
      "timestamp": "2025-09-10T21:40:18.942002"
    },
    {
      "text": "the driver the turbo engine for example that could be a nice logical extension of that but",
      "timestamp": "2025-09-10T21:40:23.698545"
    },
    {
      "text": "logical extension of that but yeah I mean that's that's the only son",
      "timestamp": "2025-09-10T21:40:28.606910"
    },
    {
      "text": "Yeah, I mean that's that's the only son for you. What was the next on the list is?",
      "timestamp": "2025-09-10T21:40:33.584779"
    },
    {
      "text": "you. What was the next on the list is MG motor and they are at 0.5%",
      "timestamp": "2025-09-10T21:40:38.292411"
    },
    {
      "text": "G motor and they are at 0.5 percent now. This is really surprising for me because",
      "timestamp": "2025-09-10T21:40:43.029864"
    },
    {
      "text": "enough this is really surprising for me because you think that it would be",
      "timestamp": "2025-09-10T21:40:47.651705"
    },
    {
      "text": "You think that it would be higher up this list or they have been awaited?",
      "timestamp": "2025-09-10T21:40:52.824317"
    },
    {
      "text": "higher up this list they have been waited right they have gotten like the comments",
      "timestamp": "2025-09-10T21:40:57.578061"
    },
    {
      "text": "right they have gotten like the comments you know two door electric they have got good",
      "timestamp": "2025-09-10T21:41:02.434327"
    },
    {
      "text": "or two door electric car, they've got a good sort of EVs, ZS EV, the Windsor now.",
      "timestamp": "2025-09-10T21:41:07.633804"
    },
    {
      "text": "of EVs, they are the CVs, the Windsor now, they have the Hector SUV so flying",
      "timestamp": "2025-09-10T21:41:12.768632"
    },
    {
      "text": "they've had the Hector SUV so prime space so they've done that things correct",
      "timestamp": "2025-09-10T21:41:18.275333"
    },
    {
      "text": "space. So they've done the things correct but I don't think they'll need a mark.",
      "timestamp": "2025-09-10T21:41:23.002394"
    },
    {
      "text": "but I don't think I'm going to let a Mark with the beast. I don't know, comment or I think you know.",
      "timestamp": "2025-09-10T21:41:28.160437"
    },
    {
      "text": "in a comment I think you know, on the CD, it was a flop when it was lost.",
      "timestamp": "2025-09-10T21:41:38.905807"
    },
    {
      "text": "Honestly, it was a flop and it was launching out, speaking up. We have driven it, we love it.",
      "timestamp": "2025-09-10T21:41:44.122437"
    },
    {
      "text": "on to now it's picking up. We have driven and we love the comment. In the most people's, I would love it for what it is.",
      "timestamp": "2025-09-10T21:41:49.628878"
    },
    {
      "text": "the comment in the more people's I will love it for what it is correct. So there's not out of it. I think the winner",
      "timestamp": "2025-09-10T21:41:54.958663"
    },
    {
      "text": "So there's not out of it. I think the Windsor has been evolution. The battery has",
      "timestamp": "2025-09-10T21:42:00.058386"
    },
    {
      "text": "The battery has always got everyone talking to the wind of the best selling.",
      "timestamp": "2025-09-10T21:42:04.829622"
    },
    {
      "text": "always got everyone talking to their wins of the best selling EV. Exha in the market which is amazing.",
      "timestamp": "2025-09-10T21:42:09.787889"
    },
    {
      "text": "in the market which is amazing you know within just one year of launch",
      "timestamp": "2025-09-10T21:42:14.269337"
    },
    {
      "text": "You know, within just one year of launch, it's just shown past",
      "timestamp": "2025-09-10T21:42:18.796282"
    },
    {
      "text": "It's just shown past 5 years of automotors dominance.",
      "timestamp": "2025-09-10T21:42:23.215976"
    },
    {
      "text": "5 years of automotors dominance model Y0 the next on EV without selling the",
      "timestamp": "2025-09-10T21:42:27.870221"
    },
    {
      "text": "model Y0 the next on EV, it's out selling the next on EV which was a top dog. And clearly it shows that",
      "timestamp": "2025-09-10T21:42:33.008762"
    },
    {
      "text": "makes learning even which was a top dog. And clearly shows that, you know, it's a technological superior product.",
      "timestamp": "2025-09-10T21:42:38.379682"
    },
    {
      "text": "that you know, is that a technological superior product to the mix on?",
      "timestamp": "2025-09-10T21:42:43.279510"
    },
    {
      "text": "To the mix on an end-to-leap, it's about product.",
      "timestamp": "2025-09-10T21:42:47.877041"
    },
    {
      "text": "you know and clearly it's about product is king on the flip side well",
      "timestamp": "2025-09-10T21:42:52.440141"
    },
    {
      "text": "on the flip side where they really lost out is on the ice.",
      "timestamp": "2025-09-10T21:42:56.894480"
    },
    {
      "text": "they really lost our days on the ice or the normal combustion cars because of Hector.",
      "timestamp": "2025-09-10T21:43:01.553353"
    },
    {
      "text": "the normal combustion cause because the Hector really you know needs to up his game",
      "timestamp": "2025-09-10T21:43:06.131472"
    },
    {
      "text": "really you know needs to up his game and the Hector came really launch brilliant",
      "timestamp": "2025-09-10T21:43:10.736282"
    },
    {
      "text": "Hector came, really launched brilliantly, it had the same taste as had everything, but now...",
      "timestamp": "2025-09-10T21:43:15.539282"
    },
    {
      "text": "had this list had everything but now you know you've got more and more rivals coming",
      "timestamp": "2025-09-10T21:43:20.148910"
    },
    {
      "text": "you've got more and more rivals coming and you know the Hector is again getting...",
      "timestamp": "2025-09-10T21:43:24.970163"
    },
    {
      "text": "and the heater is again getting, you know facing the heat of competition.",
      "timestamp": "2025-09-10T21:43:29.906067"
    },
    {
      "text": "you are facing the heat of competition and I think one of the biggest challenges for the Hector is that.",
      "timestamp": "2025-09-10T21:43:34.843594"
    },
    {
      "text": "And I think one of the biggest challenges for the Hickat is that it's got very deep, deep, deep and deep Form Fual efficiency. And that is...",
      "timestamp": "2025-09-10T21:43:50.475463"
    },
    {
      "text": "that has got very poor fuel efficiency and that is coming home to bite. And with that,",
      "timestamp": "2025-09-10T21:43:55.739360"
    },
    {
      "text": "coming home to bite and with that vector at one point had a pretty good reason.",
      "timestamp": "2025-09-10T21:44:00.382663"
    },
    {
      "text": "So, hector at one point had a pretty good resale value. In fact, when we did it, it had a pretty good resale value.",
      "timestamp": "2025-09-10T21:44:06.312242"
    },
    {
      "text": "value. In fact, when we visit another pretty good resale value here. Now the resale value is also top.",
      "timestamp": "2025-09-10T21:44:11.933104"
    },
    {
      "text": "Now the resale value is also top. So I think the hexa which was the absolute number.",
      "timestamp": "2025-09-10T21:44:16.922332"
    },
    {
      "text": "So I think the heck though which was the absolute backbone of the MG range that has been",
      "timestamp": "2025-09-10T21:44:21.991685"
    },
    {
      "text": "back phone of the MGV. That has been under huge pressure, huge competition.",
      "timestamp": "2025-09-10T21:44:27.229724"
    },
    {
      "text": "and the huge competition and is not firing the way it did. I mean at one...",
      "timestamp": "2025-09-10T21:44:32.342556"
    },
    {
      "text": "and is not firing the way it did. I mean at one point there is almost up to 5000 units up.",
      "timestamp": "2025-09-10T21:44:37.320177"
    },
    {
      "text": "point is almost up to 5000 units a month in terms of dramatically now.",
      "timestamp": "2025-09-10T21:44:42.145809"
    },
    {
      "text": "month's in October, I think you know. And now the Windsor is, you know, taken and manored by...",
      "timestamp": "2025-09-10T21:44:50.395841"
    },
    {
      "text": "So, Windsor is taking that mantle, but for EV market.",
      "timestamp": "2025-09-10T21:44:55.456884"
    },
    {
      "text": "for the EV market is still very small so you can't be reliable.",
      "timestamp": "2025-09-10T21:45:00.496593"
    },
    {
      "text": "is still very small so you can't be relying on the EVs to you know gratically",
      "timestamp": "2025-09-10T21:45:14.023437"
    },
    {
      "text": "trying only to be able to grab a bigger piece of the overall market today.",
      "timestamp": "2025-09-10T21:45:18.692374"
    },
    {
      "text": "a bigger piece of the overall market. Heavey Market is about 2.5",
      "timestamp": "2025-09-10T21:45:23.433375"
    },
    {
      "text": "He may not be keeping on to the details on, according to the information we have raised, at least that would not have an issue.",
      "timestamp": "2025-09-10T21:45:40.836430"
    },
    {
      "text": "So, just over here. It should increase this year. I think it will. How much we have to see.",
      "timestamp": "2025-09-10T21:45:46.338014"
    },
    {
      "text": "here I think it will how much we have to see I was expecting it to double but I don't know",
      "timestamp": "2025-09-10T21:45:51.545680"
    },
    {
      "text": "I was expecting it to double but I don't know I mean I'm a little skeptical now looking at the way",
      "timestamp": "2025-09-10T21:45:56.550612"
    },
    {
      "text": "I mean I am a little skeptical now looking at the way people are responding to new launches. Guys I said...",
      "timestamp": "2025-09-10T21:46:01.582121"
    },
    {
      "text": "are responding to new launches because there is a KETA EV which you know hasn't done well.",
      "timestamp": "2025-09-10T21:46:06.999146"
    },
    {
      "text": "that IEV which you know hasn't done well so lower. Even the mind of dev switch.",
      "timestamp": "2025-09-10T21:46:17.181327"
    },
    {
      "text": "In the event of Mahindra, devs which launch with such a flurry of so many bookings,",
      "timestamp": "2025-09-10T21:46:22.510240"
    },
    {
      "text": "launch with such a flurry so many bookings but I think you know stabilizing maybe trying to connect to any meditate that flow so looks like you have even the officials thinking about your attitude because you can understand the Filipizingtaking known",
      "timestamp": "2025-09-10T21:46:39.097568"
    },
    {
      "text": "I think stabilizing maybe around 3-4,000 a month which is you know",
      "timestamp": "2025-09-10T21:46:43.778593"
    },
    {
      "text": "1000 amans which is not as much as the booking site yet, still a good number.",
      "timestamp": "2025-09-10T21:46:48.889303"
    },
    {
      "text": "not as much as the booking suggestion. Still a good number I think at that price point and for an EV.",
      "timestamp": "2025-09-10T21:46:53.862794"
    },
    {
      "text": "I think at that price point and for an EV. But again coming back to that...",
      "timestamp": "2025-09-10T21:46:58.781484"
    },
    {
      "text": "but again coming back to that, Windsor alone cannot increase.",
      "timestamp": "2025-09-10T21:47:03.304662"
    },
    {
      "text": "Windsor alone cannot increase MG market share and",
      "timestamp": "2025-09-10T21:47:07.658119"
    },
    {
      "text": "MG market share and I think they have to be a lot more investment in",
      "timestamp": "2025-09-10T21:47:12.966915"
    },
    {
      "text": "they have to be a lot more investment into a lot more product for the",
      "timestamp": "2025-09-10T21:47:17.559362"
    },
    {
      "text": "to a lot more product for the MGU brand to grow and I think that will happen you know because we just",
      "timestamp": "2025-09-10T21:47:22.707901"
    },
    {
      "text": "I think that will happen because with JSW there is obviously there is",
      "timestamp": "2025-09-10T21:47:27.576145"
    },
    {
      "text": "there is obviously they have got the appetite and the money to invest.",
      "timestamp": "2025-09-10T21:47:32.413522"
    },
    {
      "text": "the appetite and the money to invest. So this is a brand that could grow.",
      "timestamp": "2025-09-10T21:47:37.398361"
    },
    {
      "text": "So this is a brand that could grow. So for GSW has to focus on it and not float around with other...",
      "timestamp": "2025-09-10T21:47:42.512832"
    },
    {
      "text": "Yes, W has to focus on that and not float around with other Chinese comment, which they've been doing. Right.",
      "timestamp": "2025-09-10T21:47:48.131254"
    },
    {
      "text": "Chinese come make as we should be doing it. Right. Correct. I mean we know that they",
      "timestamp": "2025-09-10T21:47:53.239934"
    },
    {
      "text": "I mean we know that we're talking to other brands and want to",
      "timestamp": "2025-09-10T21:47:58.071696"
    },
    {
      "text": "talking to other brands and want to be a brand themselves. Exactly so I'll say they get the take.",
      "timestamp": "2025-09-10T21:48:03.707477"
    },
    {
      "text": "to be a brand themselves. Exactly so outside. I get the technology from them right. White label sort of...",
      "timestamp": "2025-09-10T21:48:09.352178"
    }
  ],
  "insights": {
    "insights": [
      "Error generating insights: Error code: 413 - {'error': {'message': 'Request too large for model `llama-3.1-8b-instant` in organization `org_01k29nvjhvegarch87w446r5wk` service tier `on_demand` on tokens per minute (TPM): Limit 6000, Requested 10932, please reduce your message size and try again. Need more tokens? Upgrade to Dev Tier today at https://console.groq.com/settings/billing', 'type': 'tokens', 'code': 'rate_limit_exceeded'}}"
    ]
  },
  "session_ended": "2025-09-10T21:48:13.598046"
}