{
  "transcript_parts": [
    {
      "text": "I'm not in the mood. I'm not in the mood. I'm not in the mood.",
      "timestamp": "2025-09-22T16:29:25.701767"
    },
    {
      "text": "This is the brand new 2026",
      "timestamp": "2025-09-22T16:29:29.375690"
    },
    {
      "text": "This is the brand new 2026 Kawasaki ZXX. Today I'm going to tell you...",
      "timestamp": "2025-09-22T16:29:34.050354"
    },
    {
      "text": "I'm going to tell you everything that's new with the small cycle and how that affects.",
      "timestamp": "2025-09-22T16:29:38.529726"
    },
    {
      "text": "increasing the new with a small cycle and how that affects the riding experience. 42026 U-",
      "timestamp": "2025-09-22T16:29:43.461737"
    },
    {
      "text": "riding experience. 42026 you get a brand new color with a little bit of white",
      "timestamp": "2025-09-22T16:29:48.167023"
    },
    {
      "text": "a brand new color with a little bit of white in the distance. It's from last year.",
      "timestamp": "2025-09-22T16:29:53.159822"
    },
    {
      "text": "that this one shades it from last year. And that's about it, yeah. I think we got that.",
      "timestamp": "2025-09-22T16:29:57.851296"
    },
    {
      "text": "That's about it. Yeah, I think we got that. Okay.",
      "timestamp": "2025-09-22T16:30:02.597052"
    },
    {
      "text": "Okay. You should be on the base behind the guy.",
      "timestamp": "2025-09-22T16:30:06.827348"
    },
    {
      "text": "You should see how much that space behind the camera. You dragged me out here for five o'clock in the morning for this.",
      "timestamp": "2025-09-22T16:30:12.316024"
    },
    {
      "text": "You dragged me out here for five o'clock in the morning for this",
      "timestamp": "2025-09-22T16:30:16.717808"
    },
    {
      "text": "if daughter shit",
      "timestamp": "2025-09-22T16:30:35.441325"
    },
    {
      "text": "Okay, it's been a long time.",
      "timestamp": "2025-09-22T16:30:39.620497"
    },
    {
      "text": "Okay, it's been a long time since we actually reviewed ZXX at all.",
      "timestamp": "2025-09-22T16:30:44.272547"
    },
    {
      "text": "since we actually reviewed ZXXR. The last one was way back in 2019 and",
      "timestamp": "2025-09-22T16:30:48.995169"
    },
    {
      "text": "but the last one was way back in 2019 and this has been a great catch up for me.",
      "timestamp": "2025-09-22T16:30:53.666850"
    },
    {
      "text": "This has been a great catch up for me and we're also going to focus today's review.",
      "timestamp": "2025-09-22T16:30:58.303556"
    },
    {
      "text": "and we're also going to focus today's review largely on the road because this is a",
      "timestamp": "2025-09-22T16:31:02.959230"
    },
    {
      "text": "Largely on the road because this is a super spot it's meant to be on the racetrack",
      "timestamp": "2025-09-22T16:31:07.910495"
    },
    {
      "text": "super sport is meant to be on the racetrack. But Kawasaki's Divinastom bike to ride in those",
      "timestamp": "2025-09-22T16:31:13.308164"
    },
    {
      "text": "But Kawasaki's Divinastar Bike to Ride on the road and that's a good thing because about 9",
      "timestamp": "2025-09-22T16:31:18.347804"
    },
    {
      "text": "road and that's a good thing because about 90% of customers of these sort of bikes and h-",
      "timestamp": "2025-09-22T16:31:23.343663"
    },
    {
      "text": "90% of customers of these sort of bikes and rich spend about 90% of the time riding them on the road.",
      "timestamp": "2025-09-22T16:31:28.406320"
    },
    {
      "text": "about 90% of the time riding them on the road. So today let's take you through.",
      "timestamp": "2025-09-22T16:31:33.399104"
    },
    {
      "text": "So today let's take you through what the direct fixer is all about how it feels.",
      "timestamp": "2025-09-22T16:31:38.238640"
    },
    {
      "text": "What the ZXXR is all about? How it feels to ride and I can tell you right now it's...",
      "timestamp": "2025-09-22T16:31:43.705881"
    },
    {
      "text": "right and I can tell you right now it is so much fun it's an unreasonable",
      "timestamp": "2025-09-22T16:31:48.123278"
    },
    {
      "text": "It is so much fun, it's an unreasonable amount of fun on our roads for a bike and",
      "timestamp": "2025-09-22T16:31:53.076548"
    },
    {
      "text": "amount of fun on our roads for a bike that looks like this. Let's start with the looks.",
      "timestamp": "2025-09-22T16:31:58.055960"
    },
    {
      "text": "looks like this. Let's start with a look. I am a big sign of this new design team.",
      "timestamp": "2025-09-22T16:32:02.817021"
    },
    {
      "text": "I am a big fan of this new design team. I like the new headlamps. It's a...",
      "timestamp": "2025-09-22T16:32:07.217283"
    },
    {
      "text": "I like the new headlamps. It's a more angry, lazy, aggressive",
      "timestamp": "2025-09-22T16:32:11.680624"
    },
    {
      "text": "more angry, lazy, aggressive look, something that you would expect from a bike called an engine.",
      "timestamp": "2025-09-22T16:32:16.475961"
    },
    {
      "text": "look something that you would expect from a bike called Ninja. Wasn't really a fan of the old ZX",
      "timestamp": "2025-09-22T16:32:21.645944"
    },
    {
      "text": "wasn't really a fan of the old ZX-6R that looked a lot like an engine for",
      "timestamp": "2025-09-22T16:32:26.599321"
    },
    {
      "text": "The picture that looked a lot like an engine 400, this looks different, it looks cool.",
      "timestamp": "2025-09-22T16:32:31.147864"
    },
    {
      "text": "This looks different, it looks cool, and I really like this new color scheme.",
      "timestamp": "2025-09-22T16:32:35.520483"
    },
    {
      "text": "and I really like this new color scheme. It's a lot more light green.",
      "timestamp": "2025-09-22T16:32:40.348331"
    },
    {
      "text": "a lot more light green the white just adds a little character and",
      "timestamp": "2025-09-22T16:32:44.819754"
    },
    {
      "text": "The white just adds a little character and it's just a lovely looking white.",
      "timestamp": "2025-09-22T16:32:49.309812"
    },
    {
      "text": "And it's just a lovely looking bike to just stand, look around, observe.",
      "timestamp": "2025-09-22T16:32:54.004280"
    },
    {
      "text": "just stand, look around, absorb, take in all the small details and when you own a superbike",
      "timestamp": "2025-09-22T16:32:58.656806"
    },
    {
      "text": "in all the small details and when you own a super bike that is a really important thing. When you're not riding it...",
      "timestamp": "2025-09-22T16:33:04.039545"
    },
    {
      "text": "That is a really important thing. When you're not riding it, you want to be looking at it with love in your eyes.",
      "timestamp": "2025-09-22T16:33:09.384368"
    },
    {
      "text": "you want to be looking at it with love in your eyes and this bike really does that for me.",
      "timestamp": "2025-09-22T16:33:14.254924"
    },
    {
      "text": "This bike really does that for me. Some other things I really am fond of.",
      "timestamp": "2025-09-22T16:33:19.077493"
    },
    {
      "text": "Some of the things I really am fond of this huge intake outchats was new for 2022.",
      "timestamp": "2025-09-22T16:33:23.639127"
    },
    {
      "text": "This huge air intake outchats was new for 2026 but it's so big and unlike some of",
      "timestamp": "2025-09-22T16:33:28.215990"
    },
    {
      "text": "but it's big and unlike some of the new middleweight",
      "timestamp": "2025-09-22T16:33:32.667501"
    },
    {
      "text": "the new middleweight sport bikes like the Daytona 660.",
      "timestamp": "2025-09-22T16:33:37.129727"
    },
    {
      "text": "Spot bikes like the Daytona 660 particularly that is an actually functional errand",
      "timestamp": "2025-09-22T16:33:41.666127"
    },
    {
      "text": "particularly that is an actually functional air intake. Moving for the back.",
      "timestamp": "2025-09-22T16:33:46.269033"
    },
    {
      "text": "moving for the back does very nicely layered bodywork",
      "timestamp": "2025-09-22T16:33:50.310731"
    },
    {
      "text": "very nicely layered bodywork you can see a bit of the engine picking through from there really",
      "timestamp": "2025-09-22T16:33:54.670985"
    },
    {
      "text": "I can see a bit of the engine picking through from the really nicely finished aluminum chassis. Thanks.",
      "timestamp": "2025-09-22T16:34:00.147953"
    },
    {
      "text": "nicely finished Allurem Gamshasthi, great chunky swing arm, angry pointy tails.",
      "timestamp": "2025-09-22T16:34:04.625817"
    },
    {
      "text": "Chunky Swingham, Angry Pointy Tale section and one of the reasons that this...",
      "timestamp": "2025-09-22T16:34:08.806692"
    },
    {
      "text": "section and one of the reasons that this Kawasaki doesn't have a bunch of",
      "timestamp": "2025-09-22T16:34:14.365912"
    },
    {
      "text": "Kawasaki doesn't have a bunch of fencing around it in the name of the Sari Gardens because it has",
      "timestamp": "2025-09-22T16:34:18.780117"
    },
    {
      "text": "the name of the Sari Gardens because it has a single seat cowl. They sell this bike a",
      "timestamp": "2025-09-22T16:34:23.146662"
    },
    {
      "text": "A single seat cowl, they sell the spike as a single seat on India which means that it doesn't.",
      "timestamp": "2025-09-22T16:34:27.553481"
    },
    {
      "text": "the seat on India which means that it doesn't have real billion put pegs, it doesn't have a",
      "timestamp": "2025-09-22T16:34:31.974468"
    },
    {
      "text": "doesn't have rear pillion put pegs, doesn't have a pillion put peg hold on that side and no starting.",
      "timestamp": "2025-09-22T16:34:36.312940"
    },
    {
      "text": "put back hold on the side and no starry guard. Do you really want to take a pill in a",
      "timestamp": "2025-09-22T16:34:40.630939"
    },
    {
      "text": "God. Do you really want to take a pill in on a bike like this? It's so I suppose you can get",
      "timestamp": "2025-09-22T16:34:45.263349"
    },
    {
      "text": "bike like this is so I suppose you can get the parcel of rod and turn it into a twin",
      "timestamp": "2025-09-22T16:34:49.912920"
    },
    {
      "text": "the bathroom of rod and turn it into a twin-seater, not sure how legal that will be but",
      "timestamp": "2025-09-22T16:34:54.611124"
    },
    {
      "text": "not sure how legal that will be but most people aren't really going to do that.",
      "timestamp": "2025-09-22T16:34:58.703812"
    },
    {
      "text": "most people aren't really going to do that. Beyond that, the proportions are typical",
      "timestamp": "2025-09-22T16:35:02.894777"
    },
    {
      "text": "Beyond that, the proportions are difficult, that actually are just like the old bike is something chunky.",
      "timestamp": "2025-09-22T16:35:07.355599"
    },
    {
      "text": "So just like the old bike, it's a big chunky 17-inch fuel tank. Scoop!",
      "timestamp": "2025-09-22T16:35:11.826132"
    },
    {
      "text": "17, your fuel tank, scooped out over here so you can tuck your helmet in there.",
      "timestamp": "2025-09-22T16:35:16.244223"
    },
    {
      "text": "out over here so you can tuck your helmet in there when you're really couched on on the track.",
      "timestamp": "2025-09-22T16:35:20.520769"
    },
    {
      "text": "when you're really couched on on the track. Let me show you what the riding position is like again.",
      "timestamp": "2025-09-22T16:35:24.920465"
    },
    {
      "text": "Let me show you what the riding position is like again not much is changed here and mostly",
      "timestamp": "2025-09-22T16:35:29.235999"
    },
    {
      "text": "much a stature and mostly quite good. This is a very racy riding.",
      "timestamp": "2025-09-22T16:35:33.456771"
    },
    {
      "text": "quite good, this is a very racy riding position. I would say not as extreme as a",
      "timestamp": "2025-09-22T16:35:37.836137"
    },
    {
      "text": "I would say not as extreme as a ZX-10R that really takes it to another level.",
      "timestamp": "2025-09-22T16:35:42.041070"
    },
    {
      "text": "that X 10R that really takes it to another level but it is a very sporty position.",
      "timestamp": "2025-09-22T16:35:46.366972"
    },
    {
      "text": "but it is a very sporty position. And a nifty old school in that...",
      "timestamp": "2025-09-22T16:35:50.771091"
    },
    {
      "text": "And the little old school in that Nowadays the latest so bikes are bringing the bars up a little",
      "timestamp": "2025-09-22T16:35:55.163453"
    },
    {
      "text": "Nowadays the latest so bikes are bringing the bars up a little higher and a little wider. This is still...",
      "timestamp": "2025-09-22T16:35:59.845112"
    },
    {
      "text": "higher little wider. This is still a little touch in, not bad to have decent",
      "timestamp": "2025-09-22T16:36:04.116229"
    },
    {
      "text": "The detectives are not bad to have decent leverage but not what were used to from the latest.",
      "timestamp": "2025-09-22T16:36:08.331938"
    },
    {
      "text": "but not what were used to from the latest generation of bikes. Perfect, so also quite high.",
      "timestamp": "2025-09-22T16:36:12.604709"
    },
    {
      "text": "Generic number. Perfect also quite high up. You are lean forward but",
      "timestamp": "2025-09-22T16:36:16.823959"
    },
    {
      "text": "you are lean forward but then there are other nice things here for bike like this",
      "timestamp": "2025-09-22T16:36:21.102260"
    },
    {
      "text": "then there are other nice things here for bike like this. For example, there's plenty of clearance here now.",
      "timestamp": "2025-09-22T16:36:25.933291"
    },
    {
      "text": "For example, there's plenty of clearance here now so your thumbs are far away even if you're wearing pants",
      "timestamp": "2025-09-22T16:36:30.272284"
    },
    {
      "text": "Now your thumbs are far away even if you're wearing padclubs when you're taking them. Lock the lock turns.",
      "timestamp": "2025-09-22T16:36:34.895421"
    },
    {
      "text": "gloves when at the end, lock the lock turns, the interface between knee and",
      "timestamp": "2025-09-22T16:36:39.105824"
    },
    {
      "text": "The interface between me and tank and your thigh and the fuel tank is very nice.",
      "timestamp": "2025-09-22T16:36:43.330147"
    },
    {
      "text": "I am not high and the fuel tank is very nice and with bikes like this you really want to hold",
      "timestamp": "2025-09-22T16:36:48.012817"
    },
    {
      "text": "nice and with bikes like this you really want to hold your self in place with your car not with your hands",
      "timestamp": "2025-09-22T16:36:52.533836"
    },
    {
      "text": "hold your self in place with your core, not with your hands and the shape of the shield tag really helps you feel. Where do you...",
      "timestamp": "2025-09-22T16:36:57.235505"
    },
    {
      "text": "and the shape of the shield tag really helps you whether you're sitting upright or if you're leaned off in a corner",
      "timestamp": "2025-09-22T16:37:01.889693"
    },
    {
      "text": "sitting upright or if you're leaned off in a corner. Another thing I really like is that",
      "timestamp": "2025-09-22T16:37:06.826515"
    },
    {
      "text": "Another thing I really like is that the seat is quite spacious so if you're at all right it gives you room.",
      "timestamp": "2025-09-22T16:37:11.831700"
    },
    {
      "text": "The seat is quite spacious so if you're at all right it gives you room to move back and forth. Adjust yourself when you're riding.",
      "timestamp": "2025-09-22T16:37:17.295252"
    },
    {
      "text": "to move back and forth adjust yourself in your riding that's really nice and the seat itself is quite comfortable.",
      "timestamp": "2025-09-22T16:37:22.207117"
    },
    {
      "text": "That's really nice and the seat itself is quite comfortable for a bike like this Some of the super bikes today",
      "timestamp": "2025-09-22T16:37:27.072585"
    },
    {
      "text": "for a bike like this. Some of the super bikes today have just thin hard seems to give maximum feel.",
      "timestamp": "2025-09-22T16:37:33.129761"
    },
    {
      "text": "have just thin hard seams to keep maximum feedback on the racetrack. This is very comfortable.",
      "timestamp": "2025-09-22T16:37:38.679895"
    },
    {
      "text": "back on the racetrack this is very comfortable if you are riding for half an hour 45.",
      "timestamp": "2025-09-22T16:37:43.973442"
    },
    {
      "text": "If you are riding for half an hour 45 minutes at the stretch without taking a break, now what is...",
      "timestamp": "2025-09-22T16:37:48.700188"
    },
    {
      "text": "I'm in at the stretch without taking a break. Now what's it like for shorter riders? Again, seat height has not changed.",
      "timestamp": "2025-09-22T16:37:53.501817"
    },
    {
      "text": "like for shorter riders, again, seat height has not changed, it's still 830 mm, I'm going to get at it.",
      "timestamp": "2025-09-22T16:37:58.240652"
    }
  ],
  "insights": {
    "insights": [
      "The 2026 Kawasaki ZXX has a new design team and a more aggressive look compared to the old ZX-6R.",
      "The bike has a new color scheme with a lot more light green and white, which adds character to the bike.",
      "The riding position is very sporty, but not as extreme as a ZX-10R, with a slightly higher and wider handlebar.",
      "The bike has a single seat cowl, which means it doesn't have rear pillion pegs or a pillion seat, making it more suitable for solo riders.",
      "The proportions of the bike are typical of a super sport bike, with a big chunky 17-inch fuel tank and a racy riding position.",
      "The seat is quite spacious and comfortable, with a lot of clearance for the rider's thumbs and a nice interface between the knee and the fuel tank.",
      "The bike is designed to be ridden on the road, with about 90% of customers using it for daily riding, rather than track riding."
    ]
  },
  "session_ended": "2025-09-22T16:38:00.355404"
}