{
  "transcript_parts": [
    {
      "text": "Honestly, look yourself in the mirror and say I am doing my",
      "timestamp": "2025-08-11T21:31:27.005762"
    },
    {
      "text": "and say I am doing my best. Because if you can...",
      "timestamp": "2025-08-11T21:31:32.804954"
    },
    {
      "text": "best because if you can you're fucking lying to yourself.",
      "timestamp": "2025-08-11T21:31:39.020737"
    },
    {
      "text": "You're fucking lying to yourself. You're a job right now!",
      "timestamp": "2025-08-11T21:31:45.110093"
    },
    {
      "text": "Your job right now and how you execute that job.",
      "timestamp": "2025-08-11T21:31:50.726058"
    },
    {
      "text": "And how you execute that job is going to create the six",
      "timestamp": "2025-08-11T21:31:56.278511"
    },
    {
      "text": "is going to create the success habits that you're going to need.",
      "timestamp": "2025-08-11T21:32:01.939225"
    },
    {
      "text": "That happens that you're going to need down the road how you do",
      "timestamp": "2025-08-11T21:32:07.552813"
    },
    {
      "text": "down the road how you do one thing is how you do everything",
      "timestamp": "2025-08-11T21:32:13.180345"
    },
    {
      "text": "One thing is how you do everything. Just making friends, if you ain't making the best month of a- Confir-",
      "timestamp": "2025-08-11T21:32:20.092946"
    },
    {
      "text": "If you're making fries, if you ain't making the best motherfucking fries every second time, guess what? If you ain't gonna-",
      "timestamp": "2025-08-11T21:32:26.911771"
    },
    {
      "text": "every freaking time. Guess what? You ain't gonna fucking make it. If you can't sweep the warehouse for-",
      "timestamp": "2025-08-11T21:32:33.399779"
    },
    {
      "text": "Fuckin' make it. If you can't sweep the warehouse floor better than the next guy, you ain't gonna fucking make it.",
      "timestamp": "2025-08-11T21:32:39.954201"
    },
    {
      "text": "better than next guy you ain't gonna fucking make it because here's the trip losers",
      "timestamp": "2025-08-11T21:32:45.468488"
    },
    {
      "text": "Because here's the trip. Losers always talk about how they hate to lose, but",
      "timestamp": "2025-08-11T21:32:50.244357"
    },
    {
      "text": "always talk about how they hate to lose but they don't do anything about it but you know winners",
      "timestamp": "2025-08-11T21:32:55.530053"
    },
    {
      "text": "They don't do anything about it, but you know what winners do? Winners will do whatever the fuck it takes.",
      "timestamp": "2025-08-11T21:33:01.445292"
    },
    {
      "text": "We'll do whatever the fuck it takes. We'll do whatever the fuck it takes. We'll do whatever the fuck it takes.",
      "timestamp": "2025-08-11T21:33:07.163280"
    },
    {
      "text": "Winners will show up and stay late every evening day until they're...",
      "timestamp": "2025-08-11T21:33:11.890304"
    },
    {
      "text": "daily every single day until they're winning. Wheres will pop into a",
      "timestamp": "2025-08-11T21:33:17.169904"
    },
    {
      "text": "winning. Where's will pop into anybody they can that can help them and take...",
      "timestamp": "2025-08-11T21:33:22.479233"
    },
    {
      "text": "somebody they can that can help them and take their lessons to heart and put them in play.",
      "timestamp": "2025-08-11T21:33:27.673924"
    },
    {
      "text": "lessons to heart and put them in play. That's what winners do. Losers talk about...",
      "timestamp": "2025-08-11T21:33:32.989999"
    },
    {
      "text": "What winners do? Losers talk about hating the loose. Losers say they hate the loose.",
      "timestamp": "2025-08-11T21:33:38.747431"
    },
    {
      "text": "Losers say they hate to lose. Losers do talk about how they want to win.",
      "timestamp": "2025-08-11T21:33:43.745931"
    },
    {
      "text": "Losers can talk about how they want to win. Winners do what the fuck it takes, and that means...",
      "timestamp": "2025-08-11T21:33:49.272482"
    },
    {
      "text": "Where's you with the funky takes? And that means beating the next guy. If you are going to work...",
      "timestamp": "2025-08-11T21:33:55.031289"
    },
    {
      "text": "I'm meeting the next guy. If you are going to work at your job every day and look at all the other-",
      "timestamp": "2025-08-11T21:34:00.694300"
    },
    {
      "text": "You're shot every day and look at all the other mothers and thick and I'm gonna be",
      "timestamp": "2025-08-11T21:34:06.550695"
    },
    {
      "text": "I'm not a person thick and I'm gonna beat the shit out of all of you. You don't have what it takes.",
      "timestamp": "2025-08-11T21:34:13.112942"
    },
    {
      "text": "How do you know how to avoid a case? Where's going to be the best? Where's half of the...",
      "timestamp": "2025-08-11T21:34:19.562590"
    },
    {
      "text": "Winners wanna be the best. Winners have pride in being the best. Winners have...",
      "timestamp": "2025-08-11T21:34:42.943681"
    },
    {
      "text": "Pride and being the best. Winners have pride in being predominant.",
      "timestamp": "2025-08-11T21:34:47.679546"
    },
    {
      "text": "Pride is being dominant amongst their teammates.",
      "timestamp": "2025-08-11T21:34:51.802458"
    },
    {
      "text": "BUNK THEIR TEAMMATE! OOOH MAN ARE CREATING!",
      "timestamp": "2025-08-11T21:34:57.713751"
    },
    {
      "text": "All men are creating war, so just for part.",
      "timestamp": "2025-08-11T21:35:06.229420"
    },
    {
      "text": "So, just for a harder, you want to know what it takes to see if...",
      "timestamp": "2025-08-11T21:35:11.144909"
    },
    {
      "text": "You want to know what it takes to 16th and as bad as you want to free, it's what goes on.",
      "timestamp": "2025-08-11T21:35:16.413180"
    },
    {
      "text": "As you wanna freeze, it's what goes on when the cameras go off onward.",
      "timestamp": "2025-08-11T21:35:21.113369"
    },
    {
      "text": "When the cameras go off, onward, a termination, increase, you will",
      "timestamp": "2025-08-11T21:35:26.227419"
    },
    {
      "text": "I will get up",
      "timestamp": "2025-08-11T21:35:30.186136"
    },
    {
      "text": "I will get up earlier than you. I will go to sleep later than you.",
      "timestamp": "2025-08-11T21:35:35.121160"
    },
    {
      "text": "I will go to sleep later. I will put in more hours. I will.",
      "timestamp": "2025-08-11T21:35:39.752747"
    },
    {
      "text": "I will put it more, I will shoot you, I will read more to you, I will pay, I will do it-",
      "timestamp": "2025-08-11T21:35:45.096356"
    },
    {
      "text": "I will do whatever it takes. I do things that separate my-",
      "timestamp": "2025-08-11T21:35:49.522895"
    },
    {
      "text": "I do things that separate my stuff from this life. The past that I have, one of three...",
      "timestamp": "2025-08-11T21:35:55.211718"
    }
  ],
  "insights": {
    "insights": [
      "Unable to parse AI response - please try again"
    ]
  },
  "session_ended": "2025-08-11T21:35:57.074442"
}