{
  "transcript_parts": [
    {
      "text": "You have to credit the new...",
      "timestamp": "2025-09-08T15:35:01.139120"
    },
    {
      "text": "You have to credit the new Mahindra tower for making off roaders main stream.",
      "timestamp": "2025-09-08T15:35:05.793401"
    },
    {
      "text": "Mahindra Thair for making off-roaders main swing. Since its launch last year, over 17...",
      "timestamp": "2025-09-08T15:35:10.759222"
    },
    {
      "text": "Since its launch last year, over 75,000 people have put their money down on one.",
      "timestamp": "2025-09-08T15:35:15.369365"
    },
    {
      "text": "5,000 people have put their money down on one and that's a big big number. This new...",
      "timestamp": "2025-09-08T15:35:20.593096"
    },
    {
      "text": "And that's a big big number. This new foreign interest in off-roaders also plays into the hands.",
      "timestamp": "2025-09-08T15:35:25.562329"
    },
    {
      "text": "found interesting off-roaders also plays into the hands of force motors that have just come out with",
      "timestamp": "2025-09-08T15:35:30.385741"
    },
    {
      "text": "the first motors that have just come out with the new good cup. Over the course of today...",
      "timestamp": "2025-09-08T15:35:35.428067"
    },
    {
      "text": "new good cup. Over the course of today we'll test these two on road and off road and",
      "timestamp": "2025-09-08T15:35:40.541633"
    },
    {
      "text": "wheel test these two on-road and off-road and talk of aspects like comfort and practicality.",
      "timestamp": "2025-09-08T15:35:45.382420"
    },
    {
      "text": "dark of aspects like comfort and practicality and finally tell you which one makes the most sense for you.",
      "timestamp": "2025-09-08T15:35:50.340885"
    },
    {
      "text": "And finally tell you which one makes the most sense for you.",
      "timestamp": "2025-09-08T15:35:54.916286"
    },
    {
      "text": "you!",
      "timestamp": "2025-09-08T15:36:10.660628"
    },
    {
      "text": "You've seen the power in Gorka before so I'll keep the inter-",
      "timestamp": "2025-09-08T15:37:53.411742"
    },
    {
      "text": "You've seen the Thar in Gurka before so I'll keep the introductions short. Both models are hardy off-",
      "timestamp": "2025-09-08T15:37:58.395815"
    },
    {
      "text": "Both modules are hardy off-roaders that use tough ladder frame construction.",
      "timestamp": "2025-09-08T15:38:02.834490"
    },
    {
      "text": "that you stop ladder frame construction and get OVILTRIED. The new GURKUN",
      "timestamp": "2025-09-08T15:38:07.932672"
    },
    {
      "text": "and get a wheel drive. The new Gurkha that's just going on sale is for the moment at least.",
      "timestamp": "2025-09-08T15:38:12.966795"
    },
    {
      "text": "that just going on sale is for the moment at least only available in hard top format",
      "timestamp": "2025-09-08T15:38:17.775566"
    },
    {
      "text": "This only available in hard top format with diesel engine and manual gearbox.",
      "timestamp": "2025-09-08T15:38:22.340232"
    },
    {
      "text": "diesel engine and manual gearbox. For a like to like comparison, we bought the third inch",
      "timestamp": "2025-09-08T15:38:27.143284"
    },
    {
      "text": "For a like to like comparison we bother third in similar hard top diesel manual guys.",
      "timestamp": "2025-09-08T15:38:31.784162"
    },
    {
      "text": "similar hard top diesel manual guys. However, the tar is available in more variants.",
      "timestamp": "2025-09-08T15:38:36.510294"
    },
    {
      "text": "However, the tar is available in more variants with petrol and diesel engines both offered",
      "timestamp": "2025-09-08T15:38:41.075329"
    },
    {
      "text": "with petrol and diesel engines both offered with auto and manual gearboxes and there's",
      "timestamp": "2025-09-08T15:38:45.819584"
    },
    {
      "text": "auto and manual gearboxes and there's the option of a convertible top 2.",
      "timestamp": "2025-09-08T15:38:50.298238"
    },
    {
      "text": "the option of a convertible top 2.",
      "timestamp": "2025-09-08T15:38:54.368998"
    },
    {
      "text": "There's a lot of numbers coming at you over this video and I'll start",
      "timestamp": "2025-09-08T15:38:59.867375"
    },
    {
      "text": "numbers coming at you over this video and I'll start with basic dimensions and how they manifest",
      "timestamp": "2025-09-08T15:39:04.987804"
    },
    {
      "text": "with basic dimensions and how they manifest in the way these two look.",
      "timestamp": "2025-09-08T15:39:09.440825"
    },
    {
      "text": "in the way these two look.",
      "timestamp": "2025-09-08T15:39:13.743695"
    },
    {
      "text": "Since there has always been a test car effect them when Vielen Kar time resulted their cutscene away from the one I have seen on this commercial met up with some pets that would you know little food Box 2",
      "timestamp": "2025-09-08T15:39:35.549195"
    },
    {
      "text": "The Gurka is the longer model here but it's significantly higher.",
      "timestamp": "2025-09-08T15:39:40.312504"
    },
    {
      "text": "longer model here but it's the significantly higher roof that really makes it seem like the larger",
      "timestamp": "2025-09-08T15:39:45.064603"
    },
    {
      "text": "I really think that it really makes it seem like a larger vehicle. The optional roof rack only...",
      "timestamp": "2025-09-08T15:40:00.146237"
    },
    {
      "text": "vehicle. The optional roof rack only adds to the effect, though at the same time the",
      "timestamp": "2025-09-08T15:40:04.859956"
    },
    {
      "text": "as to be affected though at the same time the relatively small 16 inch rims also make the good",
      "timestamp": "2025-09-08T15:40:10.662853"
    },
    {
      "text": "of least 16 inch rims also make the Gurkha look a bit top heavy.",
      "timestamp": "2025-09-08T15:40:15.602216"
    },
    {
      "text": "Look at the new Gurdkha is all blocked like an angular.",
      "timestamp": "2025-09-08T15:40:20.008902"
    },
    {
      "text": "The new Gurkha is all blocked like an angular and like a G-Class for the masses.",
      "timestamp": "2025-09-08T15:40:24.860603"
    },
    {
      "text": "and like a G-Class for the masses, the front back plate and standard fit snorkel is",
      "timestamp": "2025-09-08T15:40:29.852614"
    },
    {
      "text": "front bash plate and standards with snorkel establish it at something serious while the full LED",
      "timestamp": "2025-09-08T15:40:34.836151"
    },
    {
      "text": "something serious while the full LED headlights and long single piece we have windows",
      "timestamp": "2025-09-08T15:40:39.544636"
    },
    {
      "text": "headlights and long single piece where windows are the details of no",
      "timestamp": "2025-09-08T15:40:43.954444"
    },
    {
      "text": "are the details of note. The shot lines are consistent and the Gurka also feels stuff.",
      "timestamp": "2025-09-08T15:40:48.807114"
    },
    {
      "text": "are consistent and the Gurka also feels tough when it's built.",
      "timestamp": "2025-09-08T15:40:53.401893"
    },
    {
      "text": "and it's built. The tar might be shorter in length.",
      "timestamp": "2025-09-08T15:40:57.911580"
    },
    {
      "text": "The tarp might be short in length and have the lower roof line but it's wider in its",
      "timestamp": "2025-09-08T15:41:02.859061"
    },
    {
      "text": "have the lower roof line but it's wider in its body as well as front and rear tracks.",
      "timestamp": "2025-09-08T15:41:08.007073"
    },
    {
      "text": "body as well as front and rear tracks as the longer wheelbase and in LX-3.",
      "timestamp": "2025-09-08T15:41:12.872183"
    },
    {
      "text": "has the longer wheelbase and in LX-Streme as featured here also writes on larger 8",
      "timestamp": "2025-09-08T15:41:17.778361"
    },
    {
      "text": "as featured here also writes on larger 18 inch rims all of which come together",
      "timestamp": "2025-09-08T15:41:22.553876"
    },
    {
      "text": "in inch rims. All of which come together to give the Mahindra almost show footed stance.",
      "timestamp": "2025-09-08T15:41:27.774859"
    },
    {
      "text": "give the Mahendra a more show footage stance. The tariff is undeniable.",
      "timestamp": "2025-09-08T15:41:32.722633"
    },
    {
      "text": "The tower is undeniably wangler like in its look. It looks...",
      "timestamp": "2025-09-08T15:41:38.016498"
    },
    {
      "text": "I believe Wrangler like in its look it looks chunky and tough and like the good car gives out a",
      "timestamp": "2025-09-08T15:41:43.119571"
    },
    {
      "text": "and like the good car, give out a don't mess with me, why not? Zoom in and",
      "timestamp": "2025-09-08T15:41:48.391802"
    },
    {
      "text": "Don't mess with me, why not? Zoom in and see and again you'll find exterior fit in-",
      "timestamp": "2025-09-08T15:41:53.473197"
    },
    {
      "text": "see and again you'll find exterior fit in finish is good which all throw that",
      "timestamp": "2025-09-08T15:41:58.297131"
    },
    {
      "text": "finish is good. Which of rotor do you prefer? Let us know in the comment section below and",
      "timestamp": "2025-09-08T15:42:03.187980"
    },
    {
      "text": "You prefer let us know in the comment section below and if you haven't already, please like the video, subscribe.",
      "timestamp": "2025-09-08T15:42:08.458595"
    },
    {
      "text": "And if you haven't already, please like the video, subscribe to the AutoCoin via channel and hit that bell icon.",
      "timestamp": "2025-09-08T15:42:13.784905"
    },
    {
      "text": "to the AutoCoin via channel and hit that bell icon.",
      "timestamp": "2025-09-08T15:42:18.410260"
    },
    {
      "text": "That's quite a difference in how these two are on the inside.",
      "timestamp": "2025-09-08T15:42:22.944698"
    },
    {
      "text": "There's quite a difference in how these two are on the inside and it starts with the manner you get in.",
      "timestamp": "2025-09-08T15:42:28.279114"
    },
    {
      "text": "and it starts with the manner you get in. It's a climb up into the good car and it's high set.",
      "timestamp": "2025-09-08T15:42:33.533845"
    },
    {
      "text": "It's a climb up into the Gurkha and it's high set cabin also requires use of the handle on the A",
      "timestamp": "2025-09-08T15:42:38.745417"
    },
    {
      "text": "The cabin also requires use of the handle on the A pillar to pull your self up.",
      "timestamp": "2025-09-08T15:42:43.566533"
    },
    {
      "text": "He'll be able to pull yourself up... Dad!",
      "timestamp": "2025-09-08T15:43:04.569650"
    },
    {
      "text": "That'd be a showing sound on Dorshan, 10 Views.",
      "timestamp": "2025-09-08T15:43:09.205421"
    },
    {
      "text": "We are showing sound on door shut tells you that you're sitting in something very tough and",
      "timestamp": "2025-09-08T15:43:13.903541"
    },
    {
      "text": "that you're sitting in something very tough and on the driver's seat you'll also feel like",
      "timestamp": "2025-09-08T15:43:18.679218"
    },
    {
      "text": "on the driver's seat you will also feel like the king of the road you start to very high up",
      "timestamp": "2025-09-08T15:43:23.722621"
    },
    {
      "text": "the king of the road. You start to very high up, in fact you're looking down at driver",
      "timestamp": "2025-09-08T15:43:28.775150"
    },
    {
      "text": "In fact, you're looking down at drivers in the fortunas. The seating position is also...",
      "timestamp": "2025-09-08T15:43:34.080718"
    },
    {
      "text": "in their fortunes. The seating position is also very accommodating thanks to a wide foot.",
      "timestamp": "2025-09-08T15:43:39.733806"
    },
    {
      "text": "very accommodating thanks to a wide footwell and the seats themselves are also",
      "timestamp": "2025-09-08T15:43:44.951465"
    },
    {
      "text": "and the seats themselves are also nice and large.",
      "timestamp": "2025-09-08T15:43:49.165360"
    },
    {
      "text": "nice and large. Though a bit limited in range, there's still 10 cells.",
      "timestamp": "2025-09-08T15:43:54.163455"
    },
    {
      "text": "bit limited in range if there is still 10 telescope I could just for the steering too.",
      "timestamp": "2025-09-08T15:43:58.936604"
    },
    {
      "text": "go pick a just for the steering too. There's no seat height adjust though and what's disappointing is",
      "timestamp": "2025-09-08T15:44:03.081774"
    },
    {
      "text": "It's a bit high to adjust though and what's disappointing is that there's no far adjust for the mirrors work.",
      "timestamp": "2025-09-08T15:44:08.311364"
    },
    {
      "text": "that there's no power adjust for the mirrors. Even the tire pressure monitor seems like an option.",
      "timestamp": "2025-09-08T15:44:13.373413"
    },
    {
      "text": "Even the tire pressure monitor seems like an afterthought. The dials also look basic and...",
      "timestamp": "2025-09-08T15:44:19.026687"
    },
    {
      "text": "the dials also look basic and that's something you can say about the dashboard as well.",
      "timestamp": "2025-09-08T15:44:24.083266"
    },
    {
      "text": "that's something you can see about the dashboard as well. The good cause dashboard is",
      "timestamp": "2025-09-08T15:44:29.033648"
    },
    {
      "text": "The good cars dashboard is quite straightforward and looks and does and looks fine.",
      "timestamp": "2025-09-08T15:44:33.539540"
    },
    {
      "text": "is quite straightforward and look and does not look fancy. The fitting finish is also made in...",
      "timestamp": "2025-09-08T15:44:41.049299"
    },
    {
      "text": "15th finish is also mediocre at best you will find uneven",
      "timestamp": "2025-09-08T15:44:45.464852"
    },
    {
      "text": "you will find uneven panel gaps and the",
      "timestamp": "2025-09-08T15:44:49.990010"
    },
    {
      "text": "and the plastic are all hard and when you",
      "timestamp": "2025-09-08T15:44:54.115439"
    },
    {
      "text": "plastics are all hard and when you really live with the good guy you'll also find that things",
      "timestamp": "2025-09-08T15:44:59.360603"
    },
    {
      "text": "really live with the good car you'll also find that things like the aircon controls feel quite rudimentary in all.",
      "timestamp": "2025-09-08T15:45:04.726657"
    },
    {
      "text": "like the air con controls feel quite rudimentary in operation. The Kenwood touch screen is final.",
      "timestamp": "2025-09-08T15:45:10.298259"
    },
    {
      "text": "The Kenwood Touchscreen is fine on usability and gets the job done offering and",
      "timestamp": "2025-09-08T15:45:14.263800"
    },
    {
      "text": "usability and gets the job done offering Android Auto and Apple Carflaves.",
      "timestamp": "2025-09-08T15:45:18.907235"
    },
    {
      "text": "Android Auto and Apple CarPlay. The cabin gets 4 USB slots, the wide center console.",
      "timestamp": "2025-09-08T15:45:24.061893"
    },
    {
      "text": "gets 4 USB slots, the wide center console offers space for small items and there is a",
      "timestamp": "2025-09-08T15:45:28.843651"
    },
    {
      "text": "console offers space for small items and there is a usable glovebox too.",
      "timestamp": "2025-09-08T15:45:34.260389"
    },
    {
      "text": "usable glovebox tube. Shifting into the thars.",
      "timestamp": "2025-09-08T15:45:39.253021"
    },
    {
      "text": "Shifting into the tar. First things first it's not as much of a climb.",
      "timestamp": "2025-09-08T15:45:45.224467"
    },
    {
      "text": "First things first it's not as much of a climb into its cabin",
      "timestamp": "2025-09-08T15:45:50.587775"
    },
    {
      "text": "into its cabin.",
      "timestamp": "2025-09-08T15:45:55.525434"
    },
    {
      "text": "the main guilty the main 생각을 is thee",
      "timestamp": "2025-09-08T15:46:14.729476"
    },
    {
      "text": "The main dothar is the easier off-roader to get into but after",
      "timestamp": "2025-09-08T15:46:19.563348"
    },
    {
      "text": "easier off-roader to get into but after you've spent time in a good car you'll find the tilesca-",
      "timestamp": "2025-09-08T15:46:24.859239"
    },
    {
      "text": "you've spent time in a good car you'll find the tiles cabin a lot more compact you'll find yourself sitting",
      "timestamp": "2025-09-08T15:46:30.807974"
    },
    {
      "text": "been a lot more compact you'll find yourself sitting closer to your copast ginger and this",
      "timestamp": "2025-09-08T15:46:35.826367"
    },
    {
      "text": "closer to your copacinja and this blacked out roof also reduces the",
      "timestamp": "2025-09-08T15:46:40.679886"
    },
    {
      "text": "The blacked out roof also reduces the sense of space inside the cabin to an extent.",
      "timestamp": "2025-09-08T15:46:46.337341"
    },
    {
      "text": "sense of space inside the cabin to an extent. After having spent time in a good car, there are...",
      "timestamp": "2025-09-08T15:46:51.771008"
    },
    {
      "text": "After having spent time in a good car, there are other things that come through as well.",
      "timestamp": "2025-09-08T15:46:55.827329"
    },
    {
      "text": "other things that come through as well. The task from seats aren't quite as generous as the ones that",
      "timestamp": "2025-09-08T15:47:01.014707"
    },
    {
      "text": "from seats aren't quite as generous as the ones that you get in the Gurka but to the",
      "timestamp": "2025-09-08T15:47:09.001125"
    },
    {
      "text": "you get in the good car but to the top slanted you do get a driver's seat heighter just",
      "timestamp": "2025-09-08T15:47:14.773935"
    },
    {
      "text": "do get a driver's seat height adjust. A problem for me is that the touch for 12 is",
      "timestamp": "2025-09-08T15:47:19.654930"
    },
    {
      "text": "The problem for me is that the touch for 12 isn't all that wide and doesn't leave any",
      "timestamp": "2025-09-08T15:47:24.840707"
    },
    {
      "text": "and all that white and doesn't leave any space to rest your left foot. But in over",
      "timestamp": "2025-09-08T15:47:29.990888"
    },
    {
      "text": "to rest your left foot. But in overall look and feel the thar scabbing is far",
      "timestamp": "2025-09-08T15:47:35.772635"
    },
    {
      "text": "or look and feel the thaw's cabin is far nicer. The thaw's interior is",
      "timestamp": "2025-09-08T15:47:40.804953"
    },
    {
      "text": "nicer. The thought of the interior is significantly better on quality with a nicer",
      "timestamp": "2025-09-08T15:47:45.468412"
    },
    {
      "text": "significantly better on quality with nicer plastics used all around. It's also more",
      "timestamp": "2025-09-08T15:47:50.170621"
    },
    {
      "text": "plastics used all around. It's also more interesting in look and it's got unique elements",
      "timestamp": "2025-09-08T15:47:55.133578"
    },
    {
      "text": "interesting in look and it's got unique elements like carbon fiber of evening at the",
      "timestamp": "2025-09-08T15:48:00.042674"
    },
    {
      "text": "like carbon fiber of evening at the aircon meant and it's like...",
      "timestamp": "2025-09-08T15:48:04.881146"
    },
    {
      "text": "and it's black that tells you that it's been made in",
      "timestamp": "2025-09-08T15:48:09.621082"
    },
    {
      "text": "that tells you that it's been made in India with pride.",
      "timestamp": "2025-09-08T15:48:14.399387"
    },
    {
      "text": "in India with pride.",
      "timestamp": "2025-09-08T15:48:18.744272"
    },
    {
      "text": "On paper the tire offers a bit more than the Gurkhab",
      "timestamp": "2025-09-08T15:48:24.012355"
    },
    {
      "text": "The tar offers a bit more than the Gurkha but the execution is a lot better.",
      "timestamp": "2025-09-08T15:48:28.151322"
    },
    {
      "text": "But the execution is a lot better on the Mahindra.",
      "timestamp": "2025-09-08T15:48:32.760566"
    },
    {
      "text": "on the Mahindra. For instance, the tide is also...",
      "timestamp": "2025-09-08T15:48:37.474668"
    },
    {
      "text": "For instance, the Thad is also the only one that steering mounted controls and it's",
      "timestamp": "2025-09-08T15:48:42.924064"
    },
    {
      "text": "the only one that is steering mounted controls and in general the quality of switches is superior",
      "timestamp": "2025-09-08T15:48:47.552600"
    },
    {
      "text": "general the quality of switches is superior too. Also nicer is the touch screen that",
      "timestamp": "2025-09-08T15:48:52.190751"
    },
    {
      "text": "Also nicer is the touch screen that also packs in off-road data. The power off...",
      "timestamp": "2025-09-08T15:48:57.403096"
    },
    {
      "text": "also packed in off-road data. The tar also has the smarter dials and more informative M&M",
      "timestamp": "2025-09-08T15:49:03.490541"
    },
    {
      "text": "also has the smarter dials and more informative MID with nice graphics for the four wheel drive.",
      "timestamp": "2025-09-08T15:49:08.699045"
    },
    {
      "text": "with nice graphics for the four wheel drags functions and it handy also features a",
      "timestamp": "2025-09-08T15:49:13.561377"
    },
    {
      "text": "functions and it handily also features a display first-earing angle.",
      "timestamp": "2025-09-08T15:49:18.297993"
    },
    {
      "text": "play first hearing angle. In terms of practicality the third gets you dough pockets and cup",
      "timestamp": "2025-09-08T15:49:24.030106"
    },
    {
      "text": "The third gets you dough pockets and cup holders between the seats but the glove box is",
      "timestamp": "2025-09-08T15:49:29.026267"
    },
    {
      "text": "the seat but the glove box is tiny. Shifting foot.",
      "timestamp": "2025-09-08T15:49:32.988199"
    },
    {
      "text": "is tiny. Shifting focus to the back seat. Getting into an hour.",
      "timestamp": "2025-09-08T15:49:37.760012"
    },
    {
      "text": "to the back seats, getting into and out of the third second row is tricky business.",
      "timestamp": "2025-09-08T15:49:42.820898"
    },
    {
      "text": "of the third second row is tricky business you have to enter from the front passenger side and",
      "timestamp": "2025-09-08T15:49:47.815179"
    },
    {
      "text": "You have to enter from the front passenger side and even with the seats lit all the way forward.",
      "timestamp": "2025-09-08T15:49:52.828444"
    },
    {
      "text": "even with the seats lit all the way forward the opening isn't large enough for full size setup.",
      "timestamp": "2025-09-08T15:49:57.965849"
    },
    {
      "text": "The opening isn't large enough for full size adults to get through with ease. Comfort isn't a big deal.",
      "timestamp": "2025-09-08T15:50:03.528316"
    },
    {
      "text": "to get through with these comfort isn't the best either. Now, you",
      "timestamp": "2025-09-08T15:50:08.778374"
    },
    {
      "text": "best either. Now you will have to choose carefully who gets to sit.",
      "timestamp": "2025-09-08T15:50:14.318833"
    },
    {
      "text": "you will have to choose carefully who gets to sit at the back because once you're inside you'll know that",
      "timestamp": "2025-09-08T15:50:19.675139"
    },
    {
      "text": "at the back because once you're inside you'll know that quite a bit of space is taken by the wheel wells at the",
      "timestamp": "2025-09-08T15:50:25.461609"
    },
    {
      "text": "quite a bit of space is taken by the wheel wells at the side and you're actually sitting shoulder to shoulder with",
      "timestamp": "2025-09-08T15:50:30.774564"
    },
    {
      "text": "and you're actually sitting shoulder to shoulder with the OCO passenger. You do have the option",
      "timestamp": "2025-09-08T15:50:35.833390"
    },
    {
      "text": "the OCO passenger. You do have the option to adjust the backrest recline to your",
      "timestamp": "2025-09-08T15:50:41.194631"
    },
    {
      "text": "to adjust the backrests recline to your liking but the seating position is",
      "timestamp": "2025-09-08T15:50:46.064018"
    },
    {
      "text": "but the seating position is quite knees up and there's not all that much space.",
      "timestamp": "2025-09-08T15:50:51.058588"
    },
    {
      "text": "when he is up and there is not all that much space for your feet, your right foot.",
      "timestamp": "2025-09-08T15:50:56.325552"
    },
    {
      "text": "for your feet, your right foot will fall with the rails for the",
      "timestamp": "2025-09-08T15:51:02.097220"
    },
    {
      "text": "will found with the rails for the front seat adjustment. On the plus side, the",
      "timestamp": "2025-09-08T15:51:07.118893"
    },
    {
      "text": "transit adjustment. On the plus side the third does get proper.",
      "timestamp": "2025-09-08T15:51:11.801947"
    },
    {
      "text": "The part does get proper 3.8 bells at the back.",
      "timestamp": "2025-09-08T15:51:16.454967"
    },
    {
      "text": "3.8B at the back. In a good car you enter from...",
      "timestamp": "2025-09-08T15:51:22.122947"
    },
    {
      "text": "In a good car you enter from the tailgate. It's a big step up but the...",
      "timestamp": "2025-09-08T15:51:27.514360"
    },
    {
      "text": "tailgate. It's a big step up but the passage between the seats makes entry to the rear seat.",
      "timestamp": "2025-09-08T15:51:32.786305"
    },
    {
      "text": "between the seats makes entry to the rear seats far easier.",
      "timestamp": "2025-09-08T15:51:41.343423"
    },
    {
      "text": "It's far easier.",
      "timestamp": "2025-09-08T15:51:45.898400"
    },
    {
      "text": "Now as you can tell the force of good car offer",
      "timestamp": "2025-09-08T15:51:50.442481"
    },
    {
      "text": "Now as you can tell the Force Good Car offers very easy access to the back row seat.",
      "timestamp": "2025-09-08T15:51:55.618674"
    },
    {
      "text": "as easy access to the back row seats. Now once you're inside, you'll also",
      "timestamp": "2025-09-08T15:52:00.879718"
    },
    {
      "text": "Once you're inside you'll also notice that since you're not sitting",
      "timestamp": "2025-09-08T15:52:06.256318"
    },
    {
      "text": "notice that since you are not sitting beside the wheel arches but on top of them you have",
      "timestamp": "2025-09-08T15:52:10.503626"
    },
    {
      "text": "side the wheel arches but on top of them you have a lot more space at your disposal.",
      "timestamp": "2025-09-08T15:52:15.646048"
    },
    {
      "text": "lot more space at your disposal. There is a generous amount of headroom even for",
      "timestamp": "2025-09-08T15:52:21.289636"
    },
    {
      "text": "There's a generous amount of headroom even for someone of my height. I'm just under six feet tall",
      "timestamp": "2025-09-08T15:52:26.550867"
    },
    {
      "text": "someone of my height I'm just under six feet tall there's a good amount of near room I have space",
      "timestamp": "2025-09-08T15:52:32.170751"
    },
    {
      "text": "There's a good amount of near room I have space to tuck my feet under the front seats.",
      "timestamp": "2025-09-08T15:52:37.296345"
    },
    {
      "text": "to tuck my feet under the front seat and there's also plenty of space to my",
      "timestamp": "2025-09-08T15:52:42.349128"
    },
    {
      "text": "there's also plenty of space to my fellow passenger. I also like that the window",
      "timestamp": "2025-09-08T15:52:47.232206"
    },
    {
      "text": "I also like that the windows are really large they give you this hole",
      "timestamp": "2025-09-08T15:52:52.414743"
    },
    {
      "text": "that really large they give you this whole safari car kind of vibe not all",
      "timestamp": "2025-09-08T15:52:58.198030"
    },
    {
      "text": "Safari car kind of vibe. Not all the passengers will find themselves",
      "timestamp": "2025-09-08T15:53:02.976679"
    },
    {
      "text": "passengers will find themselves looking at the top of the window but you can",
      "timestamp": "2025-09-08T15:53:07.787880"
    },
    {
      "text": "looking at the top of the window but you can recline the backrest to your liking.",
      "timestamp": "2025-09-08T15:53:12.983301"
    },
    {
      "text": "and recline the backrest to your liking. You also get adjustable.",
      "timestamp": "2025-09-08T15:53:18.143857"
    },
    {
      "text": "you also get adjustable armrest which is something you don't get on",
      "timestamp": "2025-09-08T15:53:22.131840"
    },
    {
      "text": "I'm blessed with something you don't get on the third",
      "timestamp": "2025-09-08T15:53:26.882366"
    },
    {
      "text": "the third. Biburka also offers more room for luggage but you'll have",
      "timestamp": "2025-09-08T15:53:32.744064"
    },
    {
      "text": "So offers more room for luggage but you'll have to position your baggage cleverly to leave enough",
      "timestamp": "2025-09-08T15:53:38.009082"
    },
    {
      "text": "position your baggage cleverly to leave enough room for your passengers to get out.",
      "timestamp": "2025-09-08T15:53:43.505958"
    },
    {
      "text": "room for years we are passengers to get out. Notably the good house front passenger seat doesn't...",
      "timestamp": "2025-09-08T15:53:47.929607"
    },
    {
      "text": "Notably the good-touch front passenger seat doesn't slide all the way forward as on the",
      "timestamp": "2025-09-08T15:53:55.492856"
    },
    {
      "text": "slide all the way forward as on the third.",
      "timestamp": "2025-09-08T15:53:59.832821"
    },
    {
      "text": "On the turn the side hinge still hit and coppings to win",
      "timestamp": "2025-09-08T15:54:04.563506"
    },
    {
      "text": "the side hinge tailgate and cop hinged windscreen open to reveal a smaller luggage area.",
      "timestamp": "2025-09-08T15:54:09.502289"
    },
    {
      "text": "and scream open to reveal a smaller luggage area.",
      "timestamp": "2025-09-08T15:54:14.856476"
    },
    {
      "text": "now focus workplace the post is UC dozens",
      "timestamp": "2025-09-08T15:54:33.734621"
    },
    {
      "text": "The parts we have seen backwards do split and fold to free up more room.",
      "timestamp": "2025-09-08T15:54:38.645898"
    },
    {
      "text": "Let's let him fall to free up more room.",
      "timestamp": "2025-09-08T15:54:43.261304"
    },
    {
      "text": "Now on to what you find at the other end.",
      "timestamp": "2025-09-08T15:54:48.358255"
    },
    {
      "text": "Now on to what you find at the other end of these vehicles. A quick spec check will tell you",
      "timestamp": "2025-09-08T15:54:54.269990"
    },
    {
      "text": "of these vehicles. A quick spec check will tell you that the good car with the 2.6 liter diesel",
      "timestamp": "2025-09-08T15:54:59.429094"
    },
    {
      "text": "The good car with a 2.6 liter diesel unit has the larger engine but it's 91%",
      "timestamp": "2025-09-08T15:55:05.002916"
    },
    {
      "text": "it has the larger engine but it's 91hp and 250 Nm on",
      "timestamp": "2025-09-08T15:55:10.577014"
    },
    {
      "text": "1HP and 250 Newton meters aren't a match for the Miendras 2.2L M",
      "timestamp": "2025-09-08T15:55:15.926478"
    },
    {
      "text": "a match for the main draws 2.2 litre Mhocs 130 HP and 3.",
      "timestamp": "2025-09-08T15:55:20.364046"
    },
    {
      "text": "HMHUX 130HP and 300 Nm figures factor in",
      "timestamp": "2025-09-08T15:55:25.275883"
    },
    {
      "text": "100 newton meter figures factor in their weights and the gap grows further.",
      "timestamp": "2025-09-08T15:55:30.651266"
    },
    {
      "text": "the weights and the gap grows further. The Mahindra also goes one up literally so...",
      "timestamp": "2025-09-08T15:55:36.670920"
    },
    {
      "text": "The Mahindra also goes one up literally so with this six-speed transmission.",
      "timestamp": "2025-09-08T15:55:41.782885"
    },
    {
      "text": "with this six-speed transmission.",
      "timestamp": "2025-09-08T15:55:46.166597"
    },
    {
      "text": "What?!",
      "timestamp": "2025-09-08T15:56:03.582826"
    },
    {
      "text": "But what are they like on the road? First up in the...",
      "timestamp": "2025-09-08T15:56:09.267551"
    },
    {
      "text": "What are they like on the road? First up in the Gurka. The Gurka has the...",
      "timestamp": "2025-09-08T15:56:15.475220"
    },
    {
      "text": "The Gurka has the larger engine but it's down on power and torque.",
      "timestamp": "2025-09-08T15:56:21.088894"
    },
    {
      "text": "engine but it's down on part and talk and it's also a fair bit have you",
      "timestamp": "2025-09-08T15:56:25.990582"
    },
    {
      "text": "and it's also a fair bit heavier and you can feel as much on the go.",
      "timestamp": "2025-09-08T15:56:31.094907"
    },
    {
      "text": "you can feel as much on the go. A low city space performance is adequate but...",
      "timestamp": "2025-09-08T15:56:36.378860"
    },
    {
      "text": "Hello city space performance is adequate but on the open road you'll find",
      "timestamp": "2025-09-08T15:56:42.971906"
    },
    {
      "text": "on the open road you'll find the build speed very slow and",
      "timestamp": "2025-09-08T15:56:48.502675"
    },
    {
      "text": "The build is very slow and almost lit project.",
      "timestamp": "2025-09-08T15:56:52.816509"
    },
    {
      "text": "almostх for rats Major",
      "timestamp": "2025-09-08T15:57:10.741049"
    },
    {
      "text": "It takes the time to get up to speed and...",
      "timestamp": "2025-09-08T15:57:15.508627"
    },
    {
      "text": "time to get up to speed and we go with the kings of the",
      "timestamp": "2025-09-08T15:57:21.074324"
    },
    {
      "text": "and we go with taking some unnot what the Gurkha likes to do.",
      "timestamp": "2025-09-08T15:57:25.156259"
    },
    {
      "text": "What the good call likes to do? The two points say...",
      "timestamp": "2025-09-08T15:57:30.021627"
    },
    {
      "text": "The 2.6 engine is shared with forces commercial vehicles.",
      "timestamp": "2025-09-08T15:57:34.007250"
    },
    {
      "text": "engine is shared with forces commercial vehicles and that partly explains why it delivers",
      "timestamp": "2025-09-08T15:57:39.040867"
    }
  ],
  "insights": {
    "insights": [
      "The new Mahindra Thar has made off-roaders mainstream, with over 75,000 people putting their money down on one since its launch last year.",
      "The Gurkha has a more angular and rugged design, while the Thar has a more rounded and Wrangler-like appearance.",
      "The Thar has a more spacious interior, with a wider footwell and larger seats, but the Gurkha has a more premium feel with nicer plastics and unique elements.",
      "The Thar has a more practical rear seat, with easier access and more space for passengers and luggage, but the Gurkha has a more generous amount of headroom and legroom.",
      "The Mahindra Thar has a more powerful engine, with 130 HP and 300 Nm, compared to the Gurkha's 91 HP and 250 Nm, but the Gurkha's engine is shared with Force's commercial vehicles.",
      "The Thar has a more comfortable ride on the open road, but the Gurkha is better suited for off-road driving and has a more rugged design.",
      "The Gurkha has a more advanced infotainment system, with a Kenwood touchscreen and steering-mounted controls, but the Thar has a more user-friendly interface and better connectivity options.",
      "The Thar has a more spacious cargo area, with a larger luggage compartment and more room for passengers, but the Gurkha has a more premium feel and nicer plastics."
    ]
  },
  "session_ended": "2025-09-08T15:57:40.717160"
}