{
  "transcript_parts": [
    {
      "text": "How many of you in the honestly?",
      "timestamp": "2025-08-11T21:57:05.708448"
    },
    {
      "text": "How many of you can honestly look yourself in the mirror?",
      "timestamp": "2025-08-11T21:57:10.880933"
    },
    {
      "text": "Look yourself in the mirror and say I am doing my best.",
      "timestamp": "2025-08-11T21:57:15.096163"
    },
    {
      "text": "and say I am doing like that. Because if you can,",
      "timestamp": "2025-08-11T21:57:18.720754"
    },
    {
      "text": "Because if you can, you're fucking lying to yourself.",
      "timestamp": "2025-08-11T21:57:22.111169"
    },
    {
      "text": "You're freaking lying to yourself. Your job right now! And how...",
      "timestamp": "2025-08-11T21:57:27.602139"
    },
    {
      "text": "Your job right now, and how you execute that job is...",
      "timestamp": "2025-08-11T21:57:33.055211"
    },
    {
      "text": "execute that job is going to create the success",
      "timestamp": "2025-08-11T21:57:37.533484"
    },
    {
      "text": "going to create the success habits that you're going to need down the",
      "timestamp": "2025-08-11T21:57:42.953378"
    },
    {
      "text": "that you're going to need down the road. How you do one thing.",
      "timestamp": "2025-08-11T21:57:47.806349"
    },
    {
      "text": "how you do one thing is how you do everything just make it",
      "timestamp": "2025-08-11T21:57:53.058849"
    },
    {
      "text": "is how you do everything. Just making fries, if you ain't making the best motherf***ing fries, everybody-",
      "timestamp": "2025-08-11T21:57:58.847914"
    },
    {
      "text": "If you ain't making the best motherf***ing prize every f***ing time, guess what? You ain't gonna f***ing make-",
      "timestamp": "2025-08-11T21:58:04.514280"
    },
    {
      "text": "time. Guess what? You ain't gonna fucking make it. If you can't sweep the warehouse floor better than",
      "timestamp": "2025-08-11T21:58:09.809190"
    },
    {
      "text": "If you can't sweep the warehouse floor better than the next guy you ain't gonna fucking make it because you're",
      "timestamp": "2025-08-11T21:58:15.842063"
    },
    {
      "text": "You ain't gonna fucking make it because here's the truth. Losers always talk-",
      "timestamp": "2025-08-11T21:58:21.020905"
    },
    {
      "text": "The trip losers always talk about how they hate to lose but they don't do any",
      "timestamp": "2025-08-11T21:58:25.758220"
    },
    {
      "text": "about how they hate to lose, but they don't do anything about it. But you know what winners do?",
      "timestamp": "2025-08-11T21:58:31.049724"
    },
    {
      "text": "about it. But you know what winners do? Winners will do whatever the fuck it takes.",
      "timestamp": "2025-08-11T21:58:35.860513"
    },
    {
      "text": "Winners will do whatever the f**k it takes. Winners will show up in stay late.",
      "timestamp": "2025-08-11T21:58:40.888330"
    },
    {
      "text": "The first world will show up in Staley every fucking day until they're winning.",
      "timestamp": "2025-08-11T21:58:45.634985"
    },
    {
      "text": "Every fucking day until they're winning winners will talk to anybody that can",
      "timestamp": "2025-08-11T21:58:50.721650"
    },
    {
      "text": "Winners will talk to anybody that can, that can help them and take the lessons of...",
      "timestamp": "2025-08-11T21:58:55.625837"
    },
    {
      "text": "They can help them and take the lessons to heart and put them in play that's for when",
      "timestamp": "2025-08-11T21:59:00.782090"
    },
    {
      "text": "heart and put them in play that's what winners do. Losers talk about hating them.",
      "timestamp": "2025-08-11T21:59:05.664970"
    },
    {
      "text": "Losers talk about hating the loser. Losers say any clues. Losers.",
      "timestamp": "2025-08-11T21:59:10.253214"
    },
    {
      "text": "Losers say they need to lose. Losers can talk about how they want to win. Where's the",
      "timestamp": "2025-08-11T21:59:15.452260"
    },
    {
      "text": "and talk about how they won a win. Where's the fucking takes? And that means beating the next-",
      "timestamp": "2025-08-11T21:59:20.688022"
    },
    {
      "text": "That means beating the next guy. If you are going to work at your job.",
      "timestamp": "2025-08-11T21:59:25.513428"
    },
    {
      "text": "If you are going to work at your job every day and look at all the other mother",
      "timestamp": "2025-08-11T21:59:30.350854"
    },
    {
      "text": "Every day and look at all the other mother's",
      "timestamp": "2025-08-11T21:59:34.628047"
    },
    {
      "text": "I'm gonna be the sure that I'll do you you don't have to take",
      "timestamp": "2025-08-11T21:59:39.533571"
    },
    {
      "text": "You'll have to take it. Where's going to be the best? Where's half a tribe in the...",
      "timestamp": "2025-08-11T21:59:44.996030"
    },
    {
      "text": "We're gonna be the best. We're just having pride in being the best. We're just having pride.",
      "timestamp": "2025-08-11T21:59:50.481400"
    },
    {
      "text": "being the best. Winners have pride in being dominant amongst their",
      "timestamp": "2025-08-11T21:59:55.144555"
    },
    {
      "text": "and being dominant amongst their teammates.",
      "timestamp": "2025-08-11T21:59:59.284704"
    },
    {
      "text": "all men are creating war",
      "timestamp": "2025-08-11T22:00:04.217563"
    },
    {
      "text": "All men are creating war. Sons of poor heart! You want to know?",
      "timestamp": "2025-08-11T22:00:09.079302"
    },
    {
      "text": "Don't just work harder. You want to know what it takes into 60 and it's bad you want to-",
      "timestamp": "2025-08-11T22:00:14.213086"
    },
    {
      "text": "when it takes 60 and bad you want to free it's what goes on when it counts.",
      "timestamp": "2025-08-11T22:00:19.940889"
    },
    {
      "text": "3 it's what goes on when the cameras go on",
      "timestamp": "2025-08-11T22:00:24.421407"
    }
  ],
  "insights": {
    "insights": [
      "Unable to parse AI response - please try again"
    ]
  },
  "session_ended": "2025-08-11T22:00:51.268360"
}