{
  "transcript_parts": [
    {
      "text": "Washington Monument Jefferson Memorial Lincoln Memorial, Statue of Liberty and Out West.",
      "timestamp": "2025-08-12T12:01:36.128268"
    },
    {
      "text": "Statue of Liberty and Out West, the Presidio and the Golden Gate area.",
      "timestamp": "2025-08-12T12:01:38.949954"
    },
    {
      "text": "for the city and the Golden Gate area. These folks have intendsability.",
      "timestamp": "2025-08-12T12:01:41.770859"
    },
    {
      "text": "These folks have tens of millions of visitors a year, the kind of people that President Trump's",
      "timestamp": "2025-08-12T12:01:44.670017"
    },
    {
      "text": "of visitors a year, the kind of people that President Trump's talking about that come from around the country and around the world.",
      "timestamp": "2025-08-12T12:01:47.623058"
    },
    {
      "text": "talking about that come from around the country and around the world to see our secret",
      "timestamp": "2025-08-12T12:01:53.943000"
    },
    {
      "text": "world to see our sacred and learn about our history and our sacred monuments.",
      "timestamp": "2025-08-12T12:01:58.110482"
    },
    {
      "text": "and learn about our history and our sacred monuments. They've been doing a fantastic",
      "timestamp": "2025-08-12T12:02:02.293750"
    },
    {
      "text": "They've been doing a fantastic job, but they are so pleased the rank and file the present.",
      "timestamp": "2025-08-12T12:02:06.515257"
    },
    {
      "text": "but they are so pleased the rank and file the present Trump is now allowing them to enforce the law.",
      "timestamp": "2025-08-12T12:02:11.007409"
    },
    {
      "text": "and Trump is now allowing them to enforce the law. As those of you that live in the city may know,",
      "timestamp": "2025-08-12T12:02:15.558116"
    },
    {
      "text": "As those you that live in the city may know that the the circles in the triangle part",
      "timestamp": "2025-08-12T12:02:19.906475"
    },
    {
      "text": "the circles and the triangle parks that are spread throughout DC are actually",
      "timestamp": "2025-08-12T12:02:23.882792"
    },
    {
      "text": "that are spread throughout DC are actually federal park property. So the US park",
      "timestamp": "2025-08-12T12:02:28.062000"
    },
    {
      "text": "federal park property so the US Park police also have responsibility for that.",
      "timestamp": "2025-08-12T12:02:32.490276"
    },
    {
      "text": "police all-strell responsibility for that. These became littered with homeless cams.",
      "timestamp": "2025-08-12T12:02:36.898402"
    },
    {
      "text": "These became littered with homeless camps under the Biden administration. All of you saw that.",
      "timestamp": "2025-08-12T12:02:41.311195"
    },
    {
      "text": "Senator DeBite, administration, all of you saw that. Since President Trump's executive order",
      "timestamp": "2025-08-12T12:02:47.621471"
    },
    {
      "text": "since President Trump's executive order on March 27th making DC.",
      "timestamp": "2025-08-12T12:02:51.771730"
    },
    {
      "text": "March 27th making DC safe and beautiful again the US Park police",
      "timestamp": "2025-08-12T12:02:56.127451"
    },
    {
      "text": "safe and beautiful again the US Park Police removed over 70 homeless camps and",
      "timestamp": "2025-08-12T12:03:00.293476"
    },
    {
      "text": "moved over 70 homeless camps and President Trump also talked about beautification.",
      "timestamp": "2025-08-12T12:03:04.688950"
    },
    {
      "text": "President Trump also talked about beautification. They're stopping the in and forth.",
      "timestamp": "2025-08-12T12:03:09.192563"
    },
    {
      "text": "They're stopping the in enforcing the laws against her feed on our monuments. They've",
      "timestamp": "2025-08-12T12:03:13.625828"
    },
    {
      "text": "I've seen the laws against graffiti on our monuments. They've removed over 80 specific attacks.",
      "timestamp": "2025-08-12T12:03:17.980780"
    },
    {
      "text": "removed over 80 specific attacks against our history with graffiti on the",
      "timestamp": "2025-08-12T12:03:22.078345"
    },
    {
      "text": "against our history with graffiti on our monuments. So they continue to do a great job, whether it's",
      "timestamp": "2025-08-12T12:03:26.446569"
    },
    {
      "text": "our monuments so they continue to do a great job whether it's in their vehicles on foot or on the mountain police.",
      "timestamp": "2025-08-12T12:03:31.207857"
    },
    {
      "text": "in their vehicles on foot or on the mountain police that you see around the National Mall and President Trump.",
      "timestamp": "2025-08-12T12:03:36.059570"
    },
    {
      "text": "you see around the National Mall and President Trump say thank you the rank and file is so happy to be in",
      "timestamp": "2025-08-12T12:03:40.656942"
    },
    {
      "text": "They thank you, the rank and file is so happy to be enforcing the log in. Thank you for your leadership.",
      "timestamp": "2025-08-12T12:03:45.604810"
    },
    {
      "text": "and thank you for your leadership and they're excited about the announcement.",
      "timestamp": "2025-08-12T12:03:49.728793"
    },
    {
      "text": "and they're excited about the announcements you're making today. Thank you very, very good. Great job, you're doing it. Thank you.",
      "timestamp": "2025-08-12T12:03:55.484924"
    },
    {
      "text": "Thank you very much.",
      "timestamp": "2025-08-12T12:03:59.200375"
    },
    {
      "text": "very much. Could you say something about the military?",
      "timestamp": "2025-08-12T12:04:03.260369"
    },
    {
      "text": "the military, the military. Well, Mr. President, it's an honor to be here.",
      "timestamp": "2025-08-12T12:04:08.067961"
    },
    {
      "text": "Mr. President, it's an honor to be here and add your direction this morning.",
      "timestamp": "2025-08-12T12:04:12.787077"
    },
    {
      "text": "And at your directions this morning, we've mobilized the DC National Guard. It'll be operational.",
      "timestamp": "2025-08-12T12:04:17.699104"
    },
    {
      "text": "We've mobilized the DC National Guard. It'll be operationalized by the Secretary of the Army and risk through",
      "timestamp": "2025-08-12T12:04:22.502122"
    },
    {
      "text": "lines by the Secretary of the Army and risk through the DC Guard. You will see them.",
      "timestamp": "2025-08-12T12:04:26.780163"
    },
    {
      "text": "the DC Guard. You will see them flowing into the streets of Washington in the coming week.",
      "timestamp": "2025-08-12T12:04:31.455063"
    },
    {
      "text": "flowing into the streets of Washington in the coming week. At your direction as well, sir, there are other units.",
      "timestamp": "2025-08-12T12:04:36.032935"
    },
    {
      "text": "At your direction as well, sir, there are other units we are prepared to bring in all their national guard",
      "timestamp": "2025-08-12T12:04:40.742865"
    },
    {
      "text": "We are prepared to bring in other National Guard units, other specialized units. They will be",
      "timestamp": "2025-08-12T12:04:45.346941"
    },
    {
      "text": "other specialized units, they will be strong, they will be tough.",
      "timestamp": "2025-08-12T12:04:49.504281"
    },
    {
      "text": "strong they will be tough and they will stand with their law enforcement partners this is not",
      "timestamp": "2025-08-12T12:04:53.799378"
    },
    {
      "text": "and they will stand with their law enforcement partners. This is nothing new for DOD, as the president noted.",
      "timestamp": "2025-08-12T12:04:58.263225"
    },
    {
      "text": "Thank you for D.O.D. as the President noted at the border. We've got 10,000",
      "timestamp": "2025-08-12T12:05:02.828300"
    },
    {
      "text": "At the border, we've got 10,000 troops down there who've been operating in",
      "timestamp": "2025-08-12T12:05:07.148828"
    },
    {
      "text": "and troops down there who have been operating in defense cooperation areas. Defense",
      "timestamp": "2025-08-12T12:05:11.378552"
    },
    {
      "text": "defense cooperation areas, defense zones where there's zero.",
      "timestamp": "2025-08-12T12:05:15.301095"
    },
    {
      "text": "zones where there's zero zero illegal crossings because of troops",
      "timestamp": "2025-08-12T12:05:19.289528"
    },
    {
      "text": "Zero illegal crossings because of troops on strikers scanning aboard we've been protecting",
      "timestamp": "2025-08-12T12:05:23.373318"
    },
    {
      "text": "on strikers scanning the board. If we've been protecting other people's borders for 20 years, it's about",
      "timestamp": "2025-08-12T12:05:28.121252"
    },
    {
      "text": "other people's borders for 20 years. It's about time we protect our own. I'm working with the ice.",
      "timestamp": "2025-08-12T12:05:32.864409"
    },
    {
      "text": "time we protect our own. I'm working with ICE and CBP in Los Angeles.",
      "timestamp": "2025-08-12T12:05:37.046982"
    },
    {
      "text": "and CBP in Los Angeles. We did the same thing working with the California National",
      "timestamp": "2025-08-12T12:05:41.214526"
    },
    {
      "text": "did the same thing. Working with the California National Guard, working with ICE officers, I saw...",
      "timestamp": "2025-08-12T12:05:45.862109"
    },
    {
      "text": "guard working with ICE officers, ICE officers deserve to do their job.",
      "timestamp": "2025-08-12T12:05:49.934943"
    },
    {
      "text": "officers deserve to do their job and not be attacked. We will work along the way.",
      "timestamp": "2025-08-12T12:05:54.470920"
    },
    {
      "text": "and not be attacked. We will work alongside all in DC police and federal...",
      "timestamp": "2025-08-12T12:05:58.934768"
    },
    {
      "text": "all in DC police and federal law enforcement to ensure this city is",
      "timestamp": "2025-08-12T12:06:03.188400"
    },
    {
      "text": "law enforcement to ensure this city is safe. This city is beautiful.",
      "timestamp": "2025-08-12T12:06:07.467662"
    },
    {
      "text": "state, this city is beautiful. And as I always say about President Trump to the",
      "timestamp": "2025-08-12T12:06:11.857142"
    },
    {
      "text": "And as I always say about President Trump to the troops, he has their back and my message to the National Guard",
      "timestamp": "2025-08-12T12:06:16.469542"
    },
    {
      "text": "He has their back and my message to the National Guard and federal law enforcement in Washington.",
      "timestamp": "2025-08-12T12:06:20.874943"
    },
    {
      "text": "and federal law enforcement in Washington is we have your back as well. Be tough.",
      "timestamp": "2025-08-12T12:06:25.507821"
    },
    {
      "text": "We have your back as well. Be tough, be strong, be right behind you. Thank you.",
      "timestamp": "2025-08-12T12:06:30.366819"
    },
    {
      "text": "Be strong right by",
      "timestamp": "2025-08-12T12:06:34.124932"
    },
    {
      "text": "I'm gonna ask her, bam, because she's now, as you heard, we say she's...",
      "timestamp": "2025-08-12T12:06:38.893424"
    },
    {
      "text": "because she's now, as you heard me say, she's really a judge of a lot of what we're talking about.",
      "timestamp": "2025-08-12T12:06:43.693909"
    },
    {
      "text": "really a charge of a lot of what we're talking about. She's done an incredible job.",
      "timestamp": "2025-08-12T12:06:48.333449"
    },
    {
      "text": "at a bad, she's done an incredible job. The people are going to start to see the fruits of her labor.",
      "timestamp": "2025-08-12T12:06:53.337779"
    },
    {
      "text": "people are going to start to see the fruits of our labor and tips and make a few words of us.",
      "timestamp": "2025-08-12T12:06:59.237682"
    },
    {
      "text": "and Tim, and maybe you could say a few words about what we're talking about here. Sir, sir, sir.",
      "timestamp": "2025-08-12T12:07:03.889950"
    },
    {
      "text": "while we're talking about him.",
      "timestamp": "2025-08-12T12:07:07.812454"
    },
    {
      "text": "Let me be crystal clear. Crime indeed.",
      "timestamp": "2025-08-12T12:07:11.927615"
    },
    {
      "text": "Let me be crystal clear crime and DC is ending and ending today. We are going",
      "timestamp": "2025-08-12T12:07:16.378756"
    },
    {
      "text": "See is ending and ending today. We are going to use every power we have.",
      "timestamp": "2025-08-12T12:07:20.872684"
    },
    {
      "text": "to use every power we have to find criminals here. President, thank you for-",
      "timestamp": "2025-08-12T12:07:25.398710"
    },
    {
      "text": "to fight criminal fear. President, thank you for caring about our capital. Family.",
      "timestamp": "2025-08-12T12:07:30.079722"
    },
    {
      "text": "caring about our capital. Families come here every summer.",
      "timestamp": "2025-08-12T12:07:34.134617"
    },
    {
      "text": "please come here every summer our museums are free we have the nationals",
      "timestamp": "2025-08-12T12:07:38.512649"
    },
    {
      "text": "Our museums are free. We have the nationals do. We have the national gallery.",
      "timestamp": "2025-08-12T12:07:43.162288"
    },
    {
      "text": "through. We have the national gallery. These things should be a place for",
      "timestamp": "2025-08-12T12:07:47.579459"
    },
    {
      "text": "These things should be a place where everyone can come and feel safe.",
      "timestamp": "2025-08-12T12:07:51.869828"
    },
    {
      "text": "everyone can come and feel safe. Behind me and to my side we have...",
      "timestamp": "2025-08-12T12:07:56.051337"
    },
    {
      "text": "Behind me and to my side we have some of the best career law enforcement and",
      "timestamp": "2025-08-12T12:08:00.514879"
    },
    {
      "text": "some of the best career law enforcement and prosecutors in the country who are",
      "timestamp": "2025-08-12T12:08:04.844280"
    },
    {
      "text": "prosecutors in the country who are ready to take this on.",
      "timestamp": "2025-08-12T12:08:08.810745"
    },
    {
      "text": "ready to take this on. As the president said,",
      "timestamp": "2025-08-12T12:08:13.263512"
    },
    {
      "text": "The president said Terry Cole is going to be supervising.",
      "timestamp": "2025-08-12T12:08:18.846694"
    },
    {
      "text": "very cold is going to be supervising the Metro Police Department.",
      "timestamp": "2025-08-12T12:08:23.394950"
    },
    {
      "text": "the Metro Police Department. Gatti Saralta, our US Marshal.",
      "timestamp": "2025-08-12T12:08:27.884435"
    },
    {
      "text": "Gatti Saralta, our US Marshal, is going to be supervising Kamei-",
      "timestamp": "2025-08-12T12:08:32.633641"
    },
    {
      "text": "is going to be supervising command and control. The entire...",
      "timestamp": "2025-08-12T12:08:37.279092"
    },
    {
      "text": "and control the entire operation.",
      "timestamp": "2025-08-12T12:08:41.277817"
    },
    {
      "text": "Operation Our deputy attorney general Todd Blanch and I will be working",
      "timestamp": "2025-08-12T12:08:46.098699"
    },
    {
      "text": "Attorney General Todd Blanchon, I will be working with them closely along with",
      "timestamp": "2025-08-12T12:08:50.843557"
    },
    {
      "text": "with them closely along with our great FBI director, Tash Batell.",
      "timestamp": "2025-08-12T12:08:55.095166"
    },
    {
      "text": "our great FBI director, Cash Patel. Cash is going to talk to you in a minute about what we-",
      "timestamp": "2025-08-12T12:09:00.053905"
    },
    {
      "text": "Cash is going to talk to you in a minute about what we did in Virginia recently with Governor",
      "timestamp": "2025-08-12T12:09:04.541408"
    },
    {
      "text": "We did in Virginia recently with Governor Youngkin. Many of you covered that and it was tremendous.",
      "timestamp": "2025-08-12T12:09:09.116975"
    },
    {
      "text": "yonkin. Many of you covered that and it was tremendously successful. Not only",
      "timestamp": "2025-08-12T12:09:13.772216"
    },
    {
      "text": "successfully successful. Not only that, our secret weapon here in DC is",
      "timestamp": "2025-08-12T12:09:18.115101"
    },
    {
      "text": "our secret weapon here in DC is US Attorney Jeanine Piro one of the",
      "timestamp": "2025-08-12T12:09:22.531255"
    },
    {
      "text": "US Attorney Jeanine Piro, one of the toughest prosecutors and a former judge.",
      "timestamp": "2025-08-12T12:09:26.964614"
    },
    {
      "text": "have this prosecutor's and a former judge and she is going to be talking about",
      "timestamp": "2025-08-12T12:09:31.287630"
    },
    {
      "text": "And she is going to be talking about juvenile crime, how it's out of control here.",
      "timestamp": "2025-08-12T12:09:35.714584"
    },
    {
      "text": "and all crime, how it's out of control here, and what she's going to do to fight back.",
      "timestamp": "2025-08-12T12:09:40.666779"
    },
    {
      "text": "and what she's going to do to fight back. No more, no more.",
      "timestamp": "2025-08-12T12:09:45.386928"
    },
    {
      "text": "No more, no more crime rampant in our view.",
      "timestamp": "2025-08-12T12:09:49.759531"
    },
    {
      "text": "crime ramped in our beautiful capital. No more",
      "timestamp": "2025-08-12T12:09:54.002434"
    },
    {
      "text": "beautiful capitals. No more teenage girls beating a disabled man.",
      "timestamp": "2025-08-12T12:09:58.229129"
    },
    {
      "text": "teenage girls beating a disabled man to death. No more of that.",
      "timestamp": "2025-08-12T12:10:02.564210"
    },
    {
      "text": "to death. No more of that. No more drive-by. We're going to do",
      "timestamp": "2025-08-12T12:10:07.298827"
    },
    {
      "text": "no more dry buys. We're going to do everything we can and working with the",
      "timestamp": "2025-08-12T12:10:11.903804"
    },
    {
      "text": "thing we can and working with the ATF. ATF direct.",
      "timestamp": "2025-08-12T12:10:16.288242"
    },
    {
      "text": "ATF, ATF director Driskel and command throughout the Army.",
      "timestamp": "2025-08-12T12:10:20.471030"
    },
    {
      "text": "Dr. Driskel and Commander of the Army. We're going to all work together.",
      "timestamp": "2025-08-12T12:10:25.189827"
    },
    {
      "text": "We're going to all work together. That's what we all do in this room. We work together.",
      "timestamp": "2025-08-12T12:10:29.583724"
    },
    {
      "text": "That's what we all do in this room. We work together. We fight. Do not underestimate.",
      "timestamp": "2025-08-12T12:10:34.138128"
    },
    {
      "text": "We fight do not underestimate one person in this room",
      "timestamp": "2025-08-12T12:10:38.106670"
    },
    {
      "text": "One person in this room. We're going to make DC beautiful. We're gonna make DC",
      "timestamp": "2025-08-12T12:10:42.552194"
    },
    {
      "text": "We're going to make DC beautiful. We're gonna make DC safe again. One other thing, just go.",
      "timestamp": "2025-08-12T12:10:47.159320"
    },
    {
      "text": "safe again. One other thing just at the warmth a few days ago the area",
      "timestamp": "2025-08-12T12:10:51.594704"
    },
    {
      "text": "At the war a few days ago the area of the war Carrie Cole reached out to",
      "timestamp": "2025-08-12T12:10:55.995513"
    },
    {
      "text": "of the war. Carrie Cole reached out to me. Not even nightfall on the weekend.",
      "timestamp": "2025-08-12T12:11:00.337950"
    },
    {
      "text": "me not even nightfall on the weekend. We're so many families in turisco.",
      "timestamp": "2025-08-12T12:11:04.581807"
    },
    {
      "text": "were so many families in turskow. A guy's overdosing from spittin' all on a-",
      "timestamp": "2025-08-12T12:11:09.129382"
    },
    {
      "text": "A guy's overdressing from spit and all on a park bench in the middle of",
      "timestamp": "2025-08-12T12:11:13.373580"
    },
    {
      "text": "Park bench in the middle of families around the administer",
      "timestamp": "2025-08-12T12:11:17.443608"
    },
    {
      "text": "families around. They administer Narcan and saved his life. No more.",
      "timestamp": "2025-08-12T12:11:22.201343"
    }
  ],
  "insights": {
    "insights": [
      "President Trump's executive order on March 27th made DC safe and beautiful again by removing over 70 homeless camps and enforcing laws against graffiti on monuments.",
      "The US Park Police are responsible for enforcing laws in federal park properties, including the National Mall, and have been working to clean up the area and make it safe for visitors.",
      "The DC National Guard will be operationalized by the Secretary of the Army and will be deployed to the streets of Washington in the coming week to support law enforcement efforts.",
      "The President is working with ICE and CBP to protect the city and ensure that it is safe for visitors, and is committed to supporting law enforcement and the National Guard in their efforts.",
      "The administration is taking a comprehensive approach to addressing crime in DC, including working with the FBI, ATF, and US Attorney's office to identify and prosecute criminals and make the city safe again.",
      "The President is committed to making DC beautiful and safe again, and is working with law enforcement and other agencies to achieve this goal."
    ]
  },
  "session_ended": "2025-08-12T12:11:25.108255"
}